{
	"title": "Cuchulainn and the Champion's Portion",
	"subtitle": "Part 1 - Bicriu's feast",
	"content": [
		"There was once a warrior of the Red Branch in Ulster whose name was Bicriu of the bitter tongue. He had a terribly sour disposition, because in his youth he had taken a wound from a javelin thrown into his kidneys. The injury stayed with him, and never fully healed, and it meant that he had to eat only the plainest food: porridge and eggs, and could never eat anything rich or fine, nor drink anything stronger than buttermilk. So Bicriu could take no pleasure in feasting, and this, it was felt, was what soured him. For Bicriu's greatest pleasure in life became the stirring up of trouble and strife between other people.",
		"Eventually, Bicriu got to be such a problem that Conchubar Mac Neasa, the king of Ulster, had to ask him to leave Emain Macha, and stay in his own holding. And there it was that Bicriu had to stay, and there it was that Bicriu built for Conchubar Mac Neasa and the Red Branch warriors, the finest feasting hall that had ever been seen in Ireland. This hall had twelve different houses for the twelve houses of the Red Branch, a high seat in the middle for Conchubar Mac Neasa, and a little balcony overhanging it all for Bicriu himself and his wife to sit in. It was built of the finest materials, furnished and decorated, gilded and bronzed and every inch of it covered in carvings and decorations, beautiful to see. And when it was finished to the highest standards of the finest craftsmen in Ireland, Bicriu started to furnish it with tapestries and cushions and all of the most comfortable things.",
		"And when the hall was built, and was in readiness for his great feast, Bicriu set off for Emain Macha to invite Conchubar Mac Neasa and all his warriors, and all their families and retainers, to come to his feast. Conchubar was happy enough to go, but Fergus Mac Roigh said no, if we go there will be more of us left dead than alive! He will stir up such fighting among us. Seeing that they were hesitant to accept his invitation, Bicriu said that if they did not go, he would stir up strife between every man and his son in Ulster, till they came to death blows. And if that wasn't enough, he would stir up strife between every woman and her daughter in Ulster, and then he would stir up all the women of Ulster to fight among themselves, till they beat their breasts against each other and turned their milk sour.",
		"So at that terrible threat, the men of Ulster called a meeting. The steward, Sencha, a very wise man, suggested that they go to Bicriu's feast, but that they put some conditions on him, to limit the trouble he could cause. Sencha counselled that they put Bicriu under a guard of eight men, and as soon as the fest began, have him leave the hall and not return until the feast was done. Bicriu agreed to these terms, and went off to his home to get everything in order, but unbeknownst to the men of Uslter, he had been hard at work while they were discussing what to do.",
		"First, he had sought out Laoighre Budhach, a young warrior of the Red Branch. He met Laoighre and began to praise him and butter him up. He reminded him of all his accomplishments, and said \"Do you know, Laoighre, it's a mystery to me why, after all your great deeds, the champion's portion of Ulster is not give to you at every feast.\" And Laoighre conceded that he had a point there, that maybe he should claim the champion's portion. And Biciriu told him then that at his own feast the champion's portion would be a prize indeed: a boar that had been fed nothing but milk and sweet herbs since it had been born, a bullock fed nothing but milk and sweet grass, a vat of wine big enough to fit three men into it, and honey cakes made of oats, and all kinds of delicious things. \"So be sure, Laoighre, that when you're at the feast you have your charioteer claim the champion's portion for you,\" said Bicriu, and Laoighre promised that he would.",
		"Next Biciriu sought out Conall Cearneach. He sidled up to him and said \"Conall, I don't understand why such a warrior as you doesn't claim the champion's portion at every feast, since you are the man who guards the border, and keeps us all safe, and clearly the greatest warrior in all of Ulster.\" And by the time he was finished with his flattery, Conall Cearnach was resolved to claim the champion's portion at Bicriu's feast for his own.",
		"Then Bicriu went to find Cuchulainn, and when he told Cuchulainn what the champion's portion was going to be at his feast, Cuchulainn swore that if anyone tried to keep him from it, he would leave their head on the floor.",
		"So Bicriu was not a bit put out by the restrictions Sencha put on him, and he went home in very good cheer to put the final touches to his great feast.",
		"On the day of the feast, Conchubar arrived with all his family, his servants and retainers, and all the warriors of the Red Branch arrived, likewise accompanied. It took some time for them all to settle in, but there was room for everyone in Bicriu's magnificent feasting hall. When they were all seated according to their positions, Bicriu stood up under his guard of eight men and cried out \"Let the Champion's Portion be claimed!\" and off he went to his balcony, laughing all the way.",
		"Sure enough, Laoighre Buadhach's charioteer stood up, and claimed the portion for Laoighre, at the same time as Conall Cearnach's charioteer claimed it for him, and then Laeg, Cuchulainn's charioteer shouted them both down and said it was clear that Cuchulainn was the greatest warrior in Ulster! The three champions leaped to their feet and flung themselves at each other, Laoighre and Conall attacking Cuchulainn. They fought so fiercely the sparks flew from their blades, making it look like half of the hall was on fire. Sencha told Conchubar he had to put a stop to this fight, it wasn't fair, two against one! And, any moment now, the other warriors would pick a side. So Conchubar stood up, unarmed, and walked into the midst of the whirling blades so that none of them could strike at each other without striking their king. They dropped their swords rather than harm their king, and Sencha declared that this was a question for another day.",
		"They divided the champion's portion evenly among everyone there in attendance, and the three warriors gave their oath that they would not fight over this again, but that they would wait for a judge to be found, and abide by the judgement forevermore.",
		"They took their places at the feast with a bad grace, and Bicriu was very disappointed to see the matter settled for now. But then he spied another opportunity. He saw that the women were going out to take a walk, and ran downstairs to catch up with Laoighre's wife. He called her aside and whispered to her that the first woman to come in from the walk would be counted the first woman in Ulster, Queen before all the other women, and that he thought she should be the one, on account of her great beauty and her husband's great prowess. He said the same thing to Conall Cearnach's wife, and to Emer, the wife of Cuchulainn. The women went out for their walk, and met some distance away from the hall. They started to walk back at a stately pace, but each of them was trying to make sure she stayed ahead of the others, so they walked faster and faster, and before long they had their skirts hiked up around their waists and were sprinting as fast as they could go.",
		"The men inside the hall heard a noise like thunder and thought there must be an army coming to destroy them, but Sencha realized that Bicriu had stirred up the women. He called out to the warriors to close the door, or there would surely be bloodshed! They slammed the front doors closed just as Emer put her hand on the door frame. The women called in from outside, demanding to know why they had been locked out. Sencha suggested that, to avoid bringing things to a fight, they should have a war of words: each of them made her case for why she was the best woman in Ulster, and worthy of entering Bicriu's hall first.",
		"Laoighre's wife spoke of her own beauty, Conall's wife spoke of her own virtues, and then Emer had her turn and said \"Shaped like cows and led by cows are the women of Ulster, when set beside Cuchulainn's wife.\" And Emer's words had everyone ready to come to blows again.",
		"Laoighre and Conall punched beams out of the walls of the feasting-hall to let their wives come in, but when Cuchulainn went to let Emer in, he lifted the whole side of the house up, so that she and all her fifty waiting-women could enter, and when they were inside, he let it drop. Such was the force of the drop that the side of the hall sank seven feet into the ground, and Bicriu and his wife were flung from their seats on the balcony, into the stable where the hounds were kept. Bicriu was furious when he saw what had become of his wonderful feasting hall, and he stormed in. Covered in dog-muck as he was, his guards did not recognize him, so he stood up in front of all the assembly and put a geasa on every man of Ulster that they were neither to eat nor drink nor rest till they had set his feasting-hall to rights, just as it had been.",
		"The warriors of Ulster set to tugging at the walls, but no matter how hard they tried, they could not get the feasting hall to sit straight. They begged Cuchulainn to help them, but he told them he was too tired: he had spent that day taming a magical horse that came up out of a lake. That horse was the Grey of Macha, and it served him well and bravely for many years after that. After much persuasion, he got up at last and strained and pulled at the wall to try and set it straight. N o matter how hard he tried, he could not lift the hall, and he became frustrated, and the hero light shone around his head, and all his hair pulled into his skull. He pulled at the wall so hard that a warrior could have fit his foot between any two of his ribs, and at last he yanked the hall upright and settled it back onto its foundations.",
		"After all the commotion, Cuchulainn declared that he was far too tired to fight anyone that day, until he had had his fill of food and rest, and the other warriors agreed to postpone the deciding of the champion's portion to another day."
	]
}