{
	"title": "Cuchulainn: The Wooing of Emer",
	"content": [
		"After the deeds of his boyhood, and his taking up of arms, Cuchulainn became a warrior of great renown. But the men of Emain Macha had one problem with him. He had grown into a beautiful young man, and all their wives and daughters sighed when he walked past. It was said that he was perfect in every way, but for three faults: that he was too young, too daring, and too beautiful.",
		"The warriors of the Red Branch in Emain Macha wanted Cuchulainn to marry, so that their wives would stop looking at him, but also so that he would have a son who would inherit his great talents. But Cuchulainn wasn't interested in any of the women they introduced him to. He refused to take a wife, no matter how lovely she was or how big a dowry her family offered, because he said he would not marry a woman who was not his equal.",
		"At last, Cuchulainn heard of a woman named Emer, who he thought might meet his standards. She was the daughter of Forgall the Wily, and he was very protective of her. Emer possessed the six gifts that made her ideal for her time. They were beauty, voice, sweet speech, needlework, wisdom and chastity. Cuchulainn took his friend and charioteer, Laeg, with him, and they set out to pay Emer a visit.",
		"Emer was instructing the women of the area in needlework and craft, when her sister saw a chariot approaching. She described to Emer the beautiful chariot on its way towards them, richly decorated with gold and silver and bronze. She described the two men in the chariot: one red-haired a wiry, and the other dark-haired and melancholy: the most beautiful man in Ireland.",
		"Cuchulainn, when he arrived, spoke to Emer in code words and phrases; complicated riddles and puns that made no sense to the other listeners. While Laeg looked at him aghast (that was not how he thought one should talk to a beautiful woman), Emer smiled at him, and replied in the same vein of seeming nonsense, incomprehensible to all the others. They went on in that way for some time, and then Cuchulainn peeked down the top of her shirt and said \"I see a fine country there with a sweet resting place.\"",
		"Emer replied, \"No man shall rest there unless he can leap over three walls, kill three groups of nine men with one blow, leaving one man in each group alive, and slay one hundred men at each of the fords between here and Emain Macha.\"",
		"Cuchulainn and Laeg then went back to Emain Macha, and Laeg started to console his friend: from what he could gather, Cuchulainn had been nervous and had made a mess of it. But Cuchulainn explained to him that they had spoken in riddles, and that Emer had not only been quick enough to figure out what he was saying, she was clever enough to play the game with him. They both knew her over-protective father would not approve of him seeking her out, but he had wooed her, and she had accepted. She had set him certain tasks that he had to complete before they could be married.",
		"Now, a servant who was present for the meeting brought an account of it to Forgall the Wily. Forgall managed to figure out what had happened, and he was furious that his precious daughter had fallen for that madman from Ulster! He thought Cuchulainn a dangerous lunatic, and he was determined to put a stop to this before it could go any further. He disguised himself as a trader from Gaul and visited Emain Macha in disguise.",
		"When the time came for the guest to hear the stories of the heroes of Ulster, Forgall expressed great surprise to King Conor Mac Neasa. \"It's such a shame,\" he said, \"that with such great warriors, you don't think enough of them to send them to train with the warrior-woman, Scathach, the greatest trainer of heroes in the world.\" Cuchulainn, Conal Cearnach, and a few of the other warriors heard this and decided that nothing would do but they go at once to seek out this Scathach, who lived on the remote Island of Skye in Scotland.",
		"Now, of course, this had been Forgall's plan all along. The journey to Scathach's home was long and dangerous, and with luck, Cuchulainn would be killed along the way. Even if he did get there, Scathach's training was harsh and many did not survive it, and she was fighting a war against a neighbouring warrior-woman named Aoife, and that war claimed the lives of many students.",
		"At best, then, Forgall thought Cuchulainn would die, but at worst, he would be away for several years, and Forgall could ensure that his Emer was safely married to a more suitable man before he returned. So he made the most of Cuchulainn's absence, and quickly arranged for Emer to marry the King of Munster, a man named Lugaid. The wedding feast was arranged, and all was ready, but when Emer came out to meet her bridegroom, she took his face between her two hands and said to him \"I love Cuhculainn, and Cuchulainn loves me. He will come back for me, and if you take me against my will, it will mean you have no honour, and he will take his revenge on you for it.\"",
		"Over Forgall's protests, Lugaid left.",
		"As Emer predicted, as soon as Cuchulain finished his training with Scathach and came home to Ulster, his first act was to come back for Emer.",
		"But while he was away, Forgall the Wily had made preparations. He had fortified his stronghold with three walls, and gathered his best warriors in the courtyard. The strongest were in three groups of nine, each one commanded by one of his own sons. Cuchulainn was not daunted by these preparations: he simply leaped over the wall, and struck down each of the three groups of men with one blow of his sword, leaving Emer's brothers unharmed. When Forgall saw this, he was sure Cuchulainn would kill him for trying to keep his daughter away from him. He climbed over the walls to try and escape, but he slipped and fell to his death. Cuchulainn picked up Emer, and her weight in gold, and leaped back over the three walls as easily as he had arrived.",
		"He and Emer were pursued by Forgall the Wily's followers, and at each ford between her house and Emain Macha, Cuchulainn had to stop his chariot and hold them off. At each ford, he killed a hundred men, fulfilling the last of the conditions she had set for him.",
		"Emer grieved for her father, but she told Cuchulainn she did not hold him responsible, as he had not actually killed her father: his death had been an accident, and his own fault. So the two of them were married, and proved to be well-suited. They were each other's equal it wit and wisdom, and though Cuchulainn was often away with battles and feats of arms, and often spent time with other women, Emer was without jealousy, because she knew he would always return to her."
	]
}