{
	"title": "Cuchulainn and the Champion's Portion",
	"subtitle": "Part 3 - Cu Roi Mac Dara and the Beheading Test",
	"content": [
		"Cu Roi Mac Dara was a great magician, who often travelled around the world in search of knowledge and wonders. No matter where he was in the world, he could keep a link to his home to know what was going on.",
		"Sencha, the steward of Emain Macha, sent Laoighre Buadach, Conall Cearnach, and Cuchulainn to Cu Roi for him to judge which of them was the greatest warrior in Ulster, and deserving of the Champion's Portion. Cu Roi was away on his travels at the time, but the three warriors were welcomed in by his daughter, Blathnaid, who had been left instructions by her father as to what she was to do with them.",
		"Cu Roi Mac Dara had a way of keeping his fort safe no matter where he was in the world, by use of an enchantment. Every night, at nightfall, the fort would spin around like a mill wheel, and all the entrances would be hidden until daylight. There was a seat at the top of the fort where a single man could stand guard, and Blathnaid told the warriors that their test would be to each stand guard over Cu Roi's fort for one night.",
		"Laoighre took the first night, and after the fort spun itself around and all the entrances were hidden, he settled in on the seat to watch. Everything was quiet at first, and then a giant strode up out of the sea. He was carrying a sheaf of stripped oak trunks in his arms, and he started to throw them at Laoighre. Laoighre was able to doge out of their way, and he threw his spear back at the giant, but could not hit him. They exchanged missiles, neither one able to land a blow on the other, until the giant reached out with his great long arm, and though Laoighre was a large man, the giant picked him up in one hand as if he'd been an infant, and threw him over the top of Cu Roi's fort to land in a heap on the other side.",
		"The people inside the fort could see nothing with the walls sealed up by Cu Roi's magic, but they heard the sound of Laoighre landing, and they thought he had leaped over the fort to show his prowess, as a challenge to the other two. When daylight came and the doors reappeared, Laoighre did not contradict them.",
		"The next night Conall Cearnach watched, and met the same giant, and met the same fate. He said nothing about his encounter, but let the people of the fort believe that he had leaped over the fort like Laoighre.",
		"When Cuchulainn's turn came, he had no rest. Nine lights came over the hill, carried by nine warriors. Cuchulainn called out to them: \"If you are friends, stop. If you are foes, come and be killed by me.\" They attacked him, and he made a pile out of their heads. This happened three times, and only then did the same giant come striding out of the sea. He threw his oaks at Cuchulainn, and Cuchulainn threw his spears, but when the giant reached out to pick him up, Cuchulainn ran up his arm, up to his shoulder, and hacked off his head.",
		"Not satisfied with the pile of heads, topped by the giant's head, Cuchulainn decided that to show he was the equal of the other two warriors, he was going to have to jump over the fort, as they had done. He ran at it, and managed to jump half way up the wall, but he hit his head and bounced back down again. He tried again and again, but no matter how hard he tried, he couldn't quite jump high enough. He tried and tried, and eventually got so frustrated that he became furious. The hero light shone around his head, and he gave his hero's salmon-leap and flung himself over the fort.",
		"In the morning, Blathnaid declared that Cuchulainn was the victor, and should have the champion's portion. But Laoighre Buadhach and Conall Cearnach complained that Cuchulainn must have had help from his friends in the Otherworld, and they refused to accept her judgement.",
		"Not long after this, there was a feast at Emain Macha. Conall Cearnach was away guarding the border, and Cuchulainn was in Dun Dealgan with his wife, but all the other warriors of the Red Branch were present. Into the feast strode a tall, strange-looking man with a cow-hide tied around his waist, carrying a great big axe. He greeted the men of Ulster, and said his name was Uabh, the Stranger, and that he had been searching the length and breadth of Ireland for a man of honour, which he had not found yet. He had come to Ulster because he had heard that this was the province where the men were the bravest, and where honour was held in the highest esteem. \"All I want,\" Uabh said, \"Is for a man to submit to my test. One man to agree to cut my head off with this axe, and then tomorrow, to let me cut his head off.\"",
		"Laoighre Buadhach volunteered, and Uabh laid his head down on the block. Laoighre brought up the great heavy axe, and swung it down on his head so hard that it went into the wood behind him. A great fountain of blood rushed out, and then to everyone's horror, Uabh the Stranger stood up, picked up his head, pulled his axe out of the wood, and walked out the door.",
		"Now Laoighre was terrified to face this supernatural foe the following day, and so he ran away and hid. When Uabh returned, there was no sign of Laoighre Buadhach. Uabh started to mock the men of Ulster, and say they were all cowards, and their word was worth nothing. Conall Cearnach couldn't stand to hear his home maligned in this way, so he stepped up to take Uabh's test. He cut off Uabh's head, and then chopped the head in half. But Uabh stood up anyway, and picked up the pieces of his head before walking away.",
		"The next day, Conall Cearnach was nowhere to be found. Uabh turned up and mocked the men of Ulster, calling them cowards to a man. At this, Cuchulainn leaped up and said he'd cut Uabh's head off without any agreement. Uabh laid his head down on the block, and Cuchulainn chopped his head off, and threw it up into the rafters. As before, Uabh stood up and retrieved his head, before going on his way. The next day, Cuchulainn was terrified, and terribly sad. He did not want to die, but he could see no other option. The people of Ulster were so upset they started keening him. They tried to persuade him to run away, but Cuchulainn said that though he had no wish to die, he would rather that than break his word. Uabh arrived, and asked Cuchulainn if he was going to keep up his end of the bargain. Cuchulainn put his head onto the block. Uabh told him to stretch his neck out a little bit more, but Cuchulainn snapped at him to stop tormenting him and get it over with. Uabh lifted his great axe up, and brought it down as hard as he could, but he brought it down blunt side down, onto the ground beside Cuchulainn's head. When Cuchulainn looked around, he saw that Uabh had transformed, and Cu Roi Mac Dara stood before him.",
		"Cu Roi said that this had been his final test. He said that Cuchulainn was the champion of Ulster from this day forward, with the rights to the Champion's Portion, and that his wife was the first woman in Ulster, above all the other women. Anyone who disputed this would have him to answer to, and he vowed to kill anyone who kept Cuchulainn from what was rightfully his.",
		"And that was how the Champion's Portion of Ulster was decided."
	]
}