{
	"title": "Cuchulainn's Training With Scathach",
	"content": [
		"When Cuculainn set out to court his wife, Emer, her father, Forgall the Wily, was dead set against it. He knew Cuchulainn by reputation, and believed his wonderful daughter would have a terrible life with him, so he set out to do everything he could to keep the pair. He disguised himself as a merchant from France, and went to King Conchubar's court at Emain Macha with wares to trade. At the feast that evening, he praised Conchubar's brave Red Branch warriors, and then wondered aloud why the king did not think highly enough of them to send them to train with Scathach? Did they not know that she was the greatest trainer of warriors in all the world?",
		"Now Cuchulainn was never satisfied with his skills, and when he heard mention of this incredible trainer, nothing would do but he set off at once, which of course, was Forgall's plan. Two of the greatest warriors of the Red Branch, Laoighre Budhach and Conall Cearnach, said that they would go with him and keep him company. Now, Scathach lived across the sea and on the other side of Alba, far to the north, on an island that bore her own name. The three set out on their long journey, but no sooner had their boat landed on the shores of Alba, than Forgall the Wily sent a vision of Emain Macha. Laoighre and Conall were so overcome by homesickness that they couldn't bear to go on, and they turned back to Ireland there and then, leaving Cuchulainn alone in the wilderness.",
		"He journeyed onwards, determined to find Scathach's island, even though he didn't know the way. On the road, he met a great beast that looked like a lion. It came bounding across the plains towards him, but it didn't attack. Every direction that Cuchulainn tried to go in, the beast would jump in front of him, barring his way. At last, he understood that it wanted to help him, and he leaped up onto its back, and away the lion beast raced across the plains of Alba. Four days and four nights it carried him, and then they passed by some youths, who laughed to see a man riding on the back of such a strange creature. Unable to bear their ridicule, Cuchulainn bade farewell to the beast, and went on his way on foot.",
		"He came to a house, and the woman of the house called him by name, and gave him a warm welcome welcome. She was a king's daughter, who had stayed with Cuchulainn's family when she was younger, and she was delighted to see him. When he was well fed and well rested, she told him the road that he needed to take to get to Scathach's island, and she warned him that Forgall the Wily had left traps in his way, filling valleys with monsters and putting obstacles in Cuchulainn's path. She told him how to avoid all these dangers, and arrive safely at Scathach's island.",
		"So Cuchulainn was able to avoid Forgall's traps, and in this way he arrived at last at Scathach's island. His joy at seeing the end of his journey was nothing to the joy he felt when he saw four men of Ulster; friends from Emain Macha, who were staying nearby. One was his best friend, Ferdia Mac Daman, who had arrived some time before to train with Scathach. The others were the sons of Uisneach, Naoise, Ainnle and Ardan, the sons of Uisneach who were in exile with Naoise's wife Deirdre. They were delighted to see another Ulsterman, they welcomed him with hugs and kisses, and asked him for all the news of home.",
		"After their reunion, Ferdia told Cuchulainn that in order to get to Scathach's house, he would have to cross over a chasm on an enchanted bridge. The bridge was low at each end, and high in the middle, and whenever someone stepped on it, it would buck like a wild horse, trying to shake them off. It could narrow itself to the width of a hair or shorten itself to the length of an inch, and it would do all it could to shake a newcomer off.",
		"Now, it was great entertainment among the people of Scathach's island to gather and watch strangers try to get across the bridge - for they often fell to their deaths - and a crowd had gathered while Cuchulainn and his friends had talked. In front of them all, Cuchulainn was determined to get across in one go. So he ran at the bridge, but the bridge narrowed itself and became slippery, so that he skidded back down to the bottom, and all the gathered people laughed and jeered. Twice more he ran, and each time the bridge bucked him off, and each time the crowd laughed at him. Then Cuchulainn became enraged, and the hero-light shone around his head, and he gave his salmon leap onto the middle of the bridge, and another great leap off the other end of the bridge.",
		"Now, Scathach's daughter was watching from the house, and when she saw this man coming, she thought he was the most beautiful man she had ever seen: dark haired and melancholy, with seven hero-lights in each eye, and a seven-pleated crimson cloak held in place with a brooch of gold. She welcomed him with food and drink, and she told him exactly what he should do to make sure Scathach took him on as a pupil. She sent him to where Scathach was training her own sons. Cuchulainn ambushed her, and put his sword between her breasts and demanded that she be his teacher. Impressed, Scathach readily agreed to take him on as her pupil.",
		"Cuchulainn was an apt pupil. All the skills and arts of the warrior Scathach taught him, till he had learned all that she had to teach him.",
		"Now, at this time, Scathach was at war with another warrior woman, a former pupil of hers named Aoife. One day, Scathach's three sons met Aoife's three greatest champions on the road, and from afar, Scathach could see that a fight was going to break out. She was terribly afraid for her sons, and so she sent Cuchulainn to help them. He ran to their aid, and rushed out ahead of Scathach's sons, striking the heads off of each one of Aoife's three champions, and making a pile of their heads on the ground.",
		"When Aoife heard what this foreign warrior had done to her champions, she was furious, and she challenged Scathach to single combat, to settle things between them once and for all. Aoife decided that she would be her own champion, and Cuchulainn asked Scathach for the honour of fighting as her champion. Scathach agreed to this, but before he went into battle, Cuchulainn asked her what in all the world did Aoife value the most? Scathach told that Aoife's pride and joy was her chariot, her horses and her charioteer.",
		"Aoife and Cuchulainn met with their swords drawn, ready to do battle, when Cuchulainn cried out \"Aoife's chariot is going over the edge of the cliff!\" Aoife turned to look, and Cuchulainn grabbed her, threw her over his shoulder, and carried her back to Scathach's fort. He threw her to the floor and put his sword between her breasts, demanding that she surrender. Then Scathach and Aoife made peace between them, and agreed that they would no longer make war on each other, and there was feasting and merry-making to celebrate.",
		"Aoife gave her love to Cuchulainn, and they became lovers for the rest of the time that he studied with Scathach. When he was ready to go back home to Ireland, Aoife told him that she was with child. She was sure it would be a boy, and that he would grow up to be as great a warrior as his father.",
		"Cuchulainn was thrilled with this news, and he gave Aoife a red-gold ring. He told her to name his son Connla and raise him as a warrior, and when he was old enough to wear that ring on his thumb without it slipping off, she should send him to Ireland to find his father. And so Cuchulainn returned to Ireland, a better warrior than he had ever been, and in spite of all Forgall the Wily's tricks, the very first thing he did was to go and find Emer, and make her his wife."
	]
}