{
	"title": "Deirdre of the Sorrows",
	"content": [
		"King Conchubar Mac Neasa came to power as a young man. He took the kingship from his foster-father Fergus Mac Roigh, for a year, but he showed such wisdom during that year, that the people of Ulster decided he should stay on as king at the end of it. When he was newly come to his throne, he and his warriors of the Red Branch were invited to a feast in the house of Felimid the Harper. Felimid was in high spirits on this night, because his wife was about to give birth to their first child, and he was very excited. He asked if Conchubar's druid, Cathbad, would make a prophecy to tell him what was in store for his baby. Cathbad placed his hands on the Felimid's wife's womb and said that the child was going to be a girl, and her name would be Deirdre, and that she would grow up to be the most beautiful woman who ever lived. \"But,\" he said, \"An excess of anything is deadly, and she will be the cause of so much trouble that she will split the Red Branch in two.\"",
		"Now, when they heard this, the men of the Red Branch demanded that the child be killed there and then, before she had the chance to fulfill her destiny, but Conchubar wanted to have the reputation of a wise king, and a merciful king, so he stopped them. He said that he could not countenance the death of an infant in the house of its father, but that he would take the child when she was born. He would have her raised up in secret, and if she grew up to be as beautiful as Cathbad promised, then he would marry her himself, and put her in such a high position that no man would dare to look at her.",
		"So he had his old nurse, Leabharcham, take the baby to a hidden valley and raise the child away from everyone else. From time to time, Conchubar would go and visit, to check how Deirdre was getting along. She grew up every bit as beautiful a child as had been prophesised, but she didn't have much affection for Conchubar, though he was fair-haired and handsome, and had no shortage of female admirers in Emain Macha.",
		"Leabharcham was very protective of Deirdre, and careful to make sure that none saw her. The only person, besides Conchubar, who she let into the valley was an old man, who would come by to help with the work. He was mute, and could tell no one about the girl in the valley and her enchanting beauty.",
		"One day, in the early springtime, when the snow was still on the ground and Deirdre was almost a woman, Leabharcham had the old man slaughter a calf for her and Deirdre. The blood spilled out onto the snow, and a raven came down to eat the bloody snow. And when she saw this, Deirdre cried out, and went into a faint. Leabharcham thought she had been upset at the sight of the blood, but Deridre told her nurse that she had fallen in love with these three colours, and she would only give her love to a man with hair as black as a raven, skin as white as snow, and cheeks as red as blood.",
		"She asked Leabharcham if she knew of any man who looked like this, and Leabharcham, unable to deny Deirdre anything she asked for, told her of the youngest son of Uisneach, a warrior of the Red Branch, young and brave and beautiful. His name was Naoise, and he had the colouring Deirdre loved. He was inseparable from his brothers, Ainnle and Ardan, and he was the most handsome warrior of the Red Branch.",
		"Deirdre pestered Leabharcham to find some way to let her see Naoise, but Leabharcham refused. She told Deirdre she'd see him soon enough, when Conchubar Mac Neasa married her and took her to Emain Macha with him. But Deirdre would not be put off. She begged Leabharcham to let her see Naoise, and eventually, Leabharcahm relented.",
		"The next time she went to Emain Macha, she told the sons of Uisneach that there was wonderful hunting to be had in the valley where she lived, and to be sure and go there the next time they went hunting. She told Deirdre she could spy on them when they came, and make sure she was not seen.",
		"But when the brothers came to the valley to hunt, Deirdre fell in love with Naoise the moment she saw him. She knew this was the only man for her. Before Leabharcham could stop her, she stepped out to greet him, and it was as if she turned from a girl into a woman at that moment. She smiled at Naoise, and flirted and cajoled him, and he fell completely in love with her the moment he saw her. She asked him if he would run away with her, but Naoise knew who she must be, and he knew that she belonged to Conchubar Mac Neasa, his king. He refused, and Deirdre put a geasa on him, that he had to run away with her.",
		"Naoise had no choice, then, but to get Deirdre as far away from Emain Macha as he could, before the king found out. His brothers Ainnle and Ardan refused to be separated from him, and the four of them fled Ulster, with their servants and retainers.",
		"There was nowhere in Ireland they could rest and be safe, so the sons of Uisneach took Deirdre across the sea to Scotland. The brothers entered into service with the king of Scotland, and became part of his army. But they never stayed in the fort with the other warriors, at the end of every day they would go off into the wilderness, no one knew where. The King of Scotland grew suspicious, and decided to find out what they were keeping a secret from him. He sent spies to follow him, and the spies reported back that the three brothers had come to a camp in the middle of nowhere, where they were greeted by the most beautiful woman any of them had ever seen. Deirdre had made a home for her and Naoise in the wilds, and she took care of him and his brothers, cooking fine food for them, and making sure they wanted for nothing.",
		"As soon as the king of Scotland heard about this great beauty, he wanted her for himself. He knew he couldn't kill the brothers, when they had sworn to serve him, so he put them on the front lines of every battle, hoping that they would be killed. They were such great warriors that this did not work, but Deirdre realized what was happening, and persuaded Naoise of the danger they were in. They left the king of Scotland's service, and fled further into the wilderness, coming at last to a remote island in the north, near to the training school of the warrior woman, Scathach.",
		"They lived in the wilds for many years, the brothers hunting, and Deirdre making a home for them.",
		"In Emain Macha, Fergus Mac Roigh was the only one brave enough to raise the subject of the Sons of Uisneach with Conchubar. When Conchubar thought of Naoise's betrayal, it never failed to drive him to a rage. But Fergus was very fond of the sons of Uisneach, and he never stopped arguing for Conchubar to forgive them, and to let them come home. He made so many arguments and so many pleas, that at last Conchubar gave in. He told Fergus he could invite the brothers back to Ulster, and place them under his own protection as a guarantee of their safety.",
		"So Fergus went to Scotland, and when he landed on the shore, he let out a shout. Far in the wilds, Naoise was playing chess with Deirdre. When he heard the shout, he jumped to his feet, saying, \"That's the shout of an Irish man!\" But Deirdre said it was not, it was definitely the shout of a Scottish man. Fergus shouted from the beach again, and Naoise leaped up, crying \"That's the shout of an Ulsterman!\" But again, Deirdre persuaded him that it was not. Then Fergus shouted again, and Naoise cried, \"That's the shout of Fergus Mac Roigh!\" And nothing Deridre said could persuade him otherwise.",
		"He asked her why she had lied, and Deirdre told him that she had had a dream the night before. A raven had flown over to Scotland from Ireland, with three drops of honey in its beak. But when it landed, the honey turned into blood. But Naoise and his brothers were so excited at the prospect of seeing Fergus again that they dismissed her dream as a woman's imaginings, and rushed to greet their dear friend.",
		"Fergus told them the wonderful news: that Conchubar Mac Neasa had finally been persuaded to forgive them, and take them back into the Red Branch. The brothers were thrilled; they had missed Emain Macha, and all their friends there. They swore an oath that they would not eat or sleep till they were back home in Emain Macha. But on the voyage back to Ireland, Deirdre never once took her eyes of the shoreline of Scotland. She sang a lament for having to leave the mountains and loughs of Scotland, the only home she had ever been happy in.",
		"When they landed on the shore of Ulster, a local man came to invite Fergus to a feast. There was a geasa on Fergus, and on all the Red Branch warriors, never to refuse a feast in their honour, and so he could not refuse. Now, this man had prepared the feast for Fergus at Conchubar's request: he was not nearly so ready to forgive as Fergus thought. Deirdre begged Fergus not to desert them, she was sure something terrible would happen. But he could not refuse. Then Deirdre berated him for being a coward, and deserting the men he'd put under his protection. He was more interested in eating and drinking than in honour! To placate her, Fergus had his son, Fiachu, take up his duty to ensure their protection.",
		"When they arrived in Emain Macha, Conchubar did not come out to greet them. He sent Leabharcham instead, and she told Naoise to hide Deirdre's face, and she brought them to the Speckled House, where the warriors of the Red Branch hung their weapons, and the heads of their enemies. They were given food and drink there, and Naoise and Deirdre played a game of chess to pass the time.",
		"Conchubar was in two minds whether or not to forgive Naoise. He wanted to let it go, he knew it made him look bad to hold a grudge for so long, but he became so furious when he thought of Deirdre getting away, that he could not bring himself to forgive Naoise. He asked Leabharcham what did Deirdre look like, was she still beautiful? And Leabharcham said, \"Oh the wilderness has ruined my poor Deirdre, she is a hag! Her skin is weathered and grey, her fingernails are dirty and broken, what teeth she has left are yellow, and her hair is coarse as a horse's mane.\"",
		"At that, Conchubar's jealousy abated, and he thought how fine it would be to welcome the brothers back into his service. But when as he thought it over, he was not sure he could trust Leabharcham to be impartial when it came to Deirdre. So he sent a servant to spy in the window of the Speckled House and report back to him.",
		"Naoise saw the man looking through the window, and he threw a chess-piece at him that knocked out his eye. The man came back to Conchubar with one eye missing, and said that it was a price worth paying to have seen Deirdre, and he would gladly give up his other eye just to look at her again.",
		"At this, Conchubar's jealousy came flooding back, and he called on his warriors to attack Naoise and the sons of Uisneach. But half of the men refused to attack their former brothers in arms, and would not fight. The others attacked the Speckled House.",
		"The sons of Uisneach put Deirde in the middle of them, and stood shoulder to shoulder in a circle around her. They were able to fight any number that came at them, and no matter what side Conchubar's men attacked from, they were met with swords and shields. Fergus Mac Roigh's son Fiachu fought Conchubar Mac Neasa's son in single combat. Conall Cearnach saw a man attacking his king's son, and without pausing to see who it was, he struck Fiachu down dead. But when he saw who it was that he had killed, he cried, \"A king's son for a king's son!\" and he cut the head off Conchubar Mac Neasa's son.",
		"Conchubar could see that his men were making no headway, so he went to Cathbad the druid for help. Cathbad agreed to help him, but only if Conchubar swore that he would not kill the sons of Uisneach. Conchubar agreed, and said he only wanted Naoise to apologise and all would be forgiven. So Cathbad sent a spell that surrounded the sons of Uisneach with a black and hungry sea. They had to swim, though they were on dry land. Naoise put Deirdre up onto his shoulders, and they swam and fought off their foes, until exhaustion overcame them and their weapons slipped from their fingers.",
		"Conchubar's men seized them, and Conchubar said that while he couldn't kill them himself, he would give a fortune to any man who would do the deed for him. None of the men of the Red Branch would do it, but at last one man stepped forward. He was the son of the King of Norway, Maigne Rough hand, and Naoise had killed his father and brothers in a battle long ago. He said he would be glad to kill them for Conchubar.",
		"Ainnle spoke up, then, and asked to be killed first. He was the youngest, and had never lived without his brothers, and did not want to be left alive after them now. Ardan, too, begged to be killed first so he did not have to watch his brothers die. Then Naoise said that he had a sword, given to him by Mananan Mac Lir, that could cut down anything in front of it. He asked Maigne Rough Hand to use his sword, and cut their heads off at the same instant. And so that is what they did: the three sons of Uisneach laid their heads down on the same block, and Maigne Rough Hand swung the sword and chopped all their heads off.",
		"When Fergus Mac Roigh came back from his feast and saw the Sons of Uisneach dead, and his own son dead besides, he burned Emain Macha to the ground. Then he, and the half of the Red Branch warriors who had refused to take part in the fight, left Ulster. They went to Conchubar Mac Neasa's greatest enemy, Queen Maeve of Connaught, and pledged their service to her.",
		"Conchubar put Deirdre into a beautiful house, and surrounded her with the finest things. He began to court her, but Deirdre's hatred towards him never cooled. She would not look at him, or speak to him, or acknowledge his presence in any way. She cast aside every gift he gave her, and took no joy in the luxuries surrounding her. He would come to sing outside her window, as he was famed for his beautiful voice, and she would shut the window, complaining of a horrible noise.",
		"After a year of this, Conchubar grew angry that all his kindness was being snubbed, and he came to her to ask her if there was any man in the world that she hated more than he. Deirde said, \"Well, I hate you with all my heart, but I hate Maine Rough Hand a little more, because he killed my Naoise.\"",
		"So Conchubar said, \"In that case, I'm going to give you to Maigne Rough Hand for a year, to do with as he pleases, and we'll see if you're any kinder to me after that.\"",
		"He sent for Maine Rough Hand to come and take Deirdre away. They placed her in Maigne's chariot, and Conchubar stood on one side of her, and Maigne on the other. On the way to Maigne's country, Conchubar joked that she was helpless as a ewe between two rams. They passed by a place where the cliffs hung over the road, and Deirdre leaned her head out of the chariot, and dashed her brains out against the rocks.",
		"She was buried in Emain Macha, near to where Naoise and his brothers lay. Conchubar could not bear the thought of them touching one another, even in death, and he had stakes of wood driven into the ground between their two graves. But the wood grew roots down into the graves, and two trees grew up, and twined together."
	]
}