{
	"title": "Ferdia at the Ford",
	"content": [
		"When Connaught invaded Ulster so that Maeve could try to steal the Brown Bull of Cooley, Cuchulainn was the only man able to stand against him. All the great warriors of the Red Branch were writhing in birth pains, brought about by the curse of Macha.",
		"Cuchulainn harried the army for many days, raiding their supply lines and ambushing the Connaught men by night, and this was wreaking havoc and costing far too many lives. So Maeve negotiated with Cuchulainn: she would halt the army by the ford over the river, if he would agree to fight one champion of Connaught each day.",
		"Cuchulainn agreed, as this would be far less work for him, too, and he knew he only had to hold Maeve's army there long enough for the Curse of Macha to end, and his friends of the Red Branch to join him, and beat back the invaders.",
		"He fought against the champions of Connaught, and killed them one by one, tossing them aside as if they were no more than children. Maeve knew that there was only one man in her army who was a match for Cuchulainn, and that was Ferdia Mac Daman, Cuchulainn's best friend and brother in arms, who had trained with him on Scathach's isle. She knew, too, that she would have a hard time convincing Ferdia to challenge his friend.",
		"So she invited him to a feast, and sat him down next to her beautiful daughter, Finnavir of the Fair Eyebrows. Finnavir fed him wine and spoke sweet words to Ferdia all night long. When he was drunk, and very happy, Queen Maeve asked him why he thought he had been invited that night. And Ferdia said \"Why? Because I am the greatest warrior in Ireland!\"",
		"And Maeve said \"Yes, but more than that, you have been invited here so I can offer you all the best lands of Connaught, vast herds of cattle, a life without taxes or tithes, this golden ring from my own finger, my daughter's hand in marriage, and my own love.\"",
		"When he heard this offer, Ferdia knew what was coming next; that she was going to ask him to take on his best friend and blood-brother, Cuchulainn. Even though they were on opposing sides, the bond they shared was one he would never break, so he refused Maeve's offer out of hand.",
		"Maeve only looked away and said to herself \"Ah, so he spoke the truth.\"",
		"Ferdia demanded to know what she meant by that? Who spoke the what? And Queen Maeve told him that Cuchulainn had bragged that Ferdia was too cowardly to ever challenge him, for they both knew that Ferdia was the weaker of the two, and would surely lose the fight.",
		"Ferdia could not stand to have his courage impugned like this, especially in front of the lovely Finnavir, and, enraged, he made a sacred vow that he would challenge Cuchulainn the very next day.",
		"The next morning, he went down to the ford, where Cuchulainn was guarding the border of Ulster. Cuchulainn was shocked and dismayed when he saw who was coming to fight him. So overcome with grief was he, at the thought of having to fight his best friend, that his feet stuck to the ground and he could not move.",
		"He stood there and spoke with beautiful words about the friendship he and Ferdia had shared; the time they had spent with Scathach, learning the same warrior's arts, and learning each other's ways so well. He tried to move Ferdia's heart so that he would not come and fight him, but Ferdia was bound by his vow, and still stung by what he had heard the night before. Though he was moved by his friend's plea, he flung Cuchulainn's words back in his face and insulted him, and Cuchulainn's own anger awoke, letting him move forward to the fight.",
		"They fought in the ford for four days, equally skilled, equally matched. They knew each other's way of fighting inside and out, so that no matter what attack one of them tried, the other knew what he was going to do before he knew it himself. And their hearts were not quite in it.",
		"Each day they would fight each other from morning light to dusk, and at the end of each day they would bind each other's wounds, share the same food, and sleep back to back.",
		"The only difference between them as fighters was that Cuchulainn had a dreadful weapon: the Gae Bolga, a terrible spear made from the bones of a sea monster. Once it was thrown, it would find the vulnerable point on the body, and enter there, and then it would spread out and exit through fifty points on the body. Cuchulainn decided not to use this spear against Ferdia, because he did not want his death on his hands.",
		"After the third day of fighting, something changed. Ferdia and Cuchulainn did not eat together, or bind each other's wounds, or sleep back to back. On the fourth day, when they resumed, there was grimness to their fighting. Ferdia was afraid that night that Cuchulainn might use the Gae Bolga against him, so he tied a stone between his legs to block his most vulnerable point.",
		"Cuchulainn was no longer able to hold back, and his battle fury came on him. He leapt onto the edge of Ferida's shield, and Ferdia knew that he was going to give his salmon-leap up into the air, and come down with the point of his sword onto Ferdia's skull. So Ferdia threw his shield aside, dropping Cuchulainn into the water, and cooling him off for a little while. But the battle fury came on him again, and again Ferdia dunked him in the water. The battle fury came on him a third time, and this time, when Ferdia dropped him in the river, the fury did not leave him.",
		"He went into a battle spasm, and grew twice the size. His skin became mottled and black, and his vision grew clouded with blood, and he towered menacingly over Ferdia and ran at him. Ferdia stood ready to meet his charge, and they wrestled, pushing against each other, equally matched, and neither one giving an inch. Cuchulainn got more and more enraged, and his battle fury lent him a strength that Ferdia did not have. He got the upper hand, and drew his arm back to deal a death blow, but then a look passed between them, and for a second the battle fury died in Cuchulainn, and he hesitated.",
		"Ferdia did not. The moment Cuchulainn wavered, he plunged his sword into Cuchulainn's chest, again and again, till it was red with Cuchulainn's blood and slippery with it, and he was covered, head to toe, in Cuchulainn's blood. Cuchulainn shrieked, and his charioteer Laeg, who was standing by, got the Gae Boga and threw it into the water, so it floated down the stream to Cuchulainn. Ferdia was terrified to see the spear coming, and instinctively he dropped his shield to protect his nether regions, but the moment he did this, Cuchulainn plunged a javelin into Ferida's chest. Ferdia raised his shield, Cuchulainn grabbed the Gae Bolga with his toes and flung it up through Ferdia's groin, smashing through the stone he had put there to protect himself.",
		"The Gae Bolga's point broke into a million pieces, splintering into every crevice in his body, and Ferdia collapsed, with Cuchulainn beside him. They cried together, and Ferdia cried out the treachery of Queen Maeve that had brought him here, and his own treachery in coming against his friend. They mingled as many tears as drops of blood together, and then Cuchulainn gathered the last of his strength and carried Ferdia over to the Ulster side of the ford, so that he could take his last breath in a land not occupied by Queen Maeve's armies. He held him, and cradled him, till Ferdia drew his last breath, and then Cuchulainn sank down in a faint beside him."
	]
}