{
	"title": "How Cuchulainn Got His Name",
	"content": [
		"Now, when Setanta had been in the Boy's Troop for about a year, a smith called Cullan came to Emain Macha and invited Conchubar to a feast at his house.  Cullan was a great smith and a skilled craftsman who lived some way outside of Emain Macha. When he gave his invitation, Cullen begged Conchubar not to bring along a great number of guests, because he was not wealthy enough to entertain all of Conchubar's men properly, but he was eager to give a wonderful feast to his king and a few of his companions. Conchubar agreed not to abuse Cullan's hospitality, and set off with a small retinue. On the way to Cullan's house, he passed by a field where the Boy's Troop were at play. They played the game of snatching cloaks: each boy would try and tear the cloak off another boy's back, and the winner would be the one who had the most cloaks by the end. Setanta was able to grab the cloaks off all the other boys, and had a great heap of them at his feet, but they weren't even able to take his brooch. Then they played the knock-down game, where each would try and knock the others off their feet, and Setanta left all the other boys on the ground, till he was the only one standing. Then they set up a game of hurling, and it was clear from where Conchubar was watching that the game was to be played with Setanta on one side and all of the other boys playing against him.",
		"Conchubar called out to Setanta and asked him if he would come to the feast at Cullan's house with him. The boy replied that he wasn't finished playing yet, which Conchubar could understand. He asked him did he know the road so that he could follow when he'd finished. Setanta said he did not, but Conchubar's chariots would make such a track that he would be able to follow it easily.",
		"Conchubar and his company went on to Cullan's house, where they were well received and started to enjoy the lavish feast and entertainment that Cullan had arranged. When they were settled in, Cullan asked if Conchubar was expecting anyone else to join them. He explained that as he had a small household, with very little land, all of his income came from his craft, and so he didn't have any warriors to protect him. He was too far outside of Emain Macha for Conchubar's men to come to his aid in an emergency, so what he had, and all he had, to protect his household, was his guard dog: the greatest guard dog anyone had ever seen. The hound was the size of a pony, and it had the strength of a hundred men, and Cullan had trained it so carefully from the time it was a pup that it knew no man but he, and would tear anyone else it saw to pieces. Conchubar, forgetting all about the little boy he had invited, said that they were all here and told Cullan to go ahead and release his hound. Cullan left the hound off its leash, and it made a circuit all around his household, and when it was satisfied that all was safe, it lay down in front of the door with its great head resting on its great paws, with its red eyes looking out unblinking into the night.",
		"Now, Setanta finished his playing, and he set to follow the tracks of the king's chariot to Cullan's house, playing his own game to make the way pass quicker. He threw his ball up in the air, and hit it with his hurley, and ran after it and caught it before it could hit the ground. When Cullan's hound saw the boy approaching, it let out a ferocious roar that was heard for miles around. All the guests at the feast fell silent when they heard the hound, for they knew it meant that the beast must be about to kill someone, and Conchubar suddenly remembered his little nephew, following his trail.",
		"Setanta saw the hound coming at him, and all he was armed with was his hurley stick, which seemed flimsy as a toothpick in front of that great beast, and his ball. Thinking quickly, he threw the ball as hard as he could, down the hound's open mouth. He threw it hard enough that it stuck in the great hound's throat and the dog started to choke. Setanta picked the hound up by its hind legs, and swung it around, dashing its brains out against a rock.",
		"The king and all his company came rushing out, expecting to see the hound standing over the boy's body, and their joy was great when they found Setanta alive and well, and there was great celebration among the people of Emain Macha. But poor Cullan wept to see his faithful hound killed, and he turned to Setanta and said that though all his family were welcome in Cullan's house, Setanta was not. Conchubar was ready to take offence at this, but Cullan lamented the death of his hound, his faithful servant that had protected him for so long, and said that without this dog his livelihood was worth nothing, because anyone could come and take it all away, and he had no way to defend himself now that his hound was gone.",
		"Setanta felt terrible when he heard what he had done, and so he spoke up and said that he would make it right. \"Is there a pup of that hound anywhere in Ireland?\" he asked. Cullan said there was, but it would take time to train the pup to take the old hound's place, and what was he to do in the meantime? So Setanta told Cullan to get the pup, and train it as he had the other dog, and while the pup was growing, he himself would do the duty of the dog every night.",
		"Now the druid, Cathbad was listening, and he said that from now on, that was to be Setanta's name: Cú Chulainn, meaning Cullan's hound. Setanta said \"I'd rather be Setanta,\" but Cathbad prophesysed that one day, every man in the world would have the name Cuchulainn in his mouth. So Setanta accepted the change, and became Cuchulainn. And for the next year, every evening when night began to fall, he left Emain Macha and walked out to Cullan's house, made a circle around the edge of Cullan's land, and lay down in front of the door to sleep like a dog, with one eye open, guarding Cullan's property from whatever threats might come."
	]
}