{
	"title": "How Cuchulainn took up Arms",
	"content": [
		"About a year after Cuchulainn won his name, by killing Cullen's hound and guarding Cullen's lands, he was with the boy's troop in Emain Macha. These were the sons of the warriors of King Conor Mac Nessa's Red Branch, and they trained together to become the next generation of warriors and heroes. They received instruction on arms and fighting feats, and learned chess-playing and other strategic arts, and they also had to have some education in poetry and the druidic arts. King Conor's chief druid was called Cathbad, and he used to instruct his own class of druidic students. Now, one day, Cathbad was instructing his students, and the Boy's Troop, on the arts of prophecy: how to read the signs and omens to be able to see what the future would hold, and how different days could be propitious for different things. To demonstrate, he read the signs for them in the flights of birds, and threw a bundle of sticks into the air to read which way they landed, and he said that this day was an important day. That any young man who took up arms for the first time on this day would have a brief life, but a glorious one. And though he would die while still in his youth, his name would live on forever and his glory would never be surpassed!",
		"Now, Cuchulainn and all of the other young men in the Boy's Troop heard this, and though a few of them were almost at the age to take up arms, they mostly decided that it didn't sound worth it. But Cuchulainn made his choice immediately. He ran inside to his uncle Conor Mac Nessa and demanded to be given a set of arms immediately. Conor tried to talk him out of it; \"You're far too young,\" he said, \"Who put this idea into your head?\" And Cuchulainn answered him truthfully, if not honestly, that Cathbad had. So Conor thought that was alright, if the Druid had given his blessing. He sent his servant to get the set of weapons he had had when he was seventeen and took up arms for the first time. Cuchulainn shook the weapons to test their strength, but he splintered them into pieces. Conor sent for stronger and stronger swords and spears and shields, but Cuchulainn destroyed them all, until in the end Conor lent Cuchulainn his own weapons. These were of such fine quality and craftsmanship that they withstood the battering Cuchulainn put them through.",
		"At this point, Cathbad came in and exclaimed, \"What on earth is this little boy doing, taking up arms?\" And Conor turned around and said, \"He told me you told him to!\" Cathbad was aghast; he had thought his prophecy would be interpreted as a warning, not taken as encouragement. Conor was furious when he heard the full wording of the prophecy, but Cuchulainn was unrepentant, he said he didn't care if he died tomorrow, as long as his name would never be forgotten; and besides, it was too late now.",
		"Knowing that there was no turning back now, Conor tried to equip Cuchulainn with a chariot and a charioteer, but he used the chariots as hard as he'd used the weapons, and the king lent him his own chariot before he could destroy too many of them. Cuchulainn asked for his friend Laeg from the Boy's Troop to be his charioteer. Laeg was gifted with horses, and he and Cuchulainn were fast friends. But Conor said that he wasn't going to send out two hot-headed youths to make trouble together, and Ibar the charioteer with Cuchulainn, to keep an eye on him. Now, Ibar was skilful, but he was also cautious and careful, and Conor thought he might be able to keep Cuchulainn from getting into any trouble.",
		"So Ibar and Cuchulainn set out from Emain Macha, as was the custom when a warrior took up arms, but they were hardly out of the stables before Ibar said \"Time to turn back!\"",
		"Cuchulainn asked him to go past the Boy's Troop first, so they could salute him. He had a great time driving up and down in front of them in his new chariot, showing off his fine weapons. The boys said they were sorry they wouldn't get to play hurling with him nay more, but they all wished him well and cheered him on.",
		"After that, Ibar said \"Time to turn back.\" But Cuchulainn said, \"Let's just go on a little bit to the border, and visit my foster-brother, Conal Cearnach.\" Conal Cearnach was guarding a particular pass out of Ulster territory. It was his duty to meet any foreign warrior in single combat, to escort any poet to Emain Macha safely, and to make sure that any guests leaving Ulster were pleased with the hospitality they'd received there, and to make reparations if they weren't.",
		"Conal Cearnach was very surprised to see Cuchulainn with his kingly weapons in his borrowed chariot. Cuchulainn announced that he had taken up arms that day, and was going on an adventure to draw first blood, and prove himself as a warrior. Conal Cearnach bade Ibar wait while he got his own chariot ready: he would come with them, past Ulster's borders, because if anything happened to Cuchulainn, it would be on his head. Cuchulainn knew that Conal would get in the way of him fighting anyone they met, and he wouldn't be able to prove himself a warrior, so his taking up of arms would only be a symbol, that wouldn't make him a true warrior in anyone's eyes, so he waited till they were underway, and then cast a stone from his slingshot that broke the shaft of Conal Cearnach's chariot. Conal Cearnach was thrown out, and broke his arm, and roared after Cuchulainn \"What did you do that for!?\" Cuchulainn claimed he was only testing his aim, and persuaded Ibar to take him on a little further.",
		"He asked Ibar about every landmark they passed, and Ibar told him the names of the hills and valleys. Then he pointed out that they were coming into the country of the Sons of Nechtain. Hoping to persuade Cuchulainn to return to Emain Macha, Ibar told him all about these fearsome warriors; three brothers, who had killed as many Ulstermen as were alive today. The eldest, Foill Mac Nechtain, could not be pierced by any blade; the second, Tuachell Mac Nechtain was so swift that he would overcome any attack that failed to kill him instantly; the youngest, Fannall Mac Nechtain, was the greatest swimmer in Ireland, and always fought his battles in the ford, and always used his skill to win.",
		"To Ibar's dismay, Cuchulainn decided that these were the perfect foes to challenge to single combat, to make a name for himself. He announced to Ibar that this was a fine place for a rest, and lay down on the grass to sleep, leaving Ibar to stand watch over him.",
		"As he was sleeping, Foill Mac Nechtain came to investigate. He told Ibar that there was a geasa, that anyone who came into that field could not leave it without facing the brothers in single combat. Thinking Cuchulainn too deeply asleep to hear him, Ibar said that he was just a boy, playing at being a warrior, and the sons of Nechtain should take pity on him and let him go. Hearing these words, Cuchulainn sprang to his feet and challenged Foill Mac Nechtain to single combat.",
		"Ibar tried to stop him, but Cuchulainn, remembering that Foill could not be pierced by a blade, threw a stone from his slingshot and dashed out Foill's brains. Tuachell Mac Nechtain, the swift one, came running out of the house to see what had happened, and he attacked with a bellow. Cuchulainn took Conor's spear and threw it with such force that it went through Tuachell's ribcage and out the other side. The third brother, Fannall, challenged Cuchulainn to fight him in the river, where he was strongest, and Cuchulainn wrestled him under the water, held him down, and chopped off his head with Conor's sword. He took the heads off all three brothers, tied them to the rim of his chariot, and finally let Ibar take him back to Emain Macha.",
		"On the way, still full of energy and battle-fury, Cuchulainn ran down two stags and tied them to the back of the chariot, where they galloped behind. They passed a flock of swans in flight, and he threw his sword, knocked them out of the sky, and then tied them by their necks to the chariot, so they were flying overhead in a great white cloud.",
		"The people of Emain Macha saw this chariot approaching, with wild birds flying over it, wild stags galloping behind, and heads tied to the rim, with Cuchulainn, still blazing from the battle, standing at the front, and they were terrified. They knew that, with the battle fury on him, Cuchulainn would not know friend from foe. The men were caught in a bind: if they fought him and won, they'd lose their most promising warrior, but if they let him in unchallenged, he might do untold damage. So the women of Emain Macha stepped outside the walls. They lifted their skirts and put them over their heads, and walked half-naked towards Cuchulainn in his chariot. As soon as he saw them, Cuchulainn squeezed his eyes shut, and hid his face. They seized him and threw him into a vat of cold water, which turned into steam from the heat of his fury. They threw him in a second vat, which boiled, and then a third, which warmed but did not boil, and after that he was able to calm himself again.",
		"And that is how Cuchulainn took up arms on a day no one else would, choosing death and glory over long life and happiness."
	]
}