{
	"title": "Setanta Joins the Boy's Troop",
	"content": [
		"Once in Ireland, there was a young boy named Setanta. He grew up in Dun Dealgan with his mother, Deichtre, and her husband Suladim, a warrior of the Red Branch. He was an energetic young lad, and he was brought up and educated as fitted his station as a warrior's son, and the nephew of a king, but as the years went by he grew more and more restless. One day he heard his mother talking about her brother, the King of Ulster, Conchubar Mac Neasa. Conchubar, Setanta heard, spent his days in three parts. The first part would be in watching the Boy's Troop playing hurling and other sports; the second part would be playing chess with the former King of Ulster, Fergus Mac Roigh, and the third part would be in the eating and drinking of pleasant things until he became sleepy. Now, when Setanta heard of this, all he wanted to know about this Boy's Troop. His mother told him that Conchubar had done a new thing in Ireland: he had gathered together all the sons of his Red Branch warriors, brought them to Emain Macha, and was having them all trained up and educated in the warrior's arts. They spent all their days at sports and contests and feats of arms, training and learning all they would need to know.",
		"Now, nothing would do Setanta but he become a member of the Boy's Troop. Wasn't his father, Suladim, one of the Red Branch? But Deichtre told him he was far too young. There was a protocol in place; he had to wait until a warrior, other than his father, came and sponsored him, and that man would put him under his protection and introduce him to the other boys. He had only to be patient, and wait. But Setanta refused to wait, and at the first opportunity, he snuck away from home and set off down the road to Emain Macha. He carried with him his hurley, his ball, and his javelin. And he came up with a little game to make the time pass. He would throw the ball up in the air, and hit it down the road with his hurley, and then he would throw the hurley after it, and the javelin after that, and then he'd run down the road as fast as he could, and catch the ball, catch the hurley, and catch the javelin before any of them hit the ground.",
		"And so in this way, he came to Emain Macha.",
		"There he saw the three times fifty young lads of the Boy's Troop playing a game of hurling. Without hesitating, Setanta flung himself right into the middle of it, caught up the ball, and kept it in between his ankle and his knee. Nobody could take the ball off him, and he scored a goal. Now, the Boy's Troop were not best pleased with this stranger who had come unannounced and spoiled their game, so all at once they attacked him! The fight went raging up and down the pitch, and the shouts were heard from one end of Emain Macha to the other. Conchubar Mac Neasa was playing chess with Fergus Mac Roigh, and they heard this terrible noise, and they said to one another \"They Boy's Troop have caught hold of some misfortunate, and they are killing him!\" So the two of them rushed down to the playing field to find Setanta, holding his own against the whole of the Boy's Troop.",
		"Conchubar called a halt to the proceedings, and managed to calm everyone down. He recognized Setanta, his sister's son, and he reprimanded him. \"Do you not know the proper protocol you must follow with the Boy's Troop?\" he said, \"You must introduce yourself, and ask them to take you under their protection, that way they'll be honour-bound not to attack you. For they're well within their rights to attack any stranger that comes to Emain Macha, who does not follow this protocol.\"",
		"Setanta said he hadn't known, and he asked them properly would they take him under their protection, and the Boy's Troop said yes, and all seemed to be fine, but then Setanta took up his hurley and started lashing the other boys with it, as hard as he could, and laying them out on the grass. Conchubar was shocked, and cried out to him to stop at once! Setanta said, \"Well, I had to ask for their protection, but I think they are the ones who need protection from me.\" So the Boy's Troop, all three times fifty of them, had to line up and one by one they told Setanta their names and asked him to take them under his protection.  And he said yes, and yes and yes, and that was how Setanta became the youngest member of the Boy's Troop of Emain Macha."
	]
}