{
	"title": "The Death of Cuchulainn",
	"content": [
		"During his time as Ulster's champion, Cuchulainn was challenged by many men over the years, and over the years, he killed all who challenged him. One of the men he struck down was called Calatan, and he was a great sorcerer. He left behind a pregnant wife, who gave birth to sextuplets: three girls and three boys. She raised all of her children with all the arts of druidry and sorcery, and instilled in them that they were to avenge their father's death as soon as they were old enough.",
		"Cuchulainn, knowing nothing of this, carried on with his life for many years, but when the time was ripe, the sons and daughters of Calatan set out to take their revenge on the man who had killed their father.",
		"Conchubar Mac Neasa, the King of Ulster, heard of their plan. He realized that if he lost Cuchulainn, his greatest warrior, Emain Macha would fall, and his reign could come to an end. So he decided to protect Cuchulainn for as long as he could. He called Cuchulainn to come and stay in Emain Mach. He distracted him with sports and feasts, and told him nothing of the threat that was coming, knowing that Cuchulainn would want to go out and face it head-on.",
		"But the three sons and three daughters of Calatan came to Emain Macha, and using their magic, they brewed up the sounds of war. The noise was terrible, steel clashing, battle cries, feet stamping, and the screams of the dying, but Conchubar was prepared. He invited all of his men for a great feast, and there was such singing and storytelling, drinking and revelry, that they drowned ou the noises of the magical war outside.",
		"For three days and three nights, this worked to keep Cuchulainn in the dark, but the noises showed no signs of abating, and Conchubar knew he couldn't keep it up. He had his men take Cuchulainn to Gleann na mBodhar; the Valley of the Deaf. It was called this because no sound from outside could enter the valley, so no matter what magical noises the children of Calatan brewed up, Cuchulainn would not hear them there.",
		"When their magical noises failed to draw Cuchulainn out, the three sons and three daughters of Calatan realized that they had to do something else. One of the daughters magically disguised herself as Niamh, a friend of Cuchulainn's, and went into Gleann na mBodhar. She told him he was needed in battle, to pick up his arms and enter the fray. Cuchulainn leapt at the challenge. He picked up his weapons and went to hitch his horse, Lia Macha, the Grey of Macha, to his chariot. But for the first time since he had tamed her, Lia Macha showed him the whites of her eyes and danced away. He tried a second time, and again she shied away, and then on his third attempt, he berated her: \"Lia Macha, this is the first time, in all the time we've been fighting side by side, that you haven't done my bidding.\" So the horse stepped into the traces, but she cried great tears of blood.",
		"He called to his charioteer, Laeg, who stepped up into the chariot beside him and took the reins. His mother Deichtre came up to him with a farewell cup, full of wine to give him her blessing in the coming fight, but as he lifted the cup to his lips, the wine turned into blood. He threw it away, and Deichtre refilled the cup with wine, but again it turned to blood. Determined that her son would not go into battle without her blessing to protect him, Deichtre filled the cup again, and offered it again, but the wine turned into blood a third time, and Cuchulainn could not drink from it.",
		"As he crossed over a ford, Cuchulainn saw an old woman washing clothes in the river. She turned to him as he passed, and said \"I am washing the armour of Cuchulainn, who is going to die today.\" He drove on.",
		"He came to a group of three hags by the side of the road. They were roasting a hound on a rowan stick. He stopped to give them his greeting, and they invited him to join their meal. Cuchulainn was under a geasa never to taste the meat of a hound, his namesake, so he tried to decline as politely as he could. But the hags jeered him, saying that he was too used to fine eating, having been with the king, and he thought himself too proud to sit and share their mean feast with them.",
		"His honour as a warrior would not allow him to turn down their hospitality, or put himself above anyone, or say he thought he was above anyone, no matter how poor or lowly, so he sat down and took a piece of the hound meat with his left hand, and ate it. And when it touched his lips, all the strength ebbed out of his left arm, and the meat dropped onto his thigh. As soon as the meat touched it, all the strength flowed out of his left leg, so that his whole left side was now no stronger than that of a normal man.",
		"He got up, knowing that he had broken his geasa and lost half his strength. These women were the Morrigan, the goddess of war. Long before that, she had offered Cuchulainn her love, and he had turned her down. This was his punishment for rejecting the goddess.",
		"On he went, in his chariot with Laeg, until he encountered the three sons of Calatan, standing in the road, barring his way. The son of Cu Roi, called Lugaid, was with them. It had been prophesized that the first three spears Cuchulainn cast in this battle would kill three kings, and his enemies wanted to get the spears, so that they would benefit from the prediction.",
		"The first son of Calatan asked him for a spear, and threatened to satirize Cuchulain if he did not hand it over. Cuchulainn narrowed his eyes and said, \"Never let it be said that I am not a generous person,\" and he flung the spear straight through the head of the first son of Calatan, killing him instantly. Lugaid Cu Roi pulled out the spear, and threw it back at Cuchulainn, missing him, but striking Laeg, his charioteer and constant companion, through the stomach. So fell Laeg Mac Riangabra, king among charioteers.",
		"The second son of Calatan stepped forward, and asked for a spear. Cuchulainn refused, saying he had given enough to satisfy his honour, but the son of Calatan threatened to satirize all of Ulster. So Cuchulainn said, \"Never let it be said that Ulster will lose its honour because of its champion,\" and he cast his spear through the second son's head. Lugaid Cu Roi pulled out the spear and threw it back at Cuchulainn, killing the horse, Lia Macha. Cuchulainn fell to his knees, and wept over her. So fell Lia Macha, king among horses.",
		"The third son of Calatan asked for a spear, or he would satirize Cuchulainn's family. Cuchualinn said \"Never let it be said I brought dishonour on my family,\" and threw the spear through his head. Lugaid Cu Roi pulled the spear out, and threw it at Cuchulainn, straight through his stomach, spraying out his intestines. Cuchulainn, mortally wounded, had only enough strength in him to crawl to a nearby lake for a drink of water. His enemies hung back, afraid that he had more strength than he was showing. The water revived him somewhat.",
		"He could not bear the thought of dying on the ground like an animal, but wanted to die on his feet, like a warrior. He crawled to a standing-stone, and tied himself to it, gripping his sword tightly. As he stood there, dying, a raven came and tripped over his intestine. Cuchulainn laughed, and died with the laugh in his mouth.",
		"For three days after he died, he stood tied to the rock, and none of his enemies were brave enough to approach, and make sure he was dead. At the end of three days, the Morrigan took the shape of a raven, and perched on his shoulder, and when he did not move, they knew it was safe.",
		"Lugaid Cu Roi  wanted Cuchulainn's sword as a trophy, but he had died with such a tight grip on it that Lugaid could not get the sword free. He drew a knife and cut the tendons on Cuchulainn's hand to loosen his grip, and the sword fell and cut off Lugaid Cu Roi's hand.",
		"So fell Cuchulainn, king among warriors."
	]
}