{
	"title": "The Sickbed of Cuchulainn, or The Only Jealousy of Emer",
	"content": [
		"One year, at Samhain, the people of Ulster gathered in Emain Macha. All the warriors of the Red Branch were there, with their wives and families. It was the tradition in Ulster to gather together and have each person tell stories of their bravery, and because Samhain was the time of year when the Otherworld is closest, any man who told a word of a lie would have his own sword cry out against him.",
		"On this day, Cuchulainn and the poet Sencha were playing chess, waiting for the last of the Red Branch knights to arrive, when a flock of beautiful white birds alighted on the lake. All the women of Ulster were seized with the desire to have one. Having a bird to perch on each shoulder seemed to them to be the most important thing in the world, but none of the men were able to catch even a single bird.",
		"Cuchulainn's wife, Emer, stood up and said that her husband would be able to catch them, if she asked him to. At her word, Cuchulainn threw his sword in a great sweeping arc: it knocked all the birds out of the air, stunning them, but not killing a one. He gave two birds to every woman of Ulster, and then realized that there weren't any left for his own Emer.",
		"Emer said that she did not mind. Since she was the one who had asked him to catch the birds, it was her gift to give, and it would not be right for her to have two and for another woman to go without. But Cuchulainn was terribly upset that his wife, alone of all the women of Ulster, had no lovely birds to perch on her shoulders and sing in her ears. He swore to her that he would catch the most beautiful birds in Ireland for her. Not long after that, two birds came flying low over the lake, linked together with a chain of red gold, singing such beautiful music that they nearly put the whole company to sleep.",
		"Sencha the poet told him that these birds seemed to have an enchantment behind them, and to leave them alone, but Cuchulainn put a stone into his sling and cast it at them, and to his shock, he missed! Emer begged him to let the birds alone, they were clearly Otherworldly, and he could catch some other birds for her, but he cast another stone at them, and missed again, and then in frustration threw his spear at them, and though he hit one bird on the wing, he did not knock them down.",
		"Now this all upset Cuchulainn greatly: he had never missed a cast since the day he took up arms, but now he seemed to be good for nothing! He lay down by a pillar stone and fell asleep by the side of the lake, and he dreamed a strange dream. In his dream, two tall, stately women came walking towards him, and one of them was weeping. They approached him, and then the first woman smiled at him, and struck him with a horsewhip. The other then approached, and smiled, and struck him too. They took turns then, to beat him, still smiling, till he was more dead than alive, and then they walked away and left him.",
		"When he woke from his sleep, Cuchulainn was bruised and battered head to foot, and he could barely move. He had to be carried to his sick bed, and he lay there recovering for a whole year.",
		"By the end of this time, Emer was in a rage. She went to Conor Mac Neasa and the warriors of the Red Branch and she berated them. If Conall had been in this situation, she said, Cuchulainn would not have rested till he found a cure. If it were Laeg, Cuchulainn would not have slept till he found a cure. If it were Fergus, Cuchulainn would have scoured the entire world to find a cure. But here he was, a whole year later, still sick, and there they were, resting and feasting in the hall, doing nothing to help him.",
		"She went to Cuchulainn herself, and took his hands, and sang to him, and begged him to rise up, because he was a hero of Ulster. She reminded him of his skills, and all his great deeds, and the great friends he had. Her song fortified him, and he was able to shake off his weariness and gather enough strength to get up out of his bed and tell them the vision he had had the year before of the two women, beating him.",
		"The druid Cathbad said that they must have been fairy women. His sickness was their doing, and he would have to go back to the place where it all began, to see if he could bargain with them to lift this weakness from him.",
		"So, the very next day, which was Samhain eve again, Cuchulainn lay down and slept by the same pillar stone. The fairy woman, Liban, appeared to him, and she was one of the two who had beaten him. She told him that the woman with her, the one who had been weeping, was called Fand, wife of Mananan Mac Lir, the God of the Sea. Fand had fallen in love with Cuchulainn, and Mananan Mac Lir had deserted her, so she and Liban had come to find him in the shape of birds. But they were so insulted when he threw stones at them that they decided to put this sickness on him.",
		"Liban said that she needed Cuchulainn's help, and she would lift this sickness off him, and give him Fand to be his wife if he agreed to help her. Her husband, Labraid the Swift Sword-Wielder, was involved in a battle against terrible odds that he could not possibly win, and Liban wanted Cuchulainn to come with her to her home on the Plain of Light, and win this battle for her.",
		"Cuchulainn was suspicious of this fairy woman, so he asked his charioteer Laeg to go with her first, and report back to him. Laeg saw the plain of light, and met Fand, and saw that everything there was as Liban had described. He came back and told Cuchulainn all about the wonders of the Plain of Light, and the armies that were preparing to fight, and mentioned, too, how very beautiful Fand was.",
		"So Cuchulainn agreed to Liban's bargain, and she brought him to the Plain of Light. Two ravens flew ahead of him, to announce his coming, and when the fairy warriors heard this they laughed among themselves that some mad man had come, thinking he could challenge them. But Cuchulainn defeated their king, and thirty-three of their champions in single combat, winning the battle for Labraid the Swift Sword-Wielder.",
		"He then spent a month in the Plain of Light with Fand as his wife. At the end of the month, she told him to name any place in Irleand and she would meet him there. So they arranged to meet by a yew tree on Baile's strand, and Cuchulainn returned from the Plain of Light.",
		"When Emer heard all this, she was furious. Cuchulainn intended to meet with Fand and run away with her, deserting Emer, but she refused to put up with this. She gathered together fifty women, and each armed herself with knives, and they set off to Baile's strand to put a stop to things.",
		"Fand and Cuchulainn were already there, and when Fand saw Emer coming, she was terrified. Cuchulainn put her up in his chariot and put himself in front of her, to protect her from Emer, but the two women screamed threats at each other. He pleaded with Emer not to attack Fand, because she was under his protection. If Emer attacked her, he'd have to fight her, and they both knew who would win, but he didn't want to harm her in any way. Emer turned her anger on him, then. Every man, she said, thinks a new thing is better than an old thing, every man scorns what he has, but the two of them were happy, as equals. Cuchulainn pointed out to her that Fand was his equal too, in beauty and wisdom, just as Emer was. But when he saw the pain he was causing Emer, he felt remorse, and he agreed that he would set Fand aside and come back to her.",
		"At this, Fand let out a great wail, lamenting the fact that she had been deserted a second time by a man she loved. Her husband, Mananan Mac Lir, heard her lament from afar, and realized that he still loved her. He appeared beside them on the strand, and he came to Fand and asked her if she could forgive him for deserting her. He asked her, then to choose between himself and Cuchulainn. Fand said that there was nothing in it, they were each as good as the other, but the only difference she could see was that Cuchulainn already had a consort that was his equal, and Mananan Mac Lir had not, so it was with him she'd go.",
		"So Mananan Mac Lir shook his cloak in between Fand and Cuchulainn, which meant that they would never meet again, and the two of them disappeared back into the Otherworld.",
		"But all was not well between Cuchulainn and Emer. He was devastated to lose Fand, whom he had fallen in love with, and Emer was devastated that he had betrayed her so deeply. They created such disharmony in Ulster with their grief and ill feeling, that the druids of Ulster brewed a drink of forgetfulness, so that Cuchulainn could forget all about Fand, and Emer could forget his betrayal. And after taking that drink, they were able to come together and be as happy as they ever had been before."
	]
}