{
	"title": "The Son of Cuchulainn",
	"content": [
		"When Cuchulainn was training with Scathach, he had a love affair with a warrior woman called Aoife. And as he was leaving, she told him she was with child, and that it was going to be a boy. Cuchulainn told her to name him Connla, and give him a red-gold ring he took from his own finger, and to send him to Ireland when he was big enough for the ring to fit on his finger without sliding off. And then he went home to Ireland, and the very first thing he did was to go and get Emer, who he had already pledged to marry, and make her his wife.",
		"Now, word came back to Aoife that Cuchulainn had married some other woman, immediately after he'd left her, and she realized that he must have known this woman before he came to Scathach's island, before he ever met her, and he had probably been thinking of her and in love with her, the whole time they were together, and he had married this woman with the sweat from her body still on him. She was furious that he would discard her so lightly, and she vowed that she would get revenge on him through their son Connla.",
		"She spoke not a word of this to the child, but raised him up as a warrior. She gave him all the education a warrior's son should get, and sent him to train with Scathach as soon as he was old enough. Scathach found him every bit as apt a pupil as his father had been, and she trained him in all the martial arts and feats that she had trained Cuchulainn in. And the years passed by until he was grown up enough for his father's ring to fit around his thumb.",
		"Aoife sent him off to Ireland, but before he left, she put three geasa on him, three sacred prohibitions. She told him he was never to give way to any man, he was never to give his name first, and he was never to back down from a fight, even if he knew it would be the death of him. And with these three geasa, Connla set off.",
		"He came dressed in a warrior's full regalia, and landed on Baile's strand, near Dun Dealgan. At this time, King Conchubar Mac Neasa and all the court of Ulster were on Baile's strand for a particular ritual that had to be performed at that time of year, and when they saw this fine young warrior on the strand, Conchubar sent a messenger to greet him, and ask him who he was and whether it was war or peace he was after. But the youth would not tell the messenger his name. The messenger explained to him that this was the King of Ulster on the strand, and protocol was that he had to give his name first, as a guest coming into the King's territory, but no matter what reasons were given of law and politeness, Connla was resolute: he would not give his name.",
		"Conchubar was insulted, who did this youth think he was, that he would not give his name to the King of Ulster? So he asked if there was anyone there who would go and get this young man's name out of him by force, and Conall Cearnach, always ready for a fight, said \"I will.\"",
		"Away he went down Baile's strand, and faced the young man, and said, \"There's no need for you to fight me, now. I'm one of the greatest warriors in Ulster, and if you would only give way to me and tell me your name, it would be far better for you.\"",
		"But Connla refused. \"If you want to fight,\" he said, \"I'll fight you.\" And so they fought up and down the strand, in a great battle, but before too long, to the shock of all those watching, Connla was able to overcome the great Conall Cearnach, and in spite of his great skill and his great reputation, he was laid out on the strand with his weapons taken from him. So the great reputation that had been Conall Cearnach's now passed to the stranger on Baile's strand.",
		"When he saw what had happened to Conall Cearnach, Conchubar decided to send for his greatest warrior. He sent a messenger to Dun Dealgan, to bring Cuchulainn to the strand.",
		"When Cuchulainn saw the young warrior, he was impressed with his bearing, and with the way he had won the fight against Conall Cearnach. He beseeched him to tell them his name, so that he would not have to fight him. If they fought, Cuchulainn would win, and did not want to do any harm to such a fine young man.",
		"Connla said his friend had been just as sure of victory, but all the same, since he'd seen Cuchulainn's face, he had a great desire to tell him his name. But he explained that there was a geasa on him not to give his name, or refuse any challenge, and asked if Cuchulainn would agree to not challenge him. But the honour of the King of Ulster was at stake: Cuchulainn could not let Connla go unchallenged. And so, though neither wanted to fight, neither of them would back down.",
		"Cuchulainn had not had a fight like this in years; not since the armies of Connaught had invaded. This young man seemed to know every move he was going to make before he made it; he knew every skill and every trick that Cuchulainn knew, and he had the swiftness of youth to aid him. Every feint, every sword stroke, Connla could counter, and Cuchulainn found himself hard-pressed. Up and down the strand they fought, and neither could get the upper hand over the other. And so Cuchulainn began to grow angry, and with his anger came his battle rage, and the battle spasm took over him, and the hero light shone about his head, and the two of them called for their spears.",
		"Now, Laeg, handed Cuchulainn his deadliest spear, the Gae Bolga, but as soon as Connla saw the hero light around Cuchulainn's head, he realized who he must be. He had his spear in his hand before Cuchulainn, but he deliberately missed. Cuchulainn, unaware, hurled the Gae Bolga at him. It went in through the young man's side, and splintered apart. And Connla, dying, held up his thumb to show Cuchulainn the red-gold ring that was on it.",
		"Now he knew who he was, Cuchulainn picked up his son and cradled him. They both cursed Aoife, realizing that she had sent her own son here to get revenge on his father, either to kill his father, or to make his father live with having killed him. Cuchulainn wished that it had been the other way around, that he should have killed his own son, the green strong branch that he cut off.",
		"He called all the men of Ulster, and all the warriors of the Red Branch, to come down to the strand and introduce themselves to his son. The Red Branch warriors each gave Connla their name, and welcomed him as a member of their company, and when each man had introduced himself to Connla, Cuchulainn drew his sword and slit the boy's throat, so that he would not have to suffer any more. And after that, Cuchulainn sang a great lament, and wished that any other man had killed his son, that he would be able to assuage his grief in battle, but because he was the one to have done this terrible thing, he could get no satisfaction, no revenge.",
		"Conchubar Mac Neasa worried that Cuchulainn's grief might turn to anger at any moment, and if he turned on the company there he would surely slaughter them. So he asked the druid Cathbad for help.",
		"Cathbad cast a spell on Cuchulainn, and told him to fight the waves on the strand, if he wanted revenge. And so for three days and three nights, Cuchulainn raged and battled against the waves on Baile's strand, till he fell down exhausted."
	]
}