{
	"title": "Conaire Mór",
	"content": [
		"Part I: Long ago, there was a king in Ireland called Eochaid, who married the most beautiful woman that he had ever seen (as kings are wont to do). He did not know, and nor did she, that she was really a fairy woman called Etain, and before too long had passed, her fairy husband Midir came to claim her.",
		"Etain left a daughter behind her, and the king could not bear to look upon the child, so he bade his attendants to put the child to death. They brought her to the well to drown her, but she smiled a laughing smile up at them and they could not bring themselves to destroy the child. So they gave her to the cowherds to raise, and the cowherds named her Meas Buachalla, which means the fosterling of the cowherds. They loved her dearly, but they feared what would happen to her if she were ever found. So they built a little house for her, with no windows or doors, so no one could get in, but with half the house unroofed and open to the sky, so she would not feel confined.",
		"Meas Buachalla grew up, and she grew up beautiful as her mother before her, but nobody in Ireland knew, for nobody had seen her.",
		"The High King of Ireland at this time was named …, and a druid had prophesised that he was to marry a woman of an unknown race. Now, the king was perplexed as to what this might mean, and who this might be, so he had his men keep an eye out in their travels for a woman fitting that description. One day, two of his men came across Meas Buachalla's strange little house. At first they took it for a storage shed of some kind, but when they crept up, and peered through a chink in the walls, they saw the most beautiful woman either of them had ever laid eyes on inside. They ran back to the king to tell him what they'd seen, and he decided that this must be the woman the druid had spoken of. So he sent his men to fetch her away so that he could marry her.",
		"That night, a huge bird flew down into Meas Buachalla's house. It threw off its feathers and turned into a beautiful young man. The Bird Man lay down with Meas Buachalla and later, he told her that he was the Bird King and she was going to have his child. Then he explained to her that she was going to marry the High King of Ireland, and that her child would one day become a king. He told her to name this child Conaire, son of Meas Buachalla.",
		"It all happened as the Bird King had said: Meas Buachalla married the king, and when Conaire was born, everyone thought it was the king's own son. Now Meas Buachalla loved Conaire so much that she wanted him to have the best possible life, and be loved as much as a child can be loved. She decided that he should have three foster families, and in each of these families he had a foster brother.",
		"Conaire and his three foster brothers were inseparable. Whenever a plate of food was put down in front of one of them, all four of them would eat off it, even if four places were set. They dressed in the same coloured clothes, they had the same colour of horses, and they were never found apart from one another.",
		"Conaire was born with three gifts: the gift of sight, the gift of hearing and the gift of judgement, and he gave one of these gifts to each of his foster brothers, so much did he love them. They would often go hunting together, and one day they saw a flock of huge, beautiful birds, and chased after them. The birds alighted just out of range of a spear throw, and when the four young men came closer, they took off again, only to alight just out of range. In this way, Conaire and his foster brothers chased the flock of birds all the way to the land’s edge, where the birds landed on the water.",
		"That very same day, in Tara, the High King died. Now in Ireland a king did not inherit his position, he was chosen according to certain rules and rituals. To discover who the next king should be, the people of Tara held a Bull Feast. A bull was killed, and all the blood was drained out of it, into a vat. The bull was roasted, and everyone ate of it, and there was singing and dancing and celebration. But one man, a seer, would drink all the blood of the bull, which made him drunk and sleepy. When he fell asleep, the dreams he had would be interpreted to tell the people who the next king should be. ",
		"When the seer awoke after the Bull Feast, he told the people that he had dreamed of a naked youth who came on foot to Tara, so the people waited anxiously for this unknown man to turn up.",
		"By the coast, Conaire finally managed to get a clear shot at one of the elusive birds, when all of a sudden, the whole flock of them rose up into the air and then cast off their feathers and turned into tall, stern men. The tallest and most beautiful of them approached Conaire and scolded him, saying did he not know he was under a geasa to never kill a bird, on account of his father being a bird? Conaire replied that no one had ever told him this, but that now that he knew it, he would go home and never harm a bird again. But the Bird King was not finished with young Conaire. He told him that he was going to be King, but that in order for that to happen, he must take off all his clothes and walk the whole way back to Tara, naked.",
		"\"Your reign will be prosperous,\" said the Bird King, \"But there are certain geasa that you must observe at all times.\"",
		"\"Well, I know the first; I am not to kill birds,\" said Conaire, and the Bird King replied:",
		"\"Yes. And you must never go clockwise around Tara or anti-clockwise around Breaga.\" To which Conaire agreed. But the Bird King continued. \"You must never hunt the crooked beast of Cearna. You must never sleep in a house from which firelight can be seen through the spokes of a cart. You must never enter into a red house after three reds. You must never allow pillaging in Ireland during your reign. You must never allow any man or woman alone into the house where you're staying after sunset. You must never settle a quarrel between two of your subjects. You must never spend more than nine consecutive nights away from Tara.\" As each of the geasa were pronounced, Conaire gave his word to obey them.",
		"So it was that Conaire walked back to Tara, naked and alone, all the way from the coast. When he was spotted from the ramparts, the people realized that this was their King, and they came out to greet him with soft purple cloaks and brought him in to crown him. There were some who were worried at his youth and lack of experience, but Conaire promised that he would always enquire of wise men, and take their counsel, and seeing that there was no youthful arrogance in him, they were satisfied.",
		"There followed a period of great happiness and good fortune for Ireland. There wasn't a single person who didn't have a full plate before him at dinnertime, and every man's neighbour's voice sounded sweet in his ears.",
		"Part II: Now that Conaire was King, his foster brothers went off on their own. They grew bored with hunting, and took up some more exciting pastimes. They gathered together some other bored young men, and began to make mischief. There was one farmer in particular whom they targeted: every year they stole one ox, one pig and one cow from him. He did not want to bother the king with this, but it went on so long and he was so upset, that he eventually went to Conaire with the story. Conaire did not know what to do. He still loved his foster brothers dearly, but the penalty for this kind of pillaging was death. He thought it over, and in the end decreed that each man who had been plundering should be killed at the hand of his own father, except for Conaire's three foster brothers, who he exiled to Britain.",
		"No sooner had they arrived in Britain than they gathered up a new band of followers and took up pillaging again. They made friends with a king over in Britain, and he agreed to allow them to pillage to their hearts' content, on condition that they return the favour some day.",
		"Not long after this happened, Conaire found out that two of his subjects in the south were involved in a long-standing quarrel. They were neighbours, and it looked as if things were going to escalate into warfare. So Conaire went to visit them to see if he could settle things between them. While he was there negotiating, he stayed five nights in the first man's house, and then realized he would have to stay an equal number of nights in the neighbour's house, to avoid showing favouritism, and risk rekindling the quarrel. So he stayed ten nights away from Tara, while settling matters between two of his people.",
		"On his way back to Tara, the road was full of visions of ghostly fires, and in the distance came the sounds of hordes of warrior tribes from the underworld, marching down the road. Conaire knew that something was badly wrong, and he had to get back to his seat at Tara. To avoid the fairy fires, he had to go around Tara clockwise, and anti-clockwise around Breaga. A beast was running ahead of him, and Conaire cast his spear at it without looking to see what it was, only to find when he looked at its body that he had hunted the Crooked Beast of Cearna.",
		"With each geasa he broke, the noise and the fires got worse and worse, and fairy mists descended until Conaire and his men couldn't tell where they were. There was only one road they could see, so they followed it until Conaire realized that they were on the road to Da Derga's hostel. \"Da Derga is a friend of mine, he has a good sized army and will shelter us,\" Conaire said. So they continued down the road to Da Derga's hostel, but ahead of them they spotted three men on red-coloured horses, each dressed in red cloaks with great shocks of red hair on their heads. Now Derga is the Irish word for red, and so Conaire realized that if he followed behind these three he would be breaking another of the geasa. He sent his son, Ferfla, to ask the Red Men to let them pass, but no matter what Ferfla offered them, they would not agree, and Conaire could not overtake them, no matter how he tried. They went ahead of him into Da Derga's hostel, and as he went to dismount, Conaire fell off his horse, and saw firelight from the window of the hostel shining through the spokes of a cart.",
		"Knowing that there was nowhere else for him to go, he went into the hostel, which was splendidly appointed, and Da Derga made him welcome and offered him food and rest. But outside, they could hear the sounds of the fairy horde gathering, and the cries of the warriors in the air.",
		"While all this was happening in Ireland, Conaire's foster brothers decided that the time was ripe to bring the British king, and all his armies, as well as all their band of outlaws, back to Ireland to plunder the countryside, fulfilling their side of the bargain with the British king. They arrived just in time to see the fairy hosts converging on Da Derga's hostel, and realizing that Conaire must be inside, they joined in the hordes waiting for the right time to strike. To keep a count of their numbers and how many would fall in the battle, each man threw a stone into a pile. The pile they made reached up as high as the roof-beams of Da Derga's hostel. After the battle, it was their custom that each man would take a stone away, and the stones that were left served as their tally of the fallen.",
		"By now, it was after sunset and there came a knock on the hostel's door. Conaire opened it to see a lone woman standing outside. This was no ordinary woman, this was a hag with oozy locks straggling down beyond her shoulders, pockmarked, squamous skin, and teeth like turf stacks sticking out of her mouth in all directions. Her cloak was gaping to reveal shrivelled breasts and dirty skin, and there were straggling locks of grey pubic hair swinging down about her knees. Conaire knew his geasa prevented him from letting this woman inside the house, but the laws of hospitality forbade him from telling her to stay out in the dreadful tempest. He asked her first could she go anywhere else at all, but she heaped scorn on a king that would send a poor old woman away. So Conaire took her in, and he embraced her. This pleased the hag, and she told him that though he was a good king, he would not be leaving this hostel in any piece bigger than a bird could carry in its claws.",
		"Conaire realized he had had his time, and with that the hordes descended on the hostel. Conaire fought bravely, killing many foes, but at the height of the battle, he was overcome by a terrible thirst, and could think of nothing else but getting a drink of water. But all the water in the house ran away from him when he tried to get it. He asked his servant, Mac Cecht, to go and get him water, and Mac Cecht took Ferfla and travelled the length and breadth of Ireland, but all the lakes refused to give him water, and all the rivers and streams ran away from him when he tried to collect water for Conaire Mór. He carried Ferfla on his back, but the boy dissolved in the sweat that was running off him. At last, he came to a body of water that had not heard what was happening, and he carried the water all the way back to Da Derga's hostel, cupped in his hands.",
		"He arrived just in time to see Conaire's head chopped off. Mac Cecht poured the water into the head's mouth, and poured some onto the stump of the neck, and the head of Conaire Mór spoke to him and thanked him for being such a loyal friend and servant.",
		"After the battle, the fairy hosts departed, and Mac Cecht gathered up Conaire's remains and buried at Tara as much as he could find."
	]
}