{
	"title": "Cormac Mac Airt",
	"content": [
		"Cormac Mac Art was the greatest High King that Ireland has ever known, and was said to be the man who codified the Brehon Laws, a legal system that was extraordinarily advanced for its time.",
		"Cormac's father was called Art, son of Conn. Now, Art was fighting with another man, called Lugaid Mac Conn, over who should be the king, and they were preparing for a battle at Maigh Mucruimhe. On his way to the battle, Art stopped in to visit a smith, and a very wise man, named Olc Acha. Olc Acha berated him for going into battle against Mac Conn. \"Both of you have a claim,\" Olc Acha said, \"and you should not settle this with a battle, it isn't the right way to go about it.\" But Art would not listen to his council: he was determined to fight and refused to back down.",
		"Seeing that he could not be persuaded, Olc Acha asked him how many children he had to carry on his line, in case he should die in the battle. When Art said that he had none, Olc Acha consulted with his daughter, Achtan, and they came up with a plan. Olc Acha said \"Since you're so determined to go off and get yourself killed, Achtan will spend the night with you. She'll bear you a son, and I will raise him to be your heir, and we'll say no more about it.\"",
		"Achtan was very beautiful and very wise, and being a smith's daughter she had access to wisdom of all kinds, and after she and Art had lain together, she had a prophetic dream. She dreamed that her head was cut off and a great tree grew out of her neck, spreading its branches all over Ireland. Then a wave came and knocked the tree over. She woke Art up and told him her dream, and he interpreted it for her. He said \"A woman's husband is the head of her, so your head being cut off in the dream means that tomorrow I will die in this battle, but the tree that spreads its branches all over Ireland stands for the son you'll bear me: he will grow up to be a great King, and he will not die in battle. The wave that sweeps the tree down means that he'll die choking on a fishbone.\"",
		"The next day, Art went into battle and as Achan's dream predicted, he was slaughtered by Lugaid Mac Conn. Achtan was pregnant. Olc Acha drew four circles of protection around the child in her womb: he would be safe from wolves, swords, fire and drowning. Achtan was worried that Lughaid Mac Conn might find out she was carrying Art's child, and so she decided that she was going to travel to the house of Lugna, a good friend of Art's, who would be a fine foster-father for her boy. She set out with a handmaiden, but they left very late in her pregnancy, and while she was on her way, having passed into Lugna's lands, her birth pains came over her. She had to get down from her chariot and squat down in a bed of ferns to give birth. As soon as the child was born, there was a great peal of thunder. Over in his house, Lugna heard it and said that it was the sign of a king's birth. Achtan was exhausted after the birth, so she lay down and fell asleep, telling her handmaiden to keep watch over the child, but the handmaiden too was overcome with tiredness, and lay down and took a nap. While the two women were sleeping a she-wolf came and stole the baby away.",
		"Achtan was devastated when she woke, thinking the child had been lost. When she reached Lugna's house and told him what had happened, they set everybody to scour the countryside looking for the child, but he was nowhere to be found.",
		"Some years later, a huntsman came across a she-wolf, and tracked her back to her lair, and there in the dirt playing with a pack of wolf-cubs, he saw a healthy, happy baby boy.",
		"He brought the child back to Lugna, and Lugna named him Cormac and raised him with his own sons. Now Cormac grew up believing himself to be one of Lugna's sons. But one day, he got into a fight with one of his foster-brothers, and knocked the boy to the ground. Lugna's son cried out in anger \"It's a terrible shame to be knocked down by a man who doesn't even have a father!\" Cormac was shocked by this, and went to Lugna to ask him what the other boy meant, and that was when Lugna told him that he was the son of Art, and that he had the blood of High Kings in him, and a claim to the throne.",
		"Hearing that, Cormac said: \"All right, in that case, let us go to Tara and let them know who I am, so that people can recognize me.\" So the two of them set out for Tara. On the day they arrived, Lugaid Mac Conn was sitting in judgement, which was one of the high king's most important duties. Before him was a poor sheepherder, an old woman who had only one small flock of sheep in all the world. Her sheep had gotten loose and had eaten the Queen's woad - a plant used for dying clothes. The Queen was very upset and wanted restitution. Mac Conn decreed that the sheep should be taken from the old woman and given to the Queen, but young Cormac spoke out from the crowd. He said; \"That isn't fair, the woad will grow again. It should be a shearing for a shearing. Give the Queen the sheep's wool this year.\"",
		"It was so clear to all who were listening that this was the fair and just thing to do. In fact, the whole side of Tara where Lugaid Mac Conn was sitting sank down a few feet into the ground. With this demonstration, the people decided that Cormac would be a better king than Lugaid Mac Conn. Mac Conn was peacefully deposed, Tara was rebuilt, and Cormac ushered in, beginning a new reign of prosperity and abundance.",
		"A few years into Cormac's reign, he met a beautiful young woman named Eithne, hard at work by the roadside. He was impressed by her diligence and taken with her beauty, and so he asked her foster-father Buacha if he could marry her. He learned that Buacha had once been a wealthy chieftain in Leinster, famous for his generosity. But Eithne's brothers took advantage of him, and asked him for huge and costly gifts. Refusing to give a man a gift would break the code of hospitality, and ruin Buacha's reputation, so he had no choice to give Eithne's greedy brothers everything they asked for, until in the end, they had everything he owned. He took his foster-daughter and his wife and had to leave Leinster and go and live in poverty. Eithne worked hard and uncomplainingly for her foster-father, and Buacha said that, though he would like for her to marry the king, he was not able to give permission, as Eithne wasn't his child. Cormac and Eithne decided to elope, without Buacha's permission. When she was pregnant with their first child, Cormac came back to Buacha and told him it was too late to protest. But he gave Buacha such an enormous bride price, worthy of seven king's daughters, that he was restored to his former prosperity.",
		"Cormac and Eithne lived together in Tara for many years, and they had two children, a son and a daughter. One May morning, Cormac was outside on his own, taking the air on the hillside of Tara, and he saw a stranger approaching. This stranger had a golden circle in his hair, a cloak clasped with a gold brooch, and he was tall and very beautiful. But the most striking thing about this person was the silver branch he carried in his hand. It had on it little golden apples, perfectly shaped, and when he shook it, it played such beautiful music that everyone who heard it, whether warriors with battle wounds, or women in childbirth, would fall into a healing sleep at the sound of its music, and awake healed and whole. Now as soon as he saw this silver branch, Cormac thought to himself \"I want that.\"",
		"So the stranger came to him and asked would they be friends. Cormac said they would, and the first thing he did was to ask for the silver branch. The stranger said \"I'll give it to you, in exchange for three promises.\" Cormac wanted the branch so badly that he agreed at once. The stranger gave him the branch and said, \"My first request is for your daughter Alba. I am taking her away with me.\" Cormac was shocked, but he could not go back on his word. So he agreed, and the stranger took beautiful Alba and left Tara. There was great grief and wailing among all the people of Tara, so Cormac shook the silver branch and put everyone to sleep, so they would forget their grief.",
		"A year later, the stranger returned to Tara, and told Cormac he was taking his son Cairbre, for his second promise. Cormac was devastated, but again, he could not go back on his word. There was grief and wailing in Tara and all the lands around, so again Cormac shook the branch and put everyone to sleep to forget their grief. A year after that, the stranger returned and what did he ask for, but Cormac’s wife Eithne.",
		"Now when the stranger asked, Cormac let him take Eithne, but after they had gone, he said: \"I cannot abide this.\" So he gathered up all his men and pursued the stranger. As they followed him across the plain, a great mist descended, and when it lifted, Cormac was alone in a strange land. None of his men had kept up with him, and as he walked alone through this land, he saw many strange sights.",
		"Cormac saw a house with bronze walls, and there were men on the roof, thatching it with white bird's wings. But every time they turned around for more, the wind would blow the wings away. He saw a man cutting down a whole oak tree, and casting it into the fire. And as the fire consumed the tree, the man turned to cut down another oak tree. He saw a fountain with five streams, with hazelnuts hanging over the water and salmon swimming through it.",
		"Eventually he came to a grand looking house, where a beautiful young warrior and a beautiful woman met him and made him welcome. They sat him down and asked him if he would eat with them. A swineherd came in with a pig, an axe and a log. The swineherd killed the pig with the axe and set fire to the log to cook it. Cormac was told that this was a magical pig, and every day if it was killed with the same axe and cooked over that same log, the pig and the log would be whole again on the following day. But the pig would not cook unless four truths were spoken over it. So while they were waiting for the meal, the warrior told Cormac the meaning of the sights he had seen in the Land of Promise. The men thatching the roof, he said, were men of art, who worked all their lives to accumulate wealth, which comes to nothing in the end. The man who burned the full oak tree was a man who squandered his inheritance and left nothing behind for his own heirs. And the fountain with five streams represented the five races of men, and the salmon was the salmon of knowledge.",
		"Each of them told a true story after that, and after each truth was spoken, a quarter of the pig was cooked, so by the time they were finished, the meal was ready.",
		"Then Cormac said that he was King and would not eat unless all his companions were with him and were fed as well. The warrior said \"All right,\" and Cormac's men appeared all around him. Then the warrior revealed himself: he was the stranger who had come to Tara, and he was in fact Mananan Mac Lir. He had brought the silver branch to Cormac as a test, because he wanted to bring Cormac here to the Land of Promise to teach him wisdom.",
		"He brought out a golden cup, and said that it would be broken into three pieces if a lie was spoken over it, and restored if three truths were spoken. He spoke a lie to demonstrate, and the cup broke into three.",
		"Then out came Cormac's wife and children, and Mananan Mac Lir said they had not been harmed. He said Eithne and Alba had not seen a man while they had been in the Land of Promise, and Cairbre had not seen a woman. And at these three truths, the cup leaped up and restored itself.",
		"Mananan Mac Lir gave Cormac the cup as well as the silver branch and sent him back to Tara with all the wisdom he had learned. But he told Cormac that when he died the cup and branch were not to go to his successors: they were to be returned to the Land of Promise.",
		"While Cormac Mac Art reigned in Tara, there were so many fish in the rivers that you didn't have to go fishing, you only had to reach in your hand and pull one out. The forests were so full of oak trees you couldn't pass through them. Deer and game were so plentiful, that a hunter only had to lose an arrow, and wherever it landed, it would have killed something good to eat.",
		"Cormac lived to a great age, ruling with the wisdom that had been taught to him. When he died, it was at a feast: he choked on a salmon-bone, fulfilling the prophecy his mother had had of him on the night he was conceived so many years before."
	]
}