{
	"title": "Mongan",
	"content": [
		"Long ago in Ireland, Ulster was ruled by two kings. Their names were Fiachra Finn and Fiachra Dubh, and they were cousins. Each one took a turn to rule Ulster for one year, while the other had a year of leisure, to travel and see the world, or to spend their time as they pleased, and in this way they shared the kingship.",
		"One year, when his cousin was on the throne, Fiachra Finn went travelling. He visited the King of Scandinavia, and while he was a guest there, the king fell sick under a curse. So bad was this sickness that no doctor in Scandinavia was able to cure their king. At last, a seer came forth and said that the only cure for the King of Scandinavia was the meat of a white cow with red ears.",
		"Fiachra Finn decided that, as a good guest, it would be fitting for him to go in search of this beast. So he searched the length and breadth of the country, and at last found a white cow with red ears, owned by a black hag, a widow who had no one to support her. Now this black hag had nothing at all in the world except for that one cow. All the food she had was the milk and butter from the cow, and what she could barter with the extra. She lived in a tiny hovel, and she wore a garment made out of a single piece of cloth, and owned nothing of value in the world, save for her white cow with red ears.",
		"Fiachra offered her another cow in exchange for her cow, but she was not well pleased with this exchange. So he made her a promise. He said that the king of Scandinavia would give her one cow for each hoof of her cow. The black hag had to think about this for a moment, for she was very attached to her beast, but in the end she agreed, on condition that Fiachra Finn vouched for the honesty of the Scandinavian king. Fiachra Finn was sure he would make good on the bargain, and he brought back the white cow with red ears. After eating the meat of it, the King of Scandinavia was restored to his former health and vigour, and Fiachra Finn went home again to take his turn at ruling over Ulster.",
		"Now one year later, who came to his door but the black hag, and what had she to say but that the King of Scandinavia had not delivered her promised four cows. She had been left destitute for the entire year. Fiachra Finn felt dreadfully responsible for her plight, so he offered her a herd of forty cattle to take home with her. She refused this: what she wanted now was not cattle or riches, but satisfaction. So Fiachra Finn gathered an army of Ulstermen and set out to invade Scandinavia. Unfortunately for him, Scandinavia was a rich and prosperous country, so when he arrived on the shore, he was met with a host of warriors, much stronger than he had prepared for. Worse than that, the King of Scandinavia had sent his herd of sheep to defend the country. These were no ordinary sheep: they were venomous sheep with giant heads, gnashing teeth and rasping tongues. They surrounded Fiachra Finn's army, and Fiachra Finn knew that they were doomed.",
		"Then suddenly, the fearsome sheep parted to let through a tall, beautiful man in a cloak of green with a circlet of gold around his head, a circlet of silver around his wrist, and gold brooches holding up his cloak. He told Fiachra Finn that he would ward off the sheep if Fiachra Finn would allow him to spend the night with his wife. Now Fiachra Finn did not want to agree to this, but he knew he had a duty to the men he'd led into battle, so he agreed to the stranger's conditions. The stranger revealed that he was Mananan Mac Lir, god of the sea, and that Fiachra Finn's wife would conceive a child by him. In order to protect her feelings, he promised that he would disguise himself as Fiachra Finn when he visited her, and he would be sure to make Fiachra Finn proud. So with a wink, he reached under his cloak and pulled out a giant dog, which chased away all the sheep and killed a thousand Scandinavian men. With the odds levelled, and the armies now of equal size, Fiachra Finn and his army won the day, and Fiachra Finn gave the black hag seven castles and 200 head of cattle.",
		"He went back home to Ulster to find his wife already pregnant. When she gave birth to the child, he was born covered in hair, so they could give him no other name but Mongan, which means 'hairy beast'. On the same night that Mongan was born, two other babies were born as well: one was the son of Fiachra Finn's manservant, and the other was the daughter of Fiachra Dubh. The two boy-children were baptized together to bind them forever as brothers, and at the same ceremony, the daughter of Fiachra Dubh, called Dubhlacha, was betrothed to Mongan the hairy beast.",
		"Soon after this, Mananan Mac Lir came out from the waves and announced that he was going to take his son to the Land of Promise and raise him there, giving him all the knowledge and wisdom of the other world. Growing up in Tir na nOg, Mongan learned all sorts of skills: shape shifting, poetry, magical knowledge, and the ability to foretell the future.",
		"When he was sixteen years old, Mongan returned to Ulster to join his family, but when he arrived he found that Fiachra Dubh had grown tired of sharing the kingship, and had treacherously killed Fiachra Finn, seizing the whole throne for himself. Now, when Mongan turned up Fiachra Dubh was on the spot: he hadn't considered that Fiachra Finn's son might come back some day. He apologized to Mongan for what he had done, and offered to share the throne with him.",
		"Mongan accepted, and they became kings together, sharing the throne in the same way as before. To make amends for killing Mongan's father, Fiachra Dubh gave him Dubhlacha to marry, and the two were very happy together. Mongan's foster-brother, who had been baptized with him all those years ago, became Mongan's loyal manservant, and married Dubhlacha's handmaiden, so the four of them were very happy together.",
		"One day, Mananan Mac Lir came to visit, and when he saw the way things were, he chastised Mongan for failing to avenge his father's death, and letting his uncle away with this murder with no real consequences. With this advice, Mongan took action at last: he killed Fiachra Dubh and became the sole King of Ulster.",
		"Some time later, Mongan and his mother went walking on the beach one day and picked up a stone. The minute he picked up the stone, he had a vision. He told his mother that this was the stone that was going to kill him. She snatched the stone out of his hand and jumped in a boat. She went far out to sea and cast the stone as far away from her as she could, hoping the waves would swallow it and keep it from harming her son.",
		"Soon after he became King, Mongan decided to take a tour of Ireland and get to know the land a little better. He went and stayed with Brandubh, the King of Leinster. Now Brandubh had a whole herd of white cattle with red ears, and each heifer had a calf by her side. Mongan was struck by the beauty of this herd, and he felt a great desire to own them himself. Brandubh said that he could have the cattle if Mongan agreed that they would have a friendship without refusal. Mongan agreed to give Brandubh whatever he asked for in the future, and went away back to Ulster with his fabulous herd.",
		"Some time later, Brandubh came for a visit and announced that he'd decided what he wanted in exchange for his wonderful herd, and what he wanted was Mongan's wife, Dubhlacha. Mongan was taken aback, and didn't want to agree, but Dubhlacha told him his honour was at stake, and honour lasted longer than anything that happened in life. He had to keep his word. She made Brandubh promise that he would not touch her or marry her for an entire year, and after she had his word on this, she went to Leinster with him.",
		"Now when Dubhlacha went to Leinster, she took her handmaiden with her, the wife of Mongan's foster-brother and manservant. Very soon after they were separated from their wives, Mongan's manservant became very lonely. He missed the comforts of his wife, and complained incessantly to Mongan for swapping their wives for a herd of cattle. The more time went by, the more frustrated he became, and the more he complained and missed his wife. He scoffed at Mongan's fabulous education in the Land of Promise, and said all he'd learned to do was to eat and drink and enjoy himself, and none of his skills were any use.",
		"Mongan decided he was going to have to do something about this, so the two of them set out for Leinster to see what could be done. On the way, they ran into a pair of monks from Leinster. They waylaid the monks, directing them into the river, and Mongan used magic to shapeshift himself and his manservant into the likeness of the monks.",
		"They arrived in Brandubh's house with the appearance of two monks of Leinster, who were known to Brandubh's household, and they said they had come to hear Dubhlacha's confession. They were given privacy with Dubhlacha and her handmaiden, and as soon as the four of them were alone, Mongan took the shapes of the monks off them, so they could spend time together.",
		"In the meantime, the monks had managed to get out of the river, and they made their way back to Brandubh's house. When they knocked on the door, the doorman greeted them with some confusion, for he'd let in two men with just the same faces not long ago. Mongan overheard, and put his disguise back on. He told the doorman \"That monk must be Mongan in disguise.\" The Leinstermen, convinced that this was a plot, killed one of the monks and chased away the other, and Mongan and his manservant finished up their visit and went on their way in safety.",
		"Three more times over the course of the year, Mongan and his manservant visited their wives in the guise of monks. But as the year came to a close, Brandubh began to make arrangements. He was going to force Dubhlacha to have to marry him.",
		"The wedding day dawned, and the guests began to arrive, and at his manservant's insistence, Mongan was among them, disguised in another shape, to see if there was anything he could to do put a stop to the proceedings. On the way there, Mongan met an old hag, hideous and toothless. He asked her would she come to the wedding with them, and he put a magic spell on her that transformed her into the most beautiful girl in Ireland. The hag was well pleased with her disguise, and delighted with the prospect of a wedding feast.",
		"Now, when the got to the wedding, and Brandubh saw this beautiful young woman, he forgot all about Dubhlacha. He asked the girl there and then to marry him. The beautiful young girl was well pleased with this flattery, but Mongan said that she was his daughter, and as he was a king, he would not consent to let her be married so abruptly. Brandubh begged and pleaded with him, offering riches and finery, but to no avail. He offered him a spell that could cure any illness or ailment, but again Mongan refused. Then Brandubh offered him Dubhlacha. \"I don't want her any more,\" he said, \"I want this girl to be my wife.\" Mongan agreed at once, with feigned reluctance, and took Dubhlacha and her handmaiden home, leaving Brandubh to marry the transformed hag in a lavish wedding feast.",
		"The next morning, Brandubh woke up next to a hideous old woman, in place of the beautiful young bride he'd lain down with the night before, and lamented the trick that had been played on him.",
		"But Mongan and Dubhlacha, and their servants, were delighted to be reunited and ruled Ulster in peace and prosperity for many years.",
		"The stone that Mongan's mother had cast into the sea killed him in the end, and this is the way that it happened."
	]
}