{
	"title": "Niall of the Nine Hostages",
	"content": [
		"There was once a High King of Ireland called Eochaid. His wife was a beautiful dark-haired woman called Mong Find. She had four sons with King Eochaid: Brian, Aillil, Fergus and Fiachra. But Eochaid was in love with someone else. He had a hostage he'd taken from the King of the Saxons. She was named Caireann, and he fell completely in love with her, but Mongfind hated her. She made Caireann carry the water from the well for the whole household, all by herself and everyone was so afraid of the Queen that they were afraid to look at her or talk to her, so they all turned their faces away when they saw her.",
		"Caireann found out that she was pregnant with the king's child, and Mongfind made her work even harder in the hopes that she would not be able to carry the baby to term. But she was strong and she was able, and one day on the way to the well, the baby pains came over her, and she gave birth to a son onto the grass. But she was so afraid of Mongfind and what she would do to the baby that she didn't pick him up. She didn't even touch him. She picked up the water buckets and carried the water back into the house. No one would pick up the child, everyone was too afraid of the Queen.",
		"That is until a poet called Torna came along. He saw the baby in the grass, and picked him up, and he had a vision. He suddenly knew who this child was and he knew that it would grow up to be the greatest king. He was going to be the King who held Kingship unopposed and all his descendants after him would be kings of Ireland. So Torna decided that no matter what the Queen had to say about it, he was going to take this boy and raise him in secret. He named the baby Niall and raised him and educated him, and he didn't let him near Tara until he was fully grown and of an age to take the throne.",
		"On that day, Torna and Niall travelled back to Tara. The first person Niall saw was his mother, still carrying buckets of water to and fro from the well. He went over to her and told her to put the buckets down. \"What are you doing dressed in rags,\" he said \"when you are my mother, and I am the King of Ireland's son?\" She protested that the Queen would object to him elevating her, but he took her inside and dressed her in purple robes and gave her a high seat. The Queen was indeed furious. But Eochaid was delighted to see his long-lost son. Everyone in Tara was thrilled with this new arrival, he was beautiful and wise and athletic and noble, so Mongfind realized she could do nothing direct against him.",
		"So instead, Mongfind demanded that Eochaid choose an heir from among his sons. She was sure that he would choose Brian, or one of her sons, because after all, this young man Niall was a stranger, and he had known her sons all their lives and had raised them. But Eochaid really didn't want to choose. He didn't want to play favourites, so he asked his druid Sithchean to give them a test to find out which one was suitable to be the next king. Sithchean told the five sons of Eochaid to go into the forge and make weapons for themselves, and that they would be judged accordingly. But as soon as they were in the forge, he closed the door and set it on fire. The real test was to see what they would save from the burning forge.  Brian came out first, carrying the hammers, and Sithcheann pronounced that this meant Brian was a strong man, and he would be a fighter. Fiachra carried out a cask of beer, this meant that he would hold the beauty and the science of the people. Aillil carried out a chest of weapons, which meant Ailliil would be the man to take vengeance for the people, and then Fergus came out with a bundle of kindling, which mean that he was withered, or impotent, and he would have no children. Niall came out last, carrying the anvil. Sithchean announced that this meant that he was a solid anvil for all the people, and he was the one who should be King.",
		"Mongfind would not accept this judgement. She told her sons to fight among themselves, and when Niall tried to come between them, to kill him and make out that it was an accident and done in the heat of the moment. They started to quarrel and then to fight, and Niall was about to go over and see if he could make peace between them, but Torna stopped him and said \"Let the sons of Eochaid be at peace\". Let them settle their own quarrel, in other words.",
		"Now, even though the druid had pronounced which of the sons of Eochaid should be king, Mongfind would not let this be publicized. Some time after that, the five sons of Eochaid went out hunting. They ranged far away from home, and hunted through a part of the country that none of them had seen before. They caught some game and made a fire to cook what they had killed, but they had brought no water with them. After they had eaten, they were struck with a powerful thirst.",
		"They sent the youngest, Fergus, to go out for water, and he looked high and low and could find nothing. At last he found a well, but barring his way was a woman. She was no ordinary woman, she was a hag. She had long, skinny limbs that were crooked and her skin was spotted with disease and black with dirt. She had fingernails so long they curled and dirt underneath them, mossy teeth that stuck out at all angles like gravestones and hair that was greasy and coarse as a horse's mane. Fergus plucked up the courage to ask this fearsome creature if he could have a drink of water from the well. She said \"Yes, you may. If you give me a kiss.\" Fergus declared that he would rather die of thirst and away he ran. He told his brothers that he had found nothing.",
		"Each of the brothers in turn went looking for water, and each in turn found the well, and the hag. Aillil and Brian refused her. Fiachra managed to bring himself to give her a peck on the cheek, and she was quite pleased with this. She told him that two of his descendants would one day be kings, but she wouldn't give him any water. Each one of the brothers reported that they had found no water at all. At last Niall went looking, and when he found the hag and she told him her price, she said \"Not only will I kiss you, I will lie down with you\", and he took her in his arms and he laid her down on the grass, and lo and behold she was transformed into the most beautiful woman, with long straight limbs and white soft skin and golden hair and beautiful rosy lips. She told him that he was going to be King, and all his descendants after him. She told him to take water from the well, and to bring it back to his brothers, but not to let them have any until they swore to give him dominion over them forever and never to challenge him.",
		"He took his time at the well before he came back to his brothers. By now, they were dying of thirst, but Niall refused to give them a drop of water until they had given up their rights to kingship, and renounced their claim to be king. Then they all journeyed back to Tara together.",
		"When they hung up their weapons, Niall hung his weapon up a hand's span above theirs, to show that he was first among them, and when they sat down, Niall sat at the head of the table. Eochaid and Mongfind came over to ask them how their hunting had gone, and Niall was the one who answered. Now Mongfind stopped him and said it was not appropriate for him to answer, when Brian was his elder and the one who should speak for them. And that is when the brothers told her that they had given Niall dominion over them, and he was the one who would be king. So all Mongfind's machinations came to nothing.",
		"Niall became the King and to ensure peace in his reign, he conquered all the provinces of Ireland and provinces in Britain and Scotland. Rather than rule over these lands, he took a hostage from each province, nine in total, to ensure that they would not cause any trouble. And all the kings of Ireland after that were descended from Niall of the Nine hostages."
	]
}