{
	"title": "The Book of Invasions",
	"subtitle": "Part 4 - The Tuatha de Dannan",
	"content": [
		"The Fir Bolg, sensible, hard-working and humble though they were, ruled in Ireland for only a short time.",
		"On a day thirty-seven years after they defeated the Fomorians, a great mist descended, and in this mist, boats landed and a wonderful race of tall, blond, beautiful people came to the land. These were the Tuatha de Dannan. They were the descendants of the Nemedians who had gone North. All the time they were away, they had been visiting four magical cities: Findias, Murias, Gorias and Falias, and in each city they had learned all the science and magic there was to be found.",
		"They were coming back under the aegis of the goddess Danu, who had taken them on and pushed them to go back to Ireland. Not much is known about Danu herself, but some people think she is the same as Brigid, that Brigid is another name Danu held. Brigid was associated with fire and water, haling and spirituality. After Christianity came, the stories told about Brigid the goddess were transferred to Saint Brigid.",
		"The Tuatha de Dannan brought with them four magical objects: the first was the great cauldron of the Daghda. No matter how many people sat down to eat from it, they would leave full and the cauldron would not be empty. The second was a magic sword that always stayed sharp. The third was the spear of Lugh that never missed its target. And the fourth was the Lia Fail, the stone of destiny, which roared out when the rightful King sat on it. This is now said to lie in Westminster with the Coronation Stone.",
		"There were great characters among the Tuatha de Dannan. As well as Danu, there was Daghda, an enormously generous person with no sense of entitlement or his own importance. There was Aengus, the youthful, beautiful god of Love and happiness, and the Morrigan, the terrible War Goddess.",
		"The Fir Bolgs were astonished to see these shining, beautiful people landing on their shores. A fortress had sprung up in the magical mist, and the Fir Bolgs approached it. A group of people came out and introduced themselves. They examined each others' weapons. The weapons of the Tuatha de Dannan were light, bright and sharp and the weapons of the Fir Bolgs heavy, blunt and unwieldy. They exchanged arms as a sign of friendship and the Tuatha de Dannan proposed that they would divide Ireland equally between them. The Fir Bolgs said that they would think about it.",
		"After talking it over amongst themselves, the Fir Bolgs decided that they didn't want to bow down and accept that other people were going to come and take half of their land away - the land that they had won - so they determined to fight for it.",
		"They met in battle on the Plains of Moytura, and this was the First Battle of Moytura. The Tuatha de Dannan defeated the Fir Bolgs, but the King of the Tuatha de Dannan, Nuada, had his arm cut off. Now no one who was not physically perfect could hold the position of king, so Nuada lost his throne.",
		"Though they had won, the Tuatha de Dannan decided that they would give the province of Connaught to the Fir Bolgs, and let them stay there, and they would take the rest of Ireland, with their seat at Tara.",
		"Because Nuada could not be King any more, they appointed their greatest warrior to be king. He was called Breas, and he was half Tuatha de Dannan and half Fomorian. He was a strong, beautiful young man, but he turned out to have no gift for kingship whatsoever. He imposed heavy taxes on his people for his own benefit, and he also allowed the Fomorians to come in and impose taxes as well, so the Tuatha de Dannan were oppressed from within and without. Breas was a mean man who would never offer hospitality to anyone who came to his fort. This was seen as a greater crime than harsh taxes. One day a Bard came to visit and was so unimpressed by Breas's lack of hospitality that he composed the first Satire in Ireland, and this so destroyed Breas's reputation that the Tuatha de Dannan were able to depose him.",
		"Part 2",
		"The first thing Breas did was run to the Fomorians to tell them he had been cast out and ask for their help. They put together an army for him to take on the Tuatha de Dannan so that he could be king again. This army was led by Balor, a great hero from Donegal. He had one eye in his forehead that was so poisonous that whenever he opened it and gazed out from it, it split rocks in two and killed anyone in its way. There seemed to be no way to defeat him.",
		"At this time, Balor was very old, and his eyelid had grown heavy and drooped down over his eye so that five men had to stand behind him with hooks in the eyelid to open it up and direct it at his enemies.",
		"Now some years before that, Balor's daughter Eithne and a Tuatha de Dannan called Cian had their own love story, and they had a child together called Lugh. Balor had been told that his grandchild would be the death of him, so he decided to lock his daughter up while she was giving birth so that he could put the grandchild to death. Eithne managed to save her baby and sent him out to sea in a little wicker basket. Mannanan Mac Lir, the God of the Sea, took the basket and shoved it towards the home of a Smith, who found the baby and took him in. He taught the child all the arts he would need, and Lugh grew up a child of wonderful skill, skilled in all the arts and possessed of boundless curiosity. He learned all he could from everyone he met, so that there was almost nothing he couldn't do.",
		"At around the time the war was brewing, Lugh decided to seek out the Tuatha de Dannan side of his family. He journeyed to Tara and knocked at the gate. Because they were readying for war, the people in Tara were reluctant to let a stranger in. They asked him what skills he had because you could not get in without a skill that was useful to them. \"I'm a magician,\" he said, and they said they already had a magician. \"I'm a cook,\" said Lugh, and they said they already had one of those.",
		"\"I'm a smith,\"",
		"\"No, we have one of those.\"",
		"\"I read the stars.\"",
		"\"We already have a person who reads the stars.\"",
		"And on and on it went, he listing his skills and they refusing. And at last Lugh said: \"Go and ask your Master have you any one man who can do all of these things.\" And so they let him in. One of their strong men was threatened by his presence and decided to challenge him. He bent down and picked up a huge flagstone bigger than ten men, lifted it up in the air and carried it to the next hill. Without saying a word, and without any sign of aggression, Lugh quietly walked out, picked up the flagstone and threw it back so that it landed exactly where it had been picked up out of the ground. In that way he managed to calm things down, and prove his strength, without any conflict.",
		"Then Lugh set about impressing everyone else with his skills and entertaining; throwing giant boulders, jumping, and other feats. They were so impressed by this young man that they asked him to lead their troops into battle against the Fomorians. This proved to be a very wise choice. The first thing he did was to inspect all of the Tuatha de Dannan troops, identify all of their strengths and how best to use them in Battle. He devised great strategies and invented new weapons for them to use, and went off to speak with Mannanan Mac Lir to get advice.",
		"The other de Dannans made their own preparations for battle. The Daghda decided that he had to make sure the war goddess Morrigan was on their side. So he went to find her. Now the Morrigan knew that he had a reputation as being very persuasive with ladies, so she decided to protect herself by standing with one leg on either side of a river, to make sure he couldn't get at her and seduce her. But somehow he managed to get around this, and she was so pleased with him that she agreed to be on his side in the battle. He then went to the Fomorians to parley with them. They played a mean trick on the Daghda to try and disgrace him. They dug a hole in the ground and filled it up with porridge and meat and different things and told him he had to eat all. He decided to turn the tables on them, and took out his giant spoon and scooped everything up, he even ate some of the earth around the hole. He had to drag his belly behind him after that, disgusted with the Fomorians and the way they'd made a joke out of hospitality, and disappointed that they couldn't talk things out. He met a very beautiful Fomorian woman on his way home, and tried to seduce her, but she laughed at him because he was so fat. He went away and disgorged all the huge amount of porridge he'd eaten and then came back and slept with her. She was pleased enough with him that she came over to the de Dannan's side too.",
		"By the next day everyone had done their jobs so well, particularly the Daghda and Lugh, that they were ready for battle. The Fomorian troops arrived with Balor at their head. Just as his five attendants were starting to pull up his eyelid, Lugh took his sling and flung a stone through Balor's eye. The eye rolled back in his head till it pointed behind him at the Fomorian army, turning them all into stone.",
		"And that was how the Tuatha de Dannan defeated the Fomorians.",
		"Lugh arranged for the great doctor, Dian Cecht, to create a silver arm for Nuada so that he could take up the office of King again, and they lived happily in Ireland for many years, until the coming of the Milesians."
	]
}