{
	"title": "The Book of Invasions",
	"subtitle": "Part Two - Partholon",
	"content": [
		"Partholon was a giant of a man, who lived in Greece. He got involved in a war of succession, and committed the very terrible sin of killing his family. Because of this, he was put under a curse: nothing he endeavoured would ever be successful.",
		"Partholon thought that, perhaps, he might be able to outrun this curse if he went far enough, and for that reason, he decided to come to Ireland, with his wife, three sons, and all their families and retainers.",
		"When Partholon's people landed, they found only one plain in all of Ireland, and that is where Dublin is today. They created three more plains in different parts of Ireland, to make the land more habitable and to set up agriculture and industry. They explored the length and breadth of the land, and while they were in Donegal, they encountered a fearsome race of people from Tory Island. These people were called the Fomorians, and they were sea pirates with powerful magic.",
		"Partholon's people quickly found that they could not live in peace with the Fomorians, so they fought a battle with them, for dominion over the land. This was a magical battle, and in it, no one was killed. The warriors faced each other in the stance of power: standing on one leg, with one arm behind the back and one eye closed. This was the way to access the powers of the Otherworld.",
		"Partholon's people defeated the Fomorians at magic, and in response, four great lakes burst up in different parts of Ireland, a sign that they were accepted and welcomed by the land.",
		"As Partholon's people began to establish themselves, Fintan Mac Bochra made himself known to them, and became their advisor. He was able to tell them all about Ireland and how best to survive there, because he knew it better than anyone else: from a man's point of view, and a salmon's, and a hawk's.",
		"For a time they prospered. One day, Partholon the king went hunting, leaving his wife and servant together. The wife and servant slept together and then shared a drink from Partholon's cup. When he came home, Partholon took a drink and tasted them on the lip of the cup and so knew what had happened. He killed the servant, and that was the first instance of adultery, jealousy and murder on the island of Ireland. Partholon's wife replied to his anger by saying \"honey with a woman, milk with a cat, food with a host, meat with a boy, one with one, earns great risk\" and nothing more was said. So they lived together happily for another 30 years after that, till Partholon eventually died from a plague.",
		"His people flourished for 500 years, and numbered about 9,000 all over Ireland, but in one week a great and terrible plague came and wiped them all out, fulfilling the curse that had been placed on their leader so many years before.",
		"Fintan Mac Bochra survived the curse thanks to his magic, and returned to the wild and secret ways of the animals, until the next time men came to the land."
	]
}