{
	"title": "The Book of Invasions",
	"subtitle": "Part One - Cesaire",
	"content": [
		"The first person to come to Ireland was called Cesaire. Her story begins back in Egypt, when Noah was building his Ark. Noah allowed three of his sons onto the Ark, but refused to give space to another son, Bith, because he thought Bith was a thief.",
		"Bith didn't know what he was going to do, but his daughter was Cesaire, and she had a plan. Cesaire had built a three arks for herself, and had taken an idol for a god. She said that she'd take Bith with her, if he agreed to forsake the god of Noah, and follow her as leader. She crewed each of her arks with fifty skilled women, but the only men she took, aside from her father, were her brother, Ladra the pilot, and her husband, Fintan Mac Bochra.",
		"Cesaire had been told to go to Ireland. It was a new land, where no sin had been committed, so it was thought that Noah's god might spare Ireland from the great flood when he sent it. They sailed for seven years, crossing all over the known world, from the Nile all the way to Asia Minor and the Caspian Sea, across the Mediterranean. They sailed up rivers as far as the Alps, and lost two of their three ships along the way. At last, from a tower in northern Spain, Cesaire saw the coast of Ireland in the distance and knew their journey was nearly at an end. They landed in Ireland, in the harbour of Corca Dhuibhne in Kerry. Cesiare jumped onto the land first, because she was the leader, and so she became the first person ever to set foot on Ireland. Fintan Mac Bochra was the first man. All the others landed safely, except Ladra the pilot who took a wound from an oar to his thigh.",
		"Now that they'd arrived they realized that they were going to have to populate the island, but they only had three men among fifty women! So they decided to divide into three groups, with one man to each group. Noah's son Bith got 16 women because he was getting on in years and wasn't as virile as he used to be, and the other two men got 17 women each.",
		"They lived happily together for a while, but unfortunately Bith son of Noah was unable to cope with the task he'd been given and he died - the first death in Ireland - so his 16 women were divided between the other two men. Now Ladra had never quite recovered from the wound he'd taken when they landed, and he quickly succumbed. Now all the women looked to Fintan to populate Ireland.",
		"Poor Fintan, being just one man among fifty women, was completely overwhelmed by this task and ran away and hid in the mountains. Cesaire, deeply in love with him, died of a broken heart.",
		"Fintan hid himself away in a cave, and not long after that the flood came. All the women perished but for one, called Banba, a great warrior woman who ran into the hills to survive.",
		"Now Fintan was deep in a cave where he'd hid, and with the floodwaters rising you might not expect things to go so well for him. But Fintan fell asleep, and had a dream that he was a salmon. And when he woke up, he had changed into a salmon. He lived for as a salmon 300 years, swimming all the waterways of Ireland, until the flood waters receded. Then he dreamed he was a hawk, and when he woke up he was a hawk. He travelled all over Ireland, looking down on it from above and seeing everything that was going on and learning all its secrets.",
		"In this way, Fintan Mac Bochra became a great sage. He lived for over five thousand years and saw all the changes that came to Ireland through that time. He lived, by turns, as all the different animals of Ireland, and was a councillor to many of the men.",
		"While Fintan was living as a hawk, he was able to fly very far and see what was coming, and what was coming next to Ireland was a great giant from Greece called Partholon."
	]
}