{
	"title": "The Book of Invasions",
	"subtitle": "Part 5 - The Sons of Mil",
	"content": [
		"One day, many years after the Tuatha de Dannan had conquered Ireland, the king died and left his land to his three sons. The three of them could not agree on how to divide the land between them, and it seemed that there might be a war. At this time, far away in Spain, there lived a wise old man called Ith Espaine. He stood on his tower by the shore one day and looked out across the waters and saw the coast of Ireland, shrouded in mist. He felt a great desire to visit this place, and so he set off in his boat and landed in Ireland.",
		"Ith Espaine marvelled at the wonderful land he saw there. He made his way to Tara, where the king's three sons were arguing still. They welcomed Ith, and thought that because of his age, he must be very wise, so they asked him for his advice. He was very complimentary about Ireland, and impressed with everything he had seen. He advised them that they best way was to follow their own Laws. \"You are very just,\" he said, \"Just look to your own hospitality and that will tell you how to divide it up.\"",
		"But he being a foreigner, it made them uneasy to hear him talk about Ireland with such praise. They decided he must have come as a conqueror, and so without further provocation, they killed him. When Ith's grandson Mil heard what had happened, he and his sons and all the men they could gather set out on ships to Ireland to get their revenge. Mil died along the way, but his sons kept the momentum going. One of the sons of Mil, Amergin, was a great poet and druid. As the ships approached the shore , Amergin sang a song announcing that he was a file, and as such both powerful and good; one who could command any power.",
		"Amergin was the first to land on the soil of Ireland, and the first people they met were three goddesses Banba, Eriu and Fodla. The Milesians promised that they would name the land after the goddesses if they were successful. The goddesses were very pleased with this idea, so the Milesians went on with their blessings. The sons of Mil journeyed to Tara and announced to the three kings of the Tuatha de Dannan that they had come to exact revenge for their great-grandfather's murder. The three kings asked for three days, during which time they would decide whether to abandon Ireland, to fight or to submit. Amergin, being the wisest among them, agreed to this condition, and they retreated on their ships nine waves beyond the shores and waited there, so that there could be no chance of their planning anything underhanded. The druids of the Tuatha de Dannan were not so honourable, and they sang up a storm. They called down a mist to scatter the ships so that they would not be able to land again.",
		"When the storm blew up, Amergin suspected that it was magical; he sent one of his men up into the mast to see the storm from above. The man fell from the mast, but as he fell he managed to call out to Amergin that it was calm above: there was no storm. From this, Amergin knew that it was not natural.",
		"Now Amergin's druidic powers were a match for the de Dannan druids, and he sang a counter-song against their songs that quieted the storm. Furious at the treachery of the Tuatha de Dannan, the Milesians decided not to wait till the three days were up, but to land immediately. After the storm died down, one of the men, Dunn, was so enraged that he began to talk about how he would kill all of the Tuatha de Dannan, exulting in the thought of the slaughter they would wreak. As he spoke these hateful words, the storm blew up again, stronger than ever!",
		"The Sons of Mil had to make an anti-clockwise trip around Ireland before they could land by sailing up the Boyne. There on the plain of Tailtiu, they defeated the Tuatha de Dannan in a great battle, after which they settled in to reign for many years. Amergin became the Counsellor to all his brothers, who became kings. They allowed the Tuatha de Dannan to stay without forcing them to submit, but the Tuatha de Dannan did not have dominance over the land any more. Because of their pride they couldn't bear this, they retreated and shrouded themselves in invisibility, taking all of their magic with them. They took ownership of the hills, forests and waterways of Ireland, where they exist today, the people of the Sidhe."
	]
}