{
	"title": "The Book of Invasions",
	"subtitle": "Part 3 - Nemed and the Fir Bolg",
	"content": [
		"Eventually, more people came to Ireland. They were led by a man called Nemed. He arrived with thirty ships, each manned by sixty people. Fintan watched as they approached and he went to take a drink of water out of a pool. He caught sight of his own reflection and was horrified: through studying all the animals he had taken on some of their aspect.",
		"He saw himself as being wild and tough, mossy as a rock, craggy as a cliff face, grey as a badger, naked as a salmon. He realized that he was far removed from humanity and he cried out in loneliness. He went into his cave and dreamed of being a stag. When he awoke he was a stag, huge and powerful. He delighted in the power he possessed now, his great hooves able to defend himself against any predator, even the bear, and his great antlers spreading like a crown. He was King of Ireland, and he was the noblest and proudest and strongest of beasts.",
		"Now, Nemed, on his way to Ireland, came across a tower of gold, and he and his men were greedy and tried to take it, but a great storm blew up and blew them to Ireland.",
		"When they arrived, they too had to battle the Fomorians in order to win acceptance from the land. When they won Nemed compelled the Fomorians to build a fortress for him. They built a fortress of such beauty that he killed all their craftsmen so that they would not be able to re-create its equal for anyone else.",
		"Nemed died, then, from a plague, and the Fomorians took their chance to oppress the Nemedians. They demanded huge taxes from them, as well as two thirds of all their children every seven years. This was a terrible burden on the Nemedians - they would never be able to populate Ireland if this went on.",
		"Because things were so bad, the Nemedians rebelled and attacked the Fomorians, eventually succeeding and taking over their stronghold on Tory Island. The Fomorians, who were great sea-pirates, had a magical relationship with the sea. They asked the sea to flood Tory Island, killing all the Nemedians. Thirty of them managed to escape on one ship, and they scattered, some to the North, some to Greece and some to Scotland. Later on, some of them would return to Ireland.",
		"So Fintan was without the chance of human company again, and while he did enjoy being a stag, eventually he grew old and weak, and started to tremble at the knees. He went into his cave to hide from the other animals, who were growing stronger than him. Wolves sniffed him out, and they went to the cave and told him they were going to eat him. Fintan said \"Fair enough, come back tomorrow, and eat me then.\" Now the wolves were still afraid of him, they could see he still had some strength in him, so they decided to wait till the next day. That night Fintan MacBochra had a dream he was a boar, and when he woke he was a boar, a strong and youthful one at that, and so once again he was King of the Land, dominating all the other animals.",
		"Many years passed. The descendants of the Nemedians who had gone to Greece fared very badly there. They were called the Fir Bolgs, and they were oppressed and enslaved by the Greeks, so they decided to return to Ireland. They divided Ireland into five provinces, the centre point being Uisneach, the navel of Ireland. This was the place where people from any of the four provinces could come to settle their disagreements as people of the same Land, not of different Provinces.",
		"After the Fir Bolgs won their battle with the Fomorians, they took their place as rulers of Ireland. They were very sensible, hard-working and humble people, short and dark and clever. Their reign in Ireland lasted only thirty-seven years."
	]
}