{
	"title": "Midir and Etain",
	"content": [
		"Midir was a king of the Tuatha de Dannan; proud, handsome and regal. His wife was called Fuamnach, and was his equal in every way. She too was tall and proud, and she was herself the daughter of a king. She was a good wife to Midir, she looked after him well, and looked after their children and foster-children well.",
		"One of their foster children was Aengus Óg, the god of love. He was a dotie child, and their favourite foster child, and through the years that they raised him, they fell ever more in love with him - as you would, with a love god. When he grew up, and moved away to his own home, they were bereft, and Midir especially missed him terribly.",
		"One day Midir announced to Fuamnach that he was going to pay Aengus Óg a visit. On his way, he met a very beautiful young lady, so he stopped and asked her name. She told him her name was Etain, and the moment she looked into his eyes, he fell in love with her, and she with him. He asked her to come with him, and she readily agreed. The two of them then spent a year and a day at Aengus Óg's house at Brúgh na Boinne, living as husband and wife. Then Midir decided that it was time for him to go home, but he could not bear to be parted from Etain, and so he brought her with him.",
		"The moment Fuamnach saw Etain, she realized what had happened, and she was furious. In secret, she performed a magic spell on Etain, transforming her into a pool of water. Then she conjured up a magic wind that dried up the water. The steam from the water condensed into a butterfly, and then Fuamnach was satisfied. But then the butterfly flew to Midir, and wafted him with its wings. Beautiful music came up from its wings, and a beautiful scent, and Midir recognized his love, Etain. From then on, everywhere he went, the butterfly Etain perched on his shoulder, and the two of them were never seen apart.",
		"Fuamnach was furious that her trick hadn't worked. She turned to magic again, and conjured up a magical storm. The storm caught Etain up, and dragged her away from Midir. She was blown and buffeted by the winds for many years, until at last the storm blew itself out, and she found herself at Brúgh na Boínne, near the house of Aengus Óg. Aengus was able to recognize her, and he built a room of glass especially for her, where she would be safe from any ill winds. He filled it with flowers, and made it the most comfortable home for a butterfly that he could. Etain lived there for some time, until one day she mistakenly fluttered outside. Fuamnach's storm, which was always waiting, swept down and caught her up again.",
		"The storm battered Etain for seven long years, and then it blew her in through the high window of a mortal king's banqueting hall. The king and his wife were having a feast for all their subjects. Exhausted, Etain the butterfly fell in a faint off a rafter, and landed in the wine cup of the king's wife. She drank back the butterfly, and turned to her husband, saying \"I am with child.\" Nine months later, she gave birth to a beautiful baby girl. The king and his wife named the girl Etain, and she grew up to be the loveliest young woman that anyone had ever seen, with no memory of her immortal life before.",
		"Now, the High King in Ireland, a man named Eochaid Airem, was told by his advisors that it was time for him to find a wife. He heard rumours of this beautiful king's daughter, Etain, and decided that she should be the one for him. He called for Etain, to meet her, and she was well pleased with the match, and so they married and lived happily together.",
		"After some time, King Eochaid Airem's brother fell sick. In his sickbed, he called for Etain, and when she came to him, he told her that he was lovesick, because of the great love he had for her. He insisted that he would die if she would not agree to meet him in a love tryst the very next day. She agreed, and at once he felt better.",
		"The next day, Etain came to meet the king's brother at the arranged place, but as soon as she saw him, he changed form. He grew taller, and a glorious light shone out of him, and she realized that this was not her husband's brother. Indeed it was Midir, who told her the story of their love, and how he had been searching for her for three hundred years, and now that he had found her, after all the obstacles that they had overcome, he was never going to let her go again.",
		"But Etain drew herself up. She told him she knew none of this, and had no memory of the things he was telling her, and besides all that, she was a married woman. Midir called after her and said, \"If I get your husband's permission, will you come away with me?\"",
		"Etain said yes, thinking it unlikely.",
		"The next day, Midir turned up at the house of Eochaid Airem, and challenged him to a game of chess. Eochaid Airem won the first game, and the second game, and was so confident in his skills that he agreed to wager that the winner of the next game could claim any gift he asked from the loser. Midir won, and demanded that he be allowed to embrace and kiss the king's wife, Etain.",
		"Eochaid Airem was annoyed at this request: he certainly did not want another man to embrace and kiss his own wife! So he asked Midir for a month's grace, and Midir left, promising to come back and claim his prize.",
		"Eochaid Airem readied all his army, and spent the month training them and making sure they were fit and well-equipped, and battle-ready. On the day Midir was to return, he put all the men in his banqueting hall, surrounding Etain and prepared to repel any invader. But Midir entered by magic, and appeared inside the fort. He embraced Etain, and the moment he put his arms around her, she remembered everything. She remembered the storm, she remembered her immortal life, and she remembered Midir and their great love. She kissed him passionately, and as the king and all his men watched, Etain began to shine with the light of the immortals. She and Midir rose up off the ground, and floated out of the window, never to be seen again. Eochaid Airem, broken-hearted, spent the rest of his life digging up every fairy fort he came across, in search of his lost love."
	]
}