{
	"name": "Aengus Og",
	"overview": "Aengus Og son of the Daghda and Bionn (Goddess of the river Boyne) is the love god of Irish Mythology.  Aengus means 'true vigour'.",
	"motto": "Aengus Og, God of Love, Four bright birds hovered over his head.  The birds represented his kisses.  He brought love singing into the hearts of  any a maiden and youth.",
	"stories": [
		"A spell cast by the Dagda caused Aengus Og to be both conceived and born on the same day, hence he is known as the archetypal youth.  According to the myth of Diarmuid and Grainne, Aengus Og was Diarmuid's guardian from the Tuatha.  He offered the safety of his protective cloak to both Diarmuid and Grainne in their attempt to escape Finn and his men.  He advised them on which path to follow on their journey and also presented Diarmuid with a gift of a sword.",
		"Aengus fell in love with awoman he had seen in a dream.  He asked Bionn and the Dagda for help.  The Dagda called for aid from Bov the Red (from the Children of LIr).  Bov undertook a search that lasted one year and declared that he found her by the Lake of the Dragons Mouth.  When they went to the lake they saw one hundred and fifty maidens tied in pairs with gold chains.  But Aengus knew his lady because she was taller than the rest.  Her name was Caer, daughter of Ethel.  But Ethel would not let his daughter go.",
		"Aengus lamented that he was not strong enough to carry her off.  Bov sought the help of Meadbh and Ailill of Connaught, but Ethel refused again.  However with the combined powers Ailill and the Dagda they took Ethel prisoner.  When they demanded Caer again he confessed that he did not comply for 'she is more powerful than I'.    He explained that she lived alternatively in the form of a maiden and a swan 'and on the first day of November next she will be seen with a hundred and fifty other swans at the Lake of the Dragons Mouth'.  Aengus went to the Lake and told Caer of his love for her.   He was transformed in to a swan and the lovers flew to the palace on the Boyne accompanied by a music so divine that it lulled many hearers to sleep for three days and three nights."
	],
	"conclusion": "Aengus Og is a patron of young lovers.  He helps them to get over the obstacles in front of them."
}