{
	"name": "Ailill",
	"overview": "Ailill was just a boy when he was brought to Meadhbh's court.  He grew to be a fine champion and Meadhbh deserted her third husband to make him her fourth.  All stories of Ailill seem to be in connection with Queen Meadhbh.",
	"motto": "",
	"stories": [
		"Meadhbh would only take a husband on three conditions: 'That he be without stinginess, without fear and without jealousy'.  And Ailill did seem to be without jealousy as he put up with her affair with Fearghus mac Rioch.  Until, one day while out walking he noticed a hazel bush shaking.  He investigated and found Fearghus and Meadhbh making love. Ailill took the sword from Fearghus' scabbard and replaced it with a timber one.  He vowed not to replace it until the final great battle of the cattle raid.",
		"And it was Ailill who was responsible for Feargus Mac Rioch's death.  Fearghus had returned to Connacht and went swimming in a lake called Loch Finn. He was such a great swimmer that all the gravel and stones came up to the surface. Meadhbh joined him in the water and wrapped herself around him and they swam this way around the lake. Meadhbh's husband Ailill grew jealous and said to his brother Lughaidh standing by 'The stag and the doe are acting splendidly in the lake'. Lughaidh cast his javelin and killed Fearghus.",
		"It was Meadhbh's need to be Ailill's equal in relation to her wealth that started the whole epic of the Tain.  It was through their pillow talk; while they were comparing their wealth that Meadhbh discovered Ailill was wealthier by one bull.",
		"Ailill's own death was as a result of Meadhbh's jealousy.  He was having a little soiree with one of his wife's ladies in waiting.  Meadhbh ordered Conall to slay him, which Conell did with 'a quiet javelin cast'.  She then announced that Conell was the culprit of Ailill's death, which was of course the end of poor Conell."
	],
	"conclusion": "To be married to Meadhbh had to be without jealousy but it was his jealousy that was his demise."
}