{
	"name": "Aoife",
	"overview": "Aoife (The Bright One) was the daughter of Ailill of Aran, foster daughter to Bodhbh Dearg the King of the Tuatha Dé Danann, and younger sister to Aobh who was the first wife of Lir of SídhFionnachaidh.",
	"motto": "",
	"stories": [
		"After Lir's wife died giving birth to twin boys, Aoife was offered as a second wife to console him. At first, Aoife was happy. She loved her four stepchildren and showered her affections on them. And her new husband was so besotted with his children that he wanted them all to sleep in the same room, so he could see them last thing at night and first thing in the morning when he opened his eyes. But Aoife became jealous of Lir's affections for his children. And as time passed her jealousy got the better of her.  She planned a trip that fooled the children into thinking they were going to visit their step grandfather, Bodhbh.  Aoife's plan was to kill the children along the way.  But, she could not bring herself to wield her sword on the innocent children. Instead she cast a spell with her magic wand which turned the children of Lir into swans. She left them with their human sense and reason, their voices and their Irish. Fionnuala, the eldest and only girl begged and pleaded for the spell to be reversed. And Aoife did feel some remorse at this stage, but it was too late. She did not have the power to reverse the spell.  Instead she placed a limit on it, saying that it would last until a noble woman from the south married a noble man from the north.",
		"When Bodhbh discovered Aoife's terrible deed, he changed her into a demon that was banished to the four winds forever. And some people say you can still hear her voice on a stormy night, sighing and sobbing above the sound of the wind.",
		"Some say Aoife was turned into a crane like bird condemned to spend eternity in the skies. It is also said that a bag (crane bag) which contained the treasures, sacred or symbolic objects of the Fianna was made from the skin of Aoife. Cranes are regarded as good luck omens because they depart the countryside in times of war. Hence, their presence suggests that peace will prevail. The relationship between women and birds is a constant theme in folklore and myth all over the world."
	],
	"conclusion": "Aoife was a jealous stepmother who suffered terrible punishment for her deeds."
}