{
	"name": "Balor of the Evil Eye",
	"overview": "Balor was a powerful leader of the Formorians; a dark and demonic race that were the terrible oppressors of the Tuatha De Danann. He was killed by his grandson Lugh at the Battle of Moytura, which had been prophesised. So immense was the size of Balor that twenty-seven of his soldiers fell and died underneath him when he was slain.",
	"motto": "",
	"stories": [
		"One day, when Balor was young, he spied on his father's Druids as they were concocting a spell of death. The fumes entered one of Balor's eyes as he spied, which gave the power of death to that eye. While among his own people, Balor always kept his evil eye closed hence his eyelid became so heavy that after time it took ten men to open it. However, Balor's eye proved to be a powerful tool in battle as it had the power to kill all that it beheld. He became the most powerful leader of the Formorians. And, it is said by the folk in Cong Co Mayo, that the rocks there, are men who were petrified by the glance of Balor's eye.",
		"On that same day in Balor's youth, one of the Druids prophesised, that he would be killed at the hands of his own grandson. To prevent this coming true he imprisoned his beautiful daughter Eithne in a tower and gave orders that a man's name must not be mentioned in her presence. However it was Balor himself who caused Eithne to meet the man of her dreams.",
		"Though he had plenty of cattle Balor coveted the marvellous cow called Glas Ghoibhneann who was owned by Cian of the Tuatha De Danann. Balor stole the cow from Cian by disguising himself. Cian went after his cow and found the beautiful Eithne. She recognised him as the man from her dreams and they fell in love. Eithne gave birth to a son and called him Lugh. Balor ordered the child to be killed but Lugh survived to fulfil prophesy and killed his grandfather with a slingshot at the Battle of Moytura."
	],
	"conclusion": "Balor is the mythical tyrant, a sort of evil Goliath character, with huge destructive power in his 'eye'.  He is also unwittingly the progenitor of a line that includes Lugh and then Cuchulain, mighty figures in Irish Myth.  He is obviously best know for the confrontation with Lugh in the Second Battle of Moytura."
}