{
	"name": "Bodhbh Dearg",
	"overview": "Bodhbh Dearg (Bov The Red) resided in Sídh ar Feimhim ( Slievenamon Co Tipperary). He was  the chosen King of the Tuatha Dé Danann following their defeat by the Gaelic people.",
	"motto": "",
	"stories": [
		"After the decision was made to make Bodhbh Dearg King, Bodhbh discovered that Lir of Sídh Fionnachaidh was offended as he had seen himself as a candidate for the kingship. In an attempt at reconciliation Bodhbh offered his step daughter Aobh's (Eve) hand in marriage to Lir.  Later, when Aobh died giving birth to twin boys he felt so sorry for Lir that he offered Aobh's younger sister Aoife to him as a consolation for his woeful grief.",
		"Bodhbh was devoted to the children of Lir and when he learned of the terrible fate bestowed upon his step grandchildren, he turned Aoife into a demon forever with his druid's wand. He changed her into the form of a bird condemned to spend eternity in the skies. Then, he joined Lir in his grief at Lake Derravarragh to be consoled by the beautiful music of the swan children.",
		"Another story concerning Bodhbh Dearg concerns Aonghus Óg (son of the Daghda and the Goddess Bíonn).  Aonghus fell sick with love for a woman he had seen in a dream.  The Dagda called for aid from Bodhbh Dearg who undertook a search that lasted one year. At the end of that year, Bodhbh declared that he had found her at Crotta Cliach (the Galtee Mountains in Co Tipperary) by Lake Muskry (Loch Béal Dragan). When they went to the lake they saw one hundred and fifty identical maidens tied in pairs with gold chains.  But Angus knew his lady because she was taller than the rest.  Her name was Caer daughter of Eathal.  But alas, Eathal would not let his daughter go.  Bodhbh sought the help of Meadhbh and Ailill of Connaught and it was discovered that Caer lived alternately in the form of a maiden and a swan.  On the first day of November she would be seen with a hundred and fifty other swans at Lake Muskry. Angus went there to tell Caer of his love for her. There, he was transformed into a swan and the lovers flew away accompanied by music so divine that it lulled any hearers to sleep for three days and three nights."
	],
	"conclusion": "Bodhbh Dearg was a resourceful King who seemed to find solutions to every problem."
}