{
	"name": "Breas the Beautiful",
	"overview": "Breas became King of the Tuatha De Danann when Nuadu was wounded in battle against the Fir Bolgs. His ruled unjustly and broke with the tradition of providing entertainment for his subjects.",
	"motto": "",
	"stories": [
		"Once there was a maiden called Ériu who, when walking along the sea shore saw a stunningly handsome young man sailing into land on a silver vessel. The maiden and the man made love and before he departed he gave her a ring. He told her to give the ring only to the person whose finger it would fit. He told her he was Ealatha, a King of the Formorians. Breas the Beautiful was conceived from this union.",
		"Breas' rule as King of the Tuatha De Danann was oppressive. He connived with the Formorians, exacting taxes from his people. He made slaves of the Daghda, God of Wisdom, and Oghma the poet. He humiliated them by making them carry loads of firewood.",
		"But another poet, Cairbre mac Éadoine satirised Breas for his meanness and from that hour on, there was blight on his rule. Fortified by the satire, the Tuatha De Danann demanded the resignation of Breas but agreed to let him remain in office until he had served seven years as King.  Breas used his remaining time as King to assemble the Formorians to battle against the Tuatha De Danann. When Breas went to his mother to inquire about his Paternity, Ériu gave him the ring that Ealatha had given her on the day he was conceived. The ring fitted him perfectly.  Breas then went to his father Ealatha, who refused help to his son because he had ruled unjustly. Instead he sent him to Balor for the help he needed.",
		"The Tuatha De Danann defeated the Formorians at the Battle of Moytura. Lugh, the new King offered to spare Breas' life in exchange for agricultural advice. Breas told him that ploughing, sowing and reaping should all be done on a Tuesday. Because of this advice his life was spared and he returned to the realm of his father Ealatha."
	],
	"conclusion": "Breas' reign as King of the Tuatha De Danann was unjust which did not make Ealatha the Formorian proud."
}