{
	"name": "Bricriu of the Poison Tongue",
	"overview": "Bricriu of the Poison Tongue, aptly named for his abuse of his masterful arts. His satires broke peoples reputations, and likely as not, livelihoods, and his dry, cruel sense of humor much feared across the land of Erin.",
	"motto": "",
	"stories": [
		"His saving was his sparkling wit and the fact that he was tremendously, fabulously wealthy. He entertained lavish get-togethers and he announced the biggest feast of the year to be held at a special stronghold built just for the occasion. It was fit for a High King when completed, and the gathering was expected to be the talk of the region for some time to come. Absolutely everyone was invited and they determined to go, Poison Tongue or no.",
		"The Ulster champions in particular were warned by Fergus MacRiogh, who had a good head on his shoulders, that to attend would end in some mischief, and like as not would be fatal to those boisterous lads. He wasn't listened to.",
		"Cuchulainn attended with his equally impressive wife, Emer, she of the Six Womanly Gifts: music, physical beauty, the gift of song, embroidery, the gift of wisdom, and of modesty. Conal Cearnath's wife was with him, Lendabair the Fair, whose golden hair shone like spun silk in the sun. Fedelm the Ever-blooming travelled there as well with her champion husband Laoghaire Buadach, and her voice was like that of birds on a warm summer day.",
		"All were impressed as they entered Bricriu's house with it's open, airy spaces and massive pillars. Bricriu, playing the indulgent host, saw an opportunity to express his twisted humor. He struck up a conversation with Fedelm, who came of an old, royal family, and made a point to tell her so. He complimented her and said 'It has been given unto me in a vision,' he went on, 'the first lady to enter the banqueting hall shalt be queen over all the other women, indeed over all the people of Ulster.'",
		"That evening the ladies with their maids strolled to take the air in the garden. After a time it was apparent that the evening was wearing on and they should return.",
		"Over the first rise the women and their servants walked, neither walking faster than the others. They walked with dignity and grace, Then they reached the second ridge and their pace quickened, each one glancing at the other to see their progress. After the third rise one after another broke into a run, startling the attendants who clambered to keep up. Catching up their skirts they tucked them into their girdles for easier running, and they dashed full-out Cascades of hair streamed behind them, blonde and red and brown hair flowing in the breeze, screaming war-cries and nostrils flaring.",
		"The Champions rushed out to see the huge pile of women in front of the door, still fighting amongst each other over who gets to be High Queen.  And laughing so hard tears streaming down his cheeks was the well-dressed starter of troubles, Bricriu of the Poison Tongue."
	],
	"conclusion": ""
}