{
	"name": "Brigid",
	"overview": "The character of Brigid is extremely interesting in that she seems to have been both a pagan goddess and a Christian saint, with a smooth transition over time. As a goddess she was the patron of healing, crafts and poetry. Although venerated all over Ireland, Brigid had special territorial power over Leinster.  She was an expert in prophecy and she was invoked by women in childbirth.  This fertility aspect of her character is strong, and her pagan feast day was the feast of Imbolc, which was a season al fertility feat celebrating the lactating of ewes.",
	"motto": "",
	"stories": [
		"The Christian story of Brigid tells of her growing up in a pagan, perhaps druidic house.  She was surrounded by magic, being fed by the milk of Otherworld cows.  Her father was enraged at his daughter's profession of Christianity. And was even more angry when she said she wished to live a celibate life tending to the poor and needy.  Brigid is admired for her strength in standing up to her Father, and she became the first Irish nun.  In spite of her celibacy, Brigid remained strongly connected to images of fertility.  She had a food store that never decreased, and from her cloak she could provide a lake of milk.",
		"A story tells of how she and a small band of followers wished to establish a convent for themselves somewhere in Kildare. Brigid sent a request to the local, pagan, land owner asking for a portion of land on which to build this convent.  The reply came back that she could have whatever land her cloak covered when laid on the ground.  Not daunted by this rebuff, Brigid laid her cloak on the ground and it grew to a size big enough for a convent and a substantial farm besides.",
		"The Brigid's cross which is so popular in Irish country homes today came into being when Brigid visited a sick man in her locality.  While she tended him he asked her the nature of her Christian God, and while telling him the story of Christ, Brigid picked up the rushes from the floor and started to weave them into a cross, fastening the points together. The sick man asked what she was doing. She began to explain the cross, and as she talked, his delirium quieted and he questioned her with growing interest. Through her weaving, he converted and was baptized at the point of death. Since then, the cross of rushes has been venerated in Ireland."
	],
	"conclusion": "Brigid as a female was a gentle, cultured woman, with strong powers of healing and providing.  In her guise as a Christian woman she had the strength of her convictions and pursued her aims, but in a quiet, determined way, and not with harshness or stridency.  She is surrounded by magic and mystery, and it is impossible to say where paganism stops and Christianity begins."
}