{
	"name": "Cathbad",
	"overview": "The term druid means 'very knowledgeable' and druids were seen as members of an exclusive occupational class.  It is generally accepted that the druid was a sort of intermediary and had direct connections with the otherworld.  A druid's opinion was always sought on matters of law and tradition.  They could identify thieves, interpret dreams, cure illnesses and give shrewd military advice.  The druid was believed to possess mystical powers and in Irish tradition the term 'bard' is more often used for leading figures such as a poet whose verse was believed to have magical connotations.  The teachings of the druid were based on the five elements: earth, sea, sky, sun and moon.",
	"motto": "",
	"stories": [
		"The centre of a druidic ritual was in a sacred place located close to trees, the word for druid still held by some scholars is 'oak scientist'.  The favourite tree of the druids was the Rowan tree and it was on wattles of this tree that a druid would sleep to gain prophetic visions from their dreams."
	],
	"conclusion": "The relationship held between the King and Druid was of extreme importance, for it determined the fortune of the king and that of his people.  If there was a good king there was seen to be good corn and mast and therefore prosperity for the people.  The direct relationship between the king and druid is perceived as thus: the druid represents the child of wisdom, born of the male sun representing the cult of the king and mother earth symbolised by the female goddess.  Despite possessing great knowledge, a druid also held great power.  Not only did druids serve a high king, but they also curtailed the power of the ruler.  According to the myth of Deirdre and the Sons of Usna, Chief druid Cathbad held the highest office at the Court of King Conor MacNeasa.  No one was permitted to speak before the king, but the king himself had to wait for Cathbad.  He prophesised the fate of the tragic Deirdre and the Sons of Usna."
}