{
	"name": "Cesaire",
	"overview": "Cesaire was one of the first goddesses of Ireland, and a great leader. She was the granddaughter of Noah, who when refused entry onto the ark, decided to create one of her own. She led a large group of people to Ireland in the hope of starting afresh there.",
	"motto": "",
	"stories": [
		"When she was ten years old her foster father, a priest in Egypt, told her to gather together a group and set out in order to escape the flood. She built a fleet of three ships, which she populated with many capable women, each with a different skill. When her father Bith was refused entry onto the ark, along with Fintan and Ladra, Cesaire offered to bring them to safety as long as they acknowledged her leadership. She set sail for Inis Fáil (Land of destiny, or Ireland), reasoning that as Ireland had as yet been unpopulated by man, no sin would have been committed there, and so would be safe from the flood sent to cleanse the world of evil.",
		"After many years of traveling they finally arrived in Ireland. Only one ship remained, which contained fifty women and three men. They decided to divide the women into three groups, each group to take one of the men to populate the land. They also divided up the sheep they had brought with them (the first sheep to come to Ireland). Cesair allocated herself to Fintan's group. Banba, a great warrior was the leader of Ladra's group.",
		"Bith died, overwhelmed by the responsibility of impregnating 16 women. Cesaire and Banba divided his women and brought them into their own groups. Ladra, incapable of surviving the greater demands, also died, which left Fintan as the only man on an island of fifty women. Feeling inadequate in the face of this mammoth task, Fintan fled in the form of a salmon. Cesaire, abandoned by her great love, was broken hearted, and soon died. The rest of the women died in the flood, apart from Banba. Fintan, in the form of a salmon, also survived. It is thought that the Formorians were descended from this pair."
	],
	"conclusion": "Cesaire was a formidable woman, taking the future of her and her people into her own hands, unwilling to wait patiently while a wrathful god planned her extermination. She is thought to have been an early Irish goddess, with a strong agricultural role. She displays power and sexuality, common traits in Irish goddesses."
}