{
	"name": "The Children of Lir",
	"overview": "Fionnuala and her brother Aed were the first born children of Lir of Sídh Fionnachaidh and his wife Aobh (Eve). Twin boys followed called Conn and Fiacra. Their mother died giving birth to the twins and their father married Aoife their mother's younger sister. Fionnuala was as fair as the young rowan tree. Aed was a little bright eyed boy. Comely Conn and Fiacra of the beautiful arms were as swift and strong as running water.",
	"motto": "",
	"stories": [
		"The children were loved so much by their father that they all slept in the same room so he would never be denied the sight of them at any time of the night or morning. Their stepmother Aoife also loved them but became jealous of the attention Lir bestowed on them. One day, she took the children on a trip to see their step grandfather Bodhbh Dearg, the King of the Tuatha Dé Danann. Fionnuala, being intuitive, sensed her stepmother's treachery before it happened but she was powerless to save them from their fate. Aoife cast a spell that changed the children of Lir into swans, retaining their human sense and reason, their voices and their Irish. Fionnuala begged Aoife to reverse the spell causing Aoife to feel some remorse. But remorse was no good, as Aoife had not the power to reverse her terrible deed. Instead she placed a limit on the spell deeming that they would resume their human shape when a King from the north married a Queen from the south of Ireland. This did not happen for nine hundred years.",
		"The children of Lir spent their first three hundred years on Lake Derravarragh (Loch Dairbhreach) where they consoled their father, grandfather and countless others with the music of the Sidhe. Every one that heard their music would sleep sound and quiet whatever trouble or sickness of heart might be on them. They spent the second three hundred years on the Sea of Moyle (Sruth na Maoile). There, they were blown by the storm winds and frozen by the ice so badly that their webbed feet were frozen solid to the rocks causing them to suffer the pain of salt water on their wounds. Once, after a terrible storm Fionnuala lamented their fate as she thought she had lost her brothers forever. But they returned to find her and she comforted them; Conn under her right wing, Fiacra under her left and Aed between the feathers at her breast until their strength returned. Their final three hundred years was spent on the Atlantic Ocean off Erris Co Mayo where they sheltered in the bays and on a lake on an island called Inis Glory (Inis Gluaire). There they met the Christian missionary, St Mochaomhóg who was kind to them and taught them about Jesus. They resumed their human shape when King Lairgnéan from Connaght married Deoch the daughter of the King of Munster. The new Queen desired the swans as a wedding present but when King Lairgnéan tried to take them away, the spell ended and the children turned into old and withered people. St Mochaomhóg christened them before they died."
	],
	"conclusion": "The story of the Children of Lir has to be one of the saddest in the Irish, or indeed, any tradition.  Through no fault of their own, years of exile, and then not a happy ending!"
}