{
	"name": "Cian",
	"overview": "Cian was a man of the Tuatha De Danann who owned the wonderful cow called Glas Ghoibhneann who never ran dry.   Balor tricked Cian to steal the cow.  But Cian with the help of the druid Birog found himself on Balor's island where he slept with Eithne, the imprisoned daughter, and so Lugh was born.  Thus enabling the prophecy whereby Balor would die at the hands of his grandson.",
	"motto": "",
	"stories": [
		"So many people had tried to steal his cow that Cian was forced to guard her night and day. He attached a halter to her and brought her everywhere. Balor of the Evil Eye, the Formorian King, had often disguised himself to try and seize Cian's cow. One day Cian visited his brother Goibhniu at his forge to talk to him about making some new weapons. While he was talking, he left his cow outside in the care of another of his brothers. Balor seized this opportunity by changing himself into a red-headed boy. He told the brother who was minding the cow that Cian and Goibhniu were going to use all the steel to make weapons for themselves and there would be none left when it came to his turn. Cian's brother left the red-headed boy to mind the cow while he went into the forge to protest. Balor shed his disguise and fled with Cian's cow.",
		"Cian went to a druid to ask for help in recovering his property but the druid reminded Cian that no one could go near Balor without risking life because of his evil eye. Determined, Cian sought the help he needed from a woman druid called Birog. Birog disguised Cian as a woman and conjured a strong wind to bring them to Balor's island. It was here that Cian met and fell in love with Balor's beautiful daughter Eithne. After they made love Cian wanted to save Eithne from her prison tower and take her back to Ireland with him but Birog's fear of Balor was too great to help him. Instead, she conjured another wind that took Cian away from the island and his beloved.",
		"When Eithne gave birth to their son Lugh, Balor banished the child to the waves with no regard for the pleading of his daughter.  And, he thought the child drowned but Birog conjured another wind that carried the baby into the arms of his father. Cian had Lugh fostered by Taillte daughter of the King of the great plain, and of Echaid the Rough, son of Duach and he became a great warrior and King."
	],
	"conclusion": "Cian was a resourceful member of the Tuatha De Danann.  His main role is to have fathered Lugh, master of all arts.  Lugh in turn was the ather of Cuculain.  In terms of impact and legacy, his male heirs certainly were huge in the Irish myth tradition."
}