{
	"name": "Conaire Mor",
	"overview": "When Eochaid married Etain, Etain produced one child, a daughter. The king was furious at this and ordered that she be taken to a pit and killed. The men who were to carry out the king's wishes set her free and she fled to the cow sheds of the King of Tara. There her name became Mess Buachalla 'the cowherds fosterling'. One day a bird appeared and declared that she would become pregnant by him, and that the child was never to kill birds.  He also said the child's name was to be Conaire.  Thus Conaire was born, the son of a bird man.  This link between hero and birds is quite common in Irish Mythology, the Children of Lir being another example.",
	"motto": "",
	"stories": [
		"After the death of King Eterscel, a 'bull-feast' was set up to decide the successor.  This involved killing a bull and a man would eat his fill and drink its broth.  He would then fall asleep and an incantation would be sung over him.  In his dream he would see a man and this man would be declared king.  The result of this was  the sleeper saw 'a naked man carrying a stone in a sling coming after nightfall along the road to Tara'.  Conaire had gone to the bull-feast but had left early and had pursued a flock of great white speckled birds along Merrion Strand, trying to kill them with his sling.  One of the birds changed shape to the warrior Nemglan, and warned him not to attack birds, as this was one of his geasa.  He then told the young man to venture back to Tara naked.  Conaire followed the instructions and arrived at Tara where he was welcomed in and accepted as king.",
		"But Conaire's demise came due to his breaking of the geasa one by one.  One geis broken was his following of three red warriors to a dwelling.  Another concerned a woman he met, a beanscal, and despite the fact that a geis stated that he should not admit a woman inside after midnight, he allowed her in and she spent the night with him.",
		"Conaire's death came in a battle with a group of marauders from Britain.  Conaire had excited a group of such men from Ireland but with the help of Ingcel, a British pirate, they attacked a hostel where Conaire was staying.  Three times they set fire to the dwelling and three times the inhabitants put it out.  But now Conaire was consumed with thirst and with no water left MacCecht went out to search for some.  When he returned he saw that the raiders had returned and had severed Conaire's head. In revenge, Mac Cecht lifted a pillar and drove it through a marauder's spine.  He then gave the head a drink of water and it spoke to him, praising him for his kindness in quenching his thirst."
	],
	"conclusion": "Conaire was a brave young hero who became king but was a victim of fate, unable to escape the breaking of his geasa."
}