{
	"name": "Connla",
	"overview": "Connla was the only son of Cuchulainn.  His mother, Aife, a famed warrior queen was the arch enemy of Scathach who had trained Cuchulainn as a champion.  When Cuchulainn stood against Aife on behalf of Scathach she made a promise to bear him a son.  She was pregnant when he left her and swore to send the child to Cuchulainn in Ireland after seven years.  Cuchulainn left a gold ring with Aife, telling her to give it to the child when he was big enough.",
	"motto": "",
	"stories": [
		"Connla grew up well trained in the arts of war and was strong and brave for his age as his father was before him.  When he was seven years old Aife took him aside and gave him the gold ring Cuchulainn had left for him and issued his father's instructions.  These were that he should journey to Ulster, but that he should not identify himself to any one man, that he should not turn aside from his path and that he should never refuse to go into battle with anyone.  Connla set out in a boat for Ireland.  When he drew close to the Irish coast the men of Concobhar Mac Nessa, king of Ulster saw him coming, practicing great and daring feats.  He was shooting down birds with his sling, reviving them and throwing them back in to the air.",
		"In awe of this, Concobhar sent his trusted warrior down to the shore to find out who the boy was and establish that his intentions were friendly.  But Connla refused to identify himself, in obedience to his father's instructions, as only one man had asked him who he was.  He fought against and defeated Concobhar's warrior.  Then Concobhar himself asked him who he was but the boy refused to answer.  One by one the men of Ulster went against him but in each case Connla kept his identity a secret and willingly fought with the men and humiliated them utterly.  Cuchulainn then heard that a mere boy was putting the armies of Ulster to shame and he went forward to meet the youth.  His wife, Emer, begged him not to go, since she could feel in her heart that his boy was a son of Cuchulainn's.  But Cuchulainn said that his honour was at stake and that for the sake of Ulster he would stand against even his only son.  He then went down to Connla and asked him for his name but again he had come alone and so Connla would not answer.",
		"Cuchulainn challenged him to combat for his impudence and the boy cut the top of Cuchulainn's hair with his sword.  Enraged, Cuchulainn began wrestling with him and the boy threw him.  They battled in the ford and the boy held Cuchulainn's head beneath the water twice.  Cuchulainn was now furious and he used the Gae Bolga on his own son, the wound of which was always fatal.  Cuchulainn took the boy up in his arms and said to the men of Ulster that he was his son.  Connla then embraced his father and died, at which point all of Ulster lamented."
	],
	"conclusion": "Connla is a perfect imitation of what Cuchulainn was like as a boy.  His strength and bravery were amazing, and he had knowledge of many daring feats.  His tragedy is that he followed his unknown father's instructions to the letter and so aroused the anger of Cuchulainn.  Cuchulainn was put in a position of having to kill his own son for the honour and preservation of Ulster but his irritation with the impudent boy could stem from the fact that he saw too much of himself in the seven year old.  Connla died content that he had fought against the great champions of Ireland and won fame for himself in doing so."
}