{
	"name": "Conor MacNessa",
	"overview": "Tradition implies that Conchobhar was the son of the High King of Ireland Fachtna Fathach and that the Druid Cathbhadh was his guardian. Fearghus mac Rioch, King of Ulster fell in love with his mother Neasa who consented to be his wife if he allowed her son to reign instead of him for a year.  Ulster prospered for that year and Conchobhar proved to be so popular that he retained his Kingship banishing Fearghus.  Civil War ensued until it was agreed that he would retain the Kingship while Fearghus would become seneschal of the Province.",
	"motto": "",
	"stories": [
		"Conchobhar Mac Neasa was a great success as King.  While he reigned the crops grew plentiful, the cattle were fat and the rivers and lakes were full of fish.  He began each day by tending to the administrative problems of Ulster.  Afterwards he divided his day into three parts.  The first part consisted of watching the boys of the Kingdom performing their athletics, the second playing chess and the third feasting and being entertained.  He slept with the bride of each of his subjects on her wedding night and the wife of any household he cared to visit.  He was also known as a brave and resourceful warrior.",
		"When the beautiful Deirdre fell in love with Naoise of Usnach King Conchobhar was furious because he had waited to have her for himself while she was growing from child to woman.  Deirdre, Naoise and his brothers Ardan and Ainnle fled Ulster and eventually Ireland to be safe from the relentless pursuit of King Conchobhar and his men.  Eventually the King sent words of pardon to Scotland where they lived in exile.  But this was a cruel trick, which led to the tragic deaths of the Sons of Usnach.  King Conchobhar then took the grieving Deirdre as his wife until she threw herself from a chariot to her death.",
		"This story is also the reason for Fearghus Mac Rioch's departure from Ulster to Connacht to join Queen Meadbh's army.  The king asked Fearghus to bring Deirdre and the sons back to Ulster knowing they would trust him.  But Conchobhar arranged that Fearghus be asked to feast with a chief called Borrach on his way home.  There was a bond (geis) on Fearghus that he could never refuse a feast prepared in his honour so he had to let the party go ahead protected by his son Fiacha.  Conchobhar killed Fiacha and the sons of Usnach.  Fearghus is said to have attacked Emain Macha each night for sixteen years and brought bloodshed and suffering to Conchobhar's Kingdom.  Fearghus took sanctuary with  a large band of soldiers in Connacht with Queen Meadbh."
	],
	"conclusion": "Conchobhar was a prosperous King who was popular with his people.  However, it was the one thing that he could not have that was to be his greatest failing."
}