{
	"name": "Cormac Mac Airt",
	"overview": "Cormac Mac Airt  was a mythical high king of Ireland and one of the most celebrated kings in Irish tradition.  He was sometimes given the epithet Ulfhada (longbearded), which denoted his great wisdom.  He was portrayed as an ideal king whose power brought good fortune and prosperity to the whole country.  In his reign the rivers of Ireland were overflowing with fish, forests were difficult to travel due to the amount of fruit on the trees, and the plains were difficult to travel because of all the honey.  Peace reigned supreme, crops grew copiously and cows had a massive milk yield.",
	"motto": "",
	"stories": [
		"Art was the son of the high king of Ireland.  On the night before he was to fight in a battle, Art slept with Achtan.  In the battle the next day he was slain, and Lugaidh usurped the throne.  After Cormac was born Achtan feared hostility from Lugaidh and took him to the North of Ireland to live with his foster-father, Fiachna.  On reaching the age of thirty, his grandfather, a druid, advised him to take the kingship as it was rightfully his.  Cormac set out for Tara.",
		"Arriving in Tara he met a woman crying because her herd of sheep had been confiscated because they had been caught grazing in the queen's field of woad.  'One shearing for another would have been more just' Cormac wisely answered.  Lugaidh heard of this and recognised the truth of this judgement.  He accepted the supremacy of Cormac without trouble and handed over the kingship.  Cormac restored Tara as it had never been before and built the great fortress of the kings there.  One day in Tara Cormac met a stranger who carried a branch bearing three golden apples.  These gave out beautiful music when the branch was shaken.  Cormac desired the branch and the stranger promised to give it to him in return for the granting of three requests.  Cormac agreed.",
		"One year later the stranger turned up and asked for Ailbhe, Cormac's daughter.  The next year he asked for Cairbre, his son.  Next year he asked for Eithne, his wife.  Cormac was disconsolate without this wife and set off after the stranger.  He arrived in a strange land where the stranger showed him a pig on a spit and told him that the pig could not be roasted unless four truths were told in its presence.  He told Cormac that Ailbhe, Cairbre and Eithne had been untouched while being in his land and asked Cormac to tell a truth.  Cormac told him how he had lost his family.  The pig was cooked through.",
		"The stranger revealed that he was Manannan, the sea deity and that he had brought Cormac to the Land of Promise in order to show him the nature of true wisdom.  His family was returned to him and he received the gift of a goblet, which broke into three pieces when a lie was spoken, and which mended when a truth was."
	],
	"conclusion": "Cormac is always portrayed as the Solomon of the Irish, making wise decisions and counsels.  His accession to sovereignty of Tara is portrayed in terms which emphasise his wisdom and justice.  He is a hero, not of martial prowess, but of kingship.  He commanded huge loyalty from his followers, and was always a man of his word."
}