{
	"name": "Cúchulainn",
	"overview": "Cúchulainn was the son of the Celtic god Lugh and a mortal princess.  He was destined for a short glorious life, and he was often depicted with the shadow of his doom looming over his shoulder.  As a boy his name was Setanta.  On a journey to join the king of Ulster's court, he acquired a new name.  The king, Conchobar Mac Nessa,  and his court were feasting at the house of Culann the Smith.  Culann set his fierce hound to guard the door in addition to 150 of Conchobar's own boy troops.  Setanta, armed only with a hurley stick and sliotar, tried to reach the court.  With this he destroyed all of the youths and then drove his sliotar into the mouth of the savage hound, killing it instantly.  Culann was devastated at the loss of his guard dog, but Setanta volunteered to perform the task, instead, thus gaining the name Cúchulainn, meaning 'the hound of Culann'. ",
	"motto": "",
	"stories": [
		"Cúchulainn was trained as a warrior in Scotland by a mystical female warrior named Scathach.  Cúchulainn returned to Ireland to be the champion of Ulster in the war against  Medb, queen of Connacht, who wished to seize a bull belonging to Ulster.  The most tragic episode of the conflict occurred when Cúchulainn was forced to fight his childhood friend and foster brother, Ferdia.  Cúchulainn killed him with his secret weapon.  This was a dart which separated into multiple barbs when entering the body, causing fatal wounds, and was impossible to withdraw.  Another aspect in his favour was his 'warp spasm' which occurred when he was in the fury of battle. This gave him a monstrous appearance, and turned him into a lethal killing machine who did not know friend from foe.",
		"Cúchulainn was married to an Irish princess Emer, who required him to perform several very difficult tasks before he could wed her. They were happy together until Cúchulainn became enamoured of the fairy princess Fand.  Emer was consumed with jealousy until Fand returned to her husband and Mananann cast a spell of forgetfulness over all involved so that they could return to their previous states.  Cúchulainn was eventually killed by the combined armies of Connacht after being lured through trickery by Medb.  His death was said to be foreshadowed by many evil omens, and the death crow, the Morrigan, was seen to settle on his shoulder as he made his last stand"
	],
	"conclusion": "Cúchulainn was a mighty warrior whose fame spread throughout the world.  Because of his short life he was single-minded in his quest for glory.  He was loyal to his friends and family, and had a strong sense of duty."
}