{
	"name": "Danu",
	"overview": "Danu is the most ancient of the Celtic gods. She was referred to as the mother of the Irish gods, which indicates that she was a mother goddess. In this guise she probably represented the earth and its fruitfulness. Many place names in Ireland are associated with her, most notable the Paps of Anu in Kerry, which resemble the breasts of a large supine female, part of the land. She is the 'beantuathach' (farmer), which reinforces the fertility aspect of the goddess. Rivers are associated with her, and represent the fertility and abundance in a land. There is a suggestion that Danu might have had dual characteristics, one being the beneficent, nurturing mother goddess, and another being the strong, malevolent side of the warrior goddess. The root 'dan' in ancient Irish means art, skill, poetry, knowledge, and wisdom.",
	"motto": "",
	"stories": [
		"Not many stories of the goddess Danu survive, but there are several allusions to her that help us to piece together her personality. She is associated in one story with Bile, the god of light and healing. Bile was represented as a sacred oak tree that was fed and nurtured by Danu. This union resulted in the birth of Daghdha. The strength and stability of this male figure needed the nurturing nature of the land in order to flourish.",
		"She is most associated with the Tuatha Dé Danaan, the people of the goddess Danu. These were a group of people, descended from Nemed, who had been exiled from Ireland, and scattered. It is thought that Danu offered them her patronage, under which they succeeded in rebanding, learning new and magical skills, and returning to Ireland in a magical mist. The mist is thought to be the loving embrace of Danu herself. She is seen as having influenced them, nurturing these broken people back to strength, and imparting magic and esoteric wisdom to them. The Tuatha Dé Danaan are the clearest representatives in Irish myth of the powers of light and knowledge. In this story we can identify aspects of the nurturing mother goddess, the teacher imparting wisdom, as well as the warrior goddess who does not give up.",
		"The Tuatha Dé Danaan were associated with Craftsmanship, music, poetry and magic, as was Danu herself."
	],
	"conclusion": "Danu was clearly a very powerful and fundamental earth goddess, from which all power, wisdom and fecundity of the land poured forth. She was a wisdom goddess of Inspiration and intellect (In this case she is very similar to the goddess Brigit, who is thought to be the same goddess with a different title). She was also a teacher, as she passed many of her skills on to the Tuatha Dé Danaan. She also had aspects of the warrior goddess. In Danu we find traces of the triple goddess, so commonly associated with Irish goddesses."
}