{
	"name": "Deichtre",
	"overview": "Deichtre was the mother of Cuchulainn and the sister of the King of Ulster Concobhar Mac Nessa.",
	"motto": "",
	"stories": [
		"One day Deichtre collected fifty maidens and left Ulster without telling the King.  The men of Ulster looked for them for three years but could not find them.  It was said that the women often took the form of a flock of birds who stripped the land of all vegetation.  Deichtre and her companions found a new home for themselves in the land of the fairies.",
		"Story has it that Deichtre was sitting outside her house one day, drinking from a great goblet when a tiny fly  settled on the rim.  She swallowed the fly with her drink.  That night she dreamt that a tall and beautiful man came to her and said that she would bear  a son who was to be called Setanta.  This vision was of the god LUgh and it is said that he was the divine father of Cuchulainn. Meanwhile the men of Ulster had drawn near to the first stronghold where the women were staying.  A fairy man, with Deichtre by his side, welcomed them and asked them why they came.  They answered that they were missing fifty maidens for whom they had been searching for three years.  The fairy lord invited them in, saying that they would find the women inside and Deichtre offered them hospitality.",
		"Concobhar claimed his right as king of Ulster to sleep with his host's woman and so asked that Deichtre be sent to him in the night, without realising she was his own sister.  The woman asked for a night's respite, since she was in labour and Concobhar went to sleep.  In the morning the infant was found in the folds of his cloak.  Deichtre left the fairy land and returned to Ulster with her brother and he gave her the charge of bringing up the boy who was named Setanta.  He was well trained and educated and later became known as Cuchulainn, a name he acquired from his boyhood deeds."
	],
	"conclusion": "Deichtre was an independent and fearless woman as shown by the way she left Ulster of her own accord and without the permission or knowledge of the king.  It is said she used to drive his chariot for him when he went into battle.  There was a strongly magical element to her in that she dwelt in the land of the fairies and attracted the god Luch.  Once she gave birth to her son she was a devoted mother and loved him dearly."
}