{
	"name": "Deirdre",
	"overview": "Deirdre was the daughter of Fedlimid, storyteller to king Conor MacNessa.  Before she was born, she gave a terrible shriek from her mother's womb that terrified all that heard it.  Cathbad the druid foretold that the unborn child would turn out to be the most beautiful woman in Ireland, but that a terrible evil would come from her, and that she should be killed at birth to forestall disaster.",
	"motto": "",
	"stories": [
		"Conor McNessa refused to give the order for the infant's death.  Instead he decreed that she should be brought up in seclusion, having nothing to do with any man, until she came of an age when he himself would marry her.  She was therefore given into the care of Lavarcham, a wise and satiric woman, to be raised as a fitting bride for a king.  Deirdre grew up in the charge of her motherly nurse, never seeing a man, and becoming accomplished in skills befitting a noble woman.",
		"One day she saw from her window the slaughter of a calf, and declared she would only love a man who had the three colours she saw there before her; skin as white as the snow on the ground, cheeks as red as the blood which flowed from the slain calf, and hair as black as the raven that had swooped down to feed on the carcass.  Lavarcham declared that such a man already existed - his name was Naoise, and he was the son of UShna.  Deirdre went into a decline until such time as she should meet this man.  It happened that one day Naoise was out hunting and Deirdre escaped from her house to go out and meet him.  She begged him to elope with her, and he tried to refuse, since he knew the orders of Conor McNessa.  But she refused to release him, and so Naoise summoned his two brothers and they left Ulster, taking Deirdre with them.  Naoise and Deirdre were happily married, and loved each other dearly.",
		"Conor McNessa would allow them no peace however, and sent many men after them to retrieve Deirdre.  Naoise and his brothers were almost invincible when they fought together, killing many of Ulster's best men, and so Conor had to resort to trickery.  He sent a message via Fergus MacRoy, his chief advisor, who stood guarantor for the king's good behaviour.  Deirdre and the son of Ushna were told that they could return in safety to Ulster, that the king no longer bore them malice.  But when the brothers arrived, mercenary allies of Conor set them upon, and they were overpowered and killed.  Some say that Deirdre was taken into captivity by Conor, and made to live with him for a year, during which time she never laughed or slept.",
		"One year after the death of Naoise, Conor brought her to meet Eogan MacDurthacht - the slayer of her husband.  She was thus caught between the two men she hated most on earth, and in rage and despair she dashed her brained out on a standing stone that was before her.  Others say that she was overwhelmed with grief at the sight of Naoise's dead body on the day he was killed, and cast herself on to it, mourning loudly.  She then died of a broken heart, and they were buried together."
	],
	"conclusion": "Deirdre was most famous of her extraordinary beauty, and it was this beauty, which caused such terrible bloodshed among the men of Ulster.  She was headstrong in that she would not allow Naoise to go away without taking her with him, and she was responsible for the exile of him and his brothers.  She loved Naoise dearly, and was broken hearted at his death, which was brought about by the trickery of Conor McNessa who wished to have her as his own possession."
}