{
	"name": "Eithne",
	"overview": "Eithne was the beautiful daughter of Balor of the Evil Eye who lived in fear of the prophesy of a Druid that said; he would die at the hand of his own grandson.",
	"motto": "",
	"stories": [
		"Balor lived in a shining tower of glass on an island off the coast of Ireland. Beside this, he built another tower for his daughter Eithne. There, she was locked up with twelve women to guard her. Balor's orders were not only that Eithne must never see a man, but that a man's name was never to be mentioned in her company.",
		"Eithne grew to be a beautiful woman and although she was a prisoner, she was treated with kindness. The twelve women kept her company and taught her skills but Eithne spent long lonely hours looking out of her window to the sea. And each night she saw a face in her dreams that she did not know in her imprisoned life.",
		"One night two women screamed at the foot of the tower for help. They said that one was a Queen of the Tuatha De Danann who was escaping from a terrible enemy. Eithne's minders took pity on the women and let them in. But one of these women was a druid called Birog who cast a spell that sent all twelve women to sleep. Then Birog lifted a spell from the woman who accompanied her revealing Cian a man of the Tuatha De Danann who was looking for a valuable cow, stolen from him by Balor.  Cian climbed to the top of the tower and found Eithne staring out to sea. He thought she was the most beautiful woman he had ever seen. Immediately Eithne recognised Cian from her dreams and they fell in love. They made love to each other and Cian wanted to take Eithne with him, but Birog did not have the magic to help them. She was afraid of Balor and swept Cian up in a spell that  brought him back to Ireland.",
		"Eithne gave birth to a son called Lugh. He was taken from her and cast into the sea despite her pleading and the weeping of her women."
	],
	"conclusion": "Eithne is a tragic figure who loses her lover and her son for her father's protection."
}