{
	"name": "Emer",
	"overview": "Emer was the noble daughter of a Chieftain named Forgall the Clever and he had a reputation for slyness.  She was the only woman Cuchulainn deemed worthy to be his wife.",
	"motto": "",
	"stories": [
		"The leaders of Ulster were anxious to have Cuchulainn married since his extraordinary beauty was causing great disturbance among their women folk.  Messengers were sent out far and wide but none could find a woman that Cuchulainn approved of.  He then set out to look for himself and came to the court of Forgall where he saw Emer conversing with her attendants.  She has six gifts which made her suitable to be Cuchulainn's wife; the gift of beauty, the gift of a good voice, the gift of sweet speech, the gift of needlework, the gift of wisdom and the gift of chastity.",
		"When Cuchulainn arrived, he and Emer began to converse in a very ritualistic style of speech, in which they exchanged their lineage and special skills. Cuchulainn was delighted that he had finally found a woman who could hold a conversation with him in this way, since every other woman had lacked the necessary knowledge.  He asked to marry her but she told him that no man could wed her who had not performed a number of specific tasks.  She enumerated these tasks and they all consisted of feats of strength and bravery.  Cuchulainn completed them all but Forgall was unhappy about the proposed alliance and told Cuchulainn that he could not wed Emer until he had first completed his warrior training under the warrior queen Scathach.",
		"Forgall swore that on Cuchulainn's return he could have whatever he wanted hoping that he would die in the attempt.  Cuchulainn trained under Scathach for a number of years and fathered a son with Scathach's arch rival Aife before he returned and married Emer.  After they were marred she had cause for jealously only once when Cuchulainn had an affair with the fairy princess, Fand.  Emer was enraged and collected fifty women to find Cuchulainn.  They found him playing chess with Fand in the land of the fairies.  Emer was deeply sorrowed by the fact that Cuchulainn preferred other women to her and she offered to stand aside in Fand's favour.  But Fand agreed that she should be the one to go and she returned to her fairy husband Manann who cast a spell of forgetfulness over all concerned so that Fand would not sorrow over Cuchulainn.  The two lived very happily from that time onwards.",
		"Cuchulainn was often away from Emer but she waited patiently for his return and when he was sick she journeyed instantly to his sickbed to care for him.  She offered him advice and consolation at various times in his career and she remained the only woman with whom he could have an intelligent conversation."
	],
	"conclusion": "Emer was a lively and intelligent woman with an independent spirit.  It was this that drew Cuchulainn to her but it also meant that she had a full life in her own right and was not solely dependent on him.  She was renowned for her great beauty.  They had a happy marriage and she made no demands on her husband even though she loved him dearly.  She knew her own mind and offered excellent counsel to Cuchulainn on many occasions.  She lived up to his first impressions of her and apart from his affair with the beautiful Fand, they were never parted."
}