{
	"name": "Eochaidh Airem",
	"overview": "Eochaidh Airem was the high king of Ireland over a thousand years after Midhir had lost Étaín, when the Tuatha Dé Danaan had retreated underground and were known as the Sidhe.",
	"motto": "",
	"stories": [
		"Eochaidh invited all the men of Ireland to Tara for a festival, but they refused to attend the festival of a king without a queen. He sent his men out to search for the most beautiful woman in Ireland. They found Étaín and brought her to Eochaidh, who fell in love with her immediately. Eochaidh's brother Ailill had also fallen in love with Étaín as soon as he set eyes on her, and began to waste away from unrequited desire. Eochaidh went on a circuit of Ireland, leaving Étaín with the dying Ailill. Ailill revealed to Étaín the cause of his illness, and said that one word from her would revive him. The softhearted Étaín could not bear to refuse him, and asked him to get better. He sat up and told her that the only way to keep him well was if she were to sleep with him. Étaín agreed, but refused to do it in her husband's house.",
		"She met him on a neighbouring hill and slept with him. Unbeknownst to her the man she actually met was Midhir, who had never stopped searching for her since he lost her, so many years before. He had put Ailill in a magical sleep and taken his form. He revealed his true identity to her and told her the story of their love and how he had lost her. She agreed to go with him on the condition that Eochaidh should allow her to go.",
		"When Eochaidh arrived home, Midhir came to him and challenged him to a game of fidchell. Eochaidh kept winning. His confidence growing, Eochaidh grew reckless, and offered a kiss and a cuddle from Étaín as his stakes. Midhir won the game. Eochaidh, realizing what he had done, gathered together the best warriors in the land to prevent Midhir from claiming his prize. Despite all the reinforcements, Midhir appeared at the centre of Eochaidh's fort. Eochaidh, resigned to his fate, allowed them to embrace. As soon as Midhir had his arms around Étaín they rose into the sky together and turned into a pair of swans.",
		"Eochaidh, devastated and alone, knew that no other woman would ever satisfy him. He set about the huge task of digging up all the fairy forts around Ireland. At one fort Midhir appeared and offered to return Étaín to him, as long as he could identify her from fifty women. Eochaidh agreed, and picked her out. He took her home and within a year she gave birth to a daughter. Midhir then came for a visit and told him that the girl he thought was Étaín was really Eochaidh's own daughter, to whom Étaín had given birth after Midhir took her. A broken man, Eochaidh sent the child of the incestuous union to be raised by a herdsman."
	],
	"conclusion": "This is the tragic tale of a man whose choice of wife changed his fate and ended up turning his world upside down. An innocent victim of the fates, Eochaidh was left abandoned, ashamed and broken."
}