{
	"name": "Fand - Fairy Woman",
	"overview": "Fand is a Fairy Woman, described as 'the pearl of beauty', wife of Manannan MacLir, the Sea God.  Her story is a small intriguing part of the Ulster Cycle and the story of Cuchulainn.",
	"motto": "",
	"stories": [
		"Cuchulainn, the great warrior, as he would sleep after hunting had a vision of two women of the Tuatha De Danann who would come and beat him till he was all but dead.  The next day he would lie in bed with a sore sickness and stay there for a year. He needed help.",
		"Then a man whom none knew came and told him to go to the pillar stone where he had seen the vision, and he would learn what was to be done for his recovery.  There he found a Danann woman in a green mantle, one of those who had chastised him, and she told him that Fand, the Pearl of Beauty, wife of Manannan the sea god, had set her love on him: and she was at enmity with her husband Manannan; and her realm was besieged by three demon kings, against whom Cuchulainn's help was sought, and the price of his help would be the love of Fand.  Laeg, the charioteer, was then sent by Cuchulainn to report upon Fand and her message.  He entered Fairyland, which lies beyond a lake across which he passed in a magic boat of bronze, and came home with a report of Fand's surpassing beauty and the wonders of the kingdom; and Cuchulainn then betook himself thither.  Here he had a battle in a dense mist with the demons, who are described as resembling sea waves - no doubt we are to understand that they are the folk of the angry husband, Manannan.  Then he abode with Fand, enjoying all the delights of Fairyland for a month, after which he bade her farewell, and appointed a trysting place on earth, the Strand of the Yew Tree, where she was to meet him.",
		"Emer, Cuchulain's wife, was none too happy when she heard of this tryst and assembled 50 of her maidens to slay Fand.  Cuchulainn and Fand see them coming and he prepares to protect his mistress against these armed angry women with golden clasps on their breasts.",
		"He addresses Emer in a curious poem, describing the beauty and skill and magical powers of Fand: 'There is nothing the spirit can wish for that she had not got'.  Emer replies: 'In good sooth, the lady to whom thou dost cling seems in no way better than I am, but the new is ever sweet and the well known is sour; thou hast all the wisdom of the time, Cuchulainn!  Once we dwelled in honour together, and still might dwell if I could find favour in thy sights'.  'By my word thou dost', said Cuchulainn, 'and shalt find it so long as I live'.",
		"'Give me up', then said Fand.  But Emer said: 'Nay, it is more fitting that I be the deserted one'.  'Not so', said Fand; 'it is I who must go'.  And an eagerness for lamentation seized upon Fand, and her soul was great within her, for it was shame for her to be deserted and straightway to return to her home; moreover, the mighty love that she bore to Cuchulainn was tumultuous in her.",
		"But Manannan, the son of the Sea, knew of her sorrow and her shame, and he came to her aid, none seeing him but she alone, and she welcomed him in a mystic song.  'Wilt thou return to me?' said Manannan, 'or abide with Cuchulainn?'  'In truth', said Fand, 'neither of ye is better or nobler than the other, but I will go with thee, Manannan, for thou hast no other mate worthy of thee, but that Cuchulainn has in Emer'."
	],
	"conclusion": "So she went to Manannan, and Cuchulainn, who did not see the god, asked Laeg what was happening.  'Fand', he replied, 'Is going away with the Son of the Sea, since she hath not been pleasing in thy sight'. Then Cuchulainn bounded in the air and fled from the place, and lay for a long time refusing meat and drink till the Druids gave him a drink of Forgetfulness."
}