{
	"name": "Ferdia",
	"overview": "Ferdia, Cuchulainn's foster brother, was one of the fiercest of the Connacht warriors and was said to possess a magical skin of horn which no point or blade could pierce.  Cuchulainn and Ferdia were close companions when they were receiving their training in arms under the warrior woman, Scathach.",
	"motto": "",
	"stories": [
		"When it was clear to Meadhbh that most of her army would soon be killed by Cuchulainn, she sought to end the conflict through single combat.  At first Ferdia refused to fight his foster brother, even when Meadhbh promised him incredible riches and the hand of her beautiful daughter Finnabair in marriage.  It was only when Meadhbh falsely claimed that Cuchulainn had belittled him that Ferdia agreed to face him in battle.",
		"When Cuchulainn and Ferdia met at the ford of battle they broke off their friendship with taunts and insults.  They fought furiously all day with shields, darts and spears - but that night they embraced and renewed their friendship.  Their horses spent the night in the same paddock and their charioteers by the same fire.  The warriors sent each other gifts of healing herbs and delicious foods and refreshing drinks.  So it was the next night, but on the evening of the third day they parted company wasted and exhausted and did not renew their friendship.",
		"The following day Ferdia hung a millstone around his neck thinking to protect himself from Cuchulainn's magic weapon - the gae bolga.  Cuchulainn saw Ferdia prepare for battle and told his charioteer Laeg that if he saw him falter in battle that he must spurt him on with mocking taunts and abuse.  They fought furiously in the ford water and it often seemed as though Ferdia had the advantage.  When Ferdia dealt Cuchulainn a horrific blow to the chest he called out for the gae bolga.  His charioteers passed it down river to him and Cuchulainn caught it in the fork of his foot and sent it flying toward Ferdia.  The weapon shattered the millstowne and filled every joint of his body with barbs.  Cuchulainn took Ferdia onto the land and  bitterly lamented that war had turned them against each other.  His charioteer Laeg cut the gae bolga from his body."
	],
	"conclusion": "Although Ferdia and Cuchulainn were very closely matched in strength, Cuchulainn possessed the secret of the gae bolga, and was prepared to use it even though it gave him an unfair advantage in battle."
}