{
	"name": "Fergus MacRoich",
	"overview": "Fergus MacRoich was the original king of Ulster, and later the patron of Conor MacNessa.  The story has it that Fergus married the beautiful woman Neas, who was the mother of Conor, on condition that he allow Conor to rule the province for one year.  When the year was up, the people claimed to prefer the rule of Conor, and so Fergus was sidelined to the role of patron of the king.  He is supposed to have possessed great virility and strength.",
	"motto": "",
	"stories": [
		"Deirdre and the son of Ushna had been exiled for a number of years when Fergus began to plead their case to Conor MacNessa.  He won a promise out of the king that they would be allowed to return to Ulster under Fergus' own protection, unharmed.  He thus placed himself as guarantor for the safe keeping of the exiles.  Naoise and his brothers were eager to return to their homeland, in spite of the suspicions of Deirdre.  When they landed on the shores of Ireland they were met by a Knight of the Red Branch who invited Fergus to a feast in his fortress that night.",
		"Fergus tried to explain that he had a mission to conduct the Sons of Ushna safely to the court of Conor MacNessa, but he was under a geis, a sacred oath, never to refuse a feast given in his name.  He was therefore obliged to remain behind, while Naoise and his companions travelled on.  Fergus' two sons took charge of them in his place, and when Conor sent armed men to arrest them, these sons drove them back.  Conor then bribed one of the sons of Fergus to desert the sons of Ushna, while Conor's own sons killed the other brother.  Then Naoise and his brothers fought against the army of Ulster and were killed.",
		"Fergus returned to find that treachery had been practised, and that one of his own sons lay dead, while the other was a traitor.  He then swore to be avenged on Conor MacNessa for thus abusing him, and he departed from Ulster to Connacht.  He was then welcomed in to the court of Medbh and Ailill and even had an affair with Medbh.  Together they plotted to bring destruction on Ulster in the course of the Cattle Raid at Cooley."
	],
	"conclusion": "Fergus Mac Roich was a good leader and advisor of men.  His name and his word inspired trust, and he was fair in his dealing with all people.  His honourable behaviour can be seen in the way in which he would not break a geis, although this unfortunately led to the loss of his own sons and the death of the sons of Ushna.  His tragedy was that the less scrupulous Conor MacNessa tricked him on two separate occasions, and this eventually led to his loss of patience.  He therefore deserted Ulster and vowed vengeance on it, feeling let down and betrayed by its king."
}