{
	"name": "Fintan MacBochra",
	"overview": "Son of Bochra which means sea.  He was a great mythical seer and sage who lived for hundreds, some say 5500 years.  He thus had detailed knowledge of past events.",
	"motto": "",
	"stories": [
		"Fintan is said to have come to Ireland with Cessair, two men and fifty-one women.  They came forty days before the Flood we know from the story of Noah.  Fintan had a lady Cessair, who he married.",
		"When the flood fame Fintan was hidden in the earth in Tul Tuinne, near the River Shannon in Tipperary.  He stayed there until the Flood had passed.  In  the Flood the other two men died, (and in some stories everyone but Fintan).  This left Fintan surrounded by women.  In some ways this would be heaven for a man - surrounded by beautiful women.  But it wasn't for Fintan.  He fled. He way only fifteen at the time.",
		"What is remarkable about Fintan is he had the shamanic gift of shape shifting.  He transformed variously into a one eyed salmon, and eagle and then a falcon.  He was also reputed to be in conversation with a hawk.  It is this experience of being animal that be acquired much of his wisdom.",
		"He also garnered much wisdom from the sheer length of time that he lived. He is said to have witnessed all the major events in the country's history (somewhat inadvertently!).  He observed the battles of Moytura, the epic of Cuchulain and the Tain as well as the reigns of many Kings, until the time of Christianity.   He was knowledgeable of the feasts of Ireland, Cattle Raids and Courtships.",
		"His life essentially a coming together of all that an aspiring Bard, Poet or learned map would need to know.  Fintan was the role model, an inspirational sage.  Fintan was once given fruit by a stranger.  When he ate the fruit he was given he was able to transform himself."
	],
	"conclusion": "Fintan was the first man of Ireland.  Remarkably, we, like Finland's first man, Vainamoinen is a shaman, magician, sage.  Because of all the experience of Shaman, Fintan wise to the history and geography in deed the ancient love of Ireland."
}