{
	"name": "Fir Bolgs",
	"overview": "The Fir Bolgs were named after what they did in much of their life.  They were men (fir) who carried clay in bags (bolg).  Enslaved by the Greeks their role was to m ake barren land fertile with the clay.  In Ireland, starting from Uisneach they divided the country into five provinces.  Possessed Ireland for thirty seven years before being defeated by the Tuatha De Danann in the first Battle of Moytura.",
	"motto": "",
	"stories": [
		"The origins of the Fir Bolgs, it is said, was from the Nemedians and specifically Semeon, grandson of Nemed who fled to Greece. As with Nemed in Ireland, the progeny of Semeon increased until they were numbered in the thousands.  However, they were enslaved by the Greeks and given the task of carrying bags of clay on bare rocks to make the barren land fertile.  It was from this task that they derived their name as 'bag-men'. Another story tells of the Greek King who gave them a territory full of poisonous snakes and that it was the Irish clay that they carried that gave them protection. Either way the Fir Bolgs were a people who knew hardship and oppression.",
		"Eventually, they escaped from Greece and settled in Ireland.  Once here their leaders, from the Fir Bolgs, the Failion and the Fir Domhnainn leaders, starting from the exact centre of Ireland, Uisneach, divided Ireland into five provinces. The word 'cuige' (a fifth) is still used for province though since medieval times there have only been five provinces.  For some, the fifth province is an important province of the imagination, a province where all can meet.  For the Fir Blogs it was an administrative centre.  Each province had a King who ruled over smaller Kingships.  One was Eochy who married Tailtiu, in whose honour the Tailteann games were held to the mid Twentieth century.",
		"The Fir Bolgs, in Ireland, throw off their former servant role and for thirty seven years they prospered.  In the plains and valleys of Ireland they cultivated fields and lived  a prosperous life.  Eventually, they were defeated by that set of descendents of Nemed that headed North with Beotham to become the Tuatha de Danann.  The Tuatha defeated the Fir Bolgs in the first Battle of Moytura."
	],
	"conclusion": "The Fir Bolgs were a people who knew a cycle of prosperity, defeat and exile and then repeat.  They knew slavery and hardship.  Essentially they are a highly practical, administratively and organizationally gifted people.  They have after all left Ireland with its basic provincial structure."
}