{
	"name": "The Formorians",
	"overview": "The Formorians are seen as euhemerised sea deities (or sea pirates) who were plunderers and intimidators of all the invaders of Ireland. They did not settle in Ireland but instead made raids from their impregnable Island Fort of Tory. This race is often depicted as ugly, dark and demonic, sometimes seen as giants or elves and were witnessed with goat or horse heads or other terrible features. It is also said that they were fearsome creatures with only one eye, one arm and one leg. They exacted taxes from the Irish settlers sometimes cutting off the noses of those who did not pay their dues.",
	"motto": "",
	"stories": [
		"The Formorians haunted the Partholonians who did battle with them but did not manage to eradicate them. They were themselves, exterminated by a plague leaving the Formorians still powerful. Thirty years later, the Nemedians arrived in Ireland and continued the work of the Partholonians building fortresses, clearing the landscape of forest and bringing forth new lakes.  This race was heroic in defeating the Formorians three times, but alas, were themselves defeated by this terrible race in their fourth encounter.",
		"This was catastrophic for the Nemedians who then had to pay annual taxes to the Formorians at Samhain injuring their dignity. But the Nemedians make a last brave attempt at battle attacking their almost impregnable tower on Tory Island. They did manage to kill the Formorian King, Conand but alas the rest of the brave Nemedians were slaughtered and scattered around the world; their offspring becoming later invaders of Ireland in the form of the Fir Bolg and the Tuatha De Danann. It was the leader of the Formorians, Balor, who is strongly associated with the Second Battle of Moytura.  This was when the Formorians gathered a huge force from Scandinavia and from Ireland for the battle.  This 'Northern' source obviously has echoes of the later invasions by the Vikings.",
		"It was in the Second Battle of Moytura that was an encounter between the 'evil eyed' Balor and the 'many skilled' Lugh.  In an encounter which echoes David and Goliath, Balor was, by a defeated by a stone fired into his eye.  The Formorian king, the handsome Breas, survived by agreeing to give agricultural advice."
	],
	"conclusion": "The Formorians were a malevolent race of sea gods with a ghostly presence that haunted all who attempted to rule or Ireland. They were aggressive in nature and had the power to humiliate.   Even though they are generally depicted as ugly, though with exception such as the beautiful Breas.  Like the Tuatha they are another supernatural, underworld race."
}