{
	"name": "Grainne",
	"overview": "Diarmuid was a young lieutenant of Finn, the now aging hero and leader of the Fianna.  At a banquet Grainne, who was at the time betrothed to Finn, fell in love with the young hero Diarmuid.  She placed him under a geis, a bond that compelled him to take her from the palace at Tara.  Therefore Diarmuid fled Tara with his leader's fiancée.",
	"motto": "",
	"stories": [
		"Tales of Grainne &  Diarmuid  Diarmuid faced the double-edged sword of betraying the geis or betraying his leader.  He took Grainne into exile and they fled the Fianna who pursued them to win her back for the king.  She had initially tricked Diarmuid into this situation and her powers of manipulation were strong.  The couple were chased all over Ireland, but they were assisted by the god of love, Oenghus.  They entered the forest of Duvnos which contained the tree of Immortality.",
		"In the forest a giant, Sharavan the Surly, guarded the tree of Immortality, and Diarmuid made an agreement with him that  Sharavan would leave the lovers in peace if Grainne and Diarmuid did not take any of the berries from the tree.  But Grainne soon persuaded her lover to pick berries and Diarmuid killed Sharavan in the process.  Soon Finn and his men caught up with the pair, and they entered the forest.  Finn knew that they were hiding in the tree of Immortality but decided to try to draw Diarmuid out.  He and Oisín played chess beneath the branches and Diarmuid couldn't resist dropping a berry onto the board to signify to Oisín which move to make.  Having been assured that Diarmuid was indeed amongst the branches, Finn sent Garva up to kill him.  But Diarmuid won and threw the body down.  But Oenghus changed his appearance so that Finn believed the body thrown to the ground was in fact Diarmuid."
	],
	"conclusion": "Grainne manages to pull Diarmuid away from his allegiance to the king and using the geis draws him into an unbreakable bond to her.  From this the love between the two appears to be strong, and Grainne plays a masterful role in the relationship"
}