{
	"name": "Labhraidh Loingseach",
	"overview": "Labhraidh Loingseach was a king of Leinster, famed for his generosity.",
	"motto": "",
	"stories": [
		"Cobhthach was jealous of his brother Laoghaire, the king of Leinster. He feigned illness, and Laoghaire visited him. As Laoghaire bent over him, Cobhthach stabbed him in the stomach, killing him. He then poisoned Laoghaire's son Ailill and took over as king. Ailill had a young son whom Cobhthach forced to eat the hearts of his father and grandfather. So disgusted was the boy that from that moment he ceased to speak, and was known as Maon (dumb). Cobhthach, desiring to be flattered as the new king, asked his bard to identify the most generous nobleman in Ireland. He was horrified when it was found to be Maon. Cobhthach instantly banished him from Ireland, along with the bard. Maon was now known as Maon Loingseach (exiled).",
		"They set out to France, on their way taking refuge with the king of Munster. The king had a beautiful daughter, Moriath, who was well guarded by her mother. The bard played soothing music on his harp so that her mother fell asleep, and Maon went in to the daughter. The next day, Maon set off to France. When her mother heard Moriath sigh, she realised that that was the sigh of a married woman. Moriath admitted that she was in love with Labhraidh, and so she and her mother hatched a plan to get him back. They sent Craiftine, the talented bard, to play a love lay to Maon. Maon was so delighted with it that he started to talk again, and was now called Labhraidh Loingseach. He was determined to return and claim his right to the throne of Leinster.",
		"Labhraidh and his men set out to take Dinn Rig, a fortress of Cobhthach. Craiftine played his magical music so that the men within the fortress all fell asleep, enabling Labhraidh and his men to take the fort. He then set his men to work building a great banqueting hall, entirely out of iron. When it was nearly completed, he set an invitation to Cobhthach to come to a great feast. Cobhthach accepted, and arrived with a great entourage. Fearing for his safety he refused to enter until Labhraidh's mother went in. A giant chain was then fastened around the building, so the doors would not open. Labhraidh ordered his men to bank great faggots of wood around the iron building, and set fire to them, baking everyone inside. Labhraidh then realised his mother was inside, and was in great consternation. His mother, from the inside of the building, exhorted him to continue in his endeavour to achieve vengeance for his father and grandfather, and so Cobhthach and all his followers were destroyed."
	],
	"conclusion": "Labhraidh was the rightful king of Leinster, and succeeded in retrieving it from his cruel granduncle. His period of dumbness hints at a blemish that might have prevented him from becoming king, but one that he managed to overcome. His close association with the harp as well as with celebrated poets and harpists denote his wisdom."
}