{
	"name": "Lir",
	"overview": "Lir of the hill of the white field (Sídh Fionnachaidh). White field is connected to descriptions of the sea that connects Lir to the god of the Sea, Manannán Mac Lir.",
	"motto": "",
	"stories": [
		"Lir was unhappy when Bodhbh Dearg (Bov the Red) was chosen as the King of the Tuatha Dé Danann.  He had thought himself a better candidate for the Kingship so when the decision was made he left the gathering without leave and with no word to anyone.  Later, Bodhbh Dearg, as a gesture of good will, offered Aobh (Eve) to Lir as his wife. She was the eldest and noblest daughter of Ailill of Aran and step-daughter to Bodhbh Dearg.",
		"Lir was very happy with Aobh. She gave him a daughter called Fionnuala and a son called Aed. But their happiness was not to last. Aobh died giving birth to twin boys called Conn and Fiacra.  Lir was distraught. So distraught that Bodhbh offered him another one of his stepdaughters, Aoife,  Aobh's younger sister. Lir was happy again. He showered his love on his four children. They would sleep in the same room as he and his new wife so he could see them last thing at night and first thing in the morning when he opened his eyes. Aoife became jealous of the attention her husband showered on his children. Her jealousy took such force that she cast the children into the shape of swans. Devoted Lir followed his swan children to Lake Derravarragh. He set up camp to be near them. Because of this a settlement grew around him. Bodhbh joined him there and they were as happy as they could be considering their fate and the fate of the beloved children. The swan children would sing beautiful enchanted music that had the power to heal the sick at heart. So Lir and his people were consoled. But this time by the lake was not to last. Three hundred years passed. The swan children's time on Lake Derravarragh was over. They left their father and his people to spend their second three hundred years on the stormy Sea of Moyle  (Sruth na Maoile).",
		"And three hundred years later when the swan children were travelling from the Sea of Moyle to the Atlantic Ocean to complete their final three hundred years, they flew over Sídh Fionnachaidh to look for their father and their people.  But all that was left was a grassy mound as the Tuatha Dé Danann had long since gone underground."
	],
	"conclusion": "Lir was a loving father, devoted to his children. He lived at the end of the days of the Tuatha Dé Danann before they went underground forever."
}