{
	"name": "Lugh of the Long Arm",
	"overview": "Lugh was the son of the beautiful Eithne who was the daughter of Balor of the Evil Eye. Balor imprisoned Eithne in a high tower so that she would never have a son, as it had been prophesised that he would be slain by his own grandson. But, in stealing the great cow called Glas Ghoibhneann from Cian, Balor drew him to his island in search of his property. It was then that Eithne first saw Cian, who she recognised from her dreams. Lugh was thus conceived.",
	"motto": "",
	"stories": [
		"When Lugh was born his grandfather ordered him to be killed. Ignoring the cries of his distraught mother, he was cast to the waves and all believed him to be drowned. However, the woman druid called Birog who had woven magic spells to bring Cian and Eithne together, cast another spell. That spell brought Lugh from the sea into the arms of his father. Lugh was fostered by Taillte daughter of the King of the great plain, and of Echaid the Rough. He was taught all the arts and his skill was so great with a sword and his reach so long and accurate that he acquired the name, Lugh of the Long Arm.",
		"One day when Lugh had grown; at the time when King Nuadhu had been restored to his throne, he arrived at the door of the King's fort. He asked the doorkeeper to tell the King that he wanted to join his household. The Doorkeeper told Lugh that no one could join the King's household without a special skill. 'I am a builder' said Lugh.  'We already have a builder' said the Doorkeeper. 'I am a smith, a champion, a harper, a warrior, a poet, a magician, a physician, a cup-bearer and a brazier' said Lugh. 'But we already have someone who possesses each of the skills you mention' said the Doorkeeper. 'Then do you have someone who is skilled in all these things together' said Lugh. And indeed there was no one so Lugh was admitted to the King's household.",
		"Before the second battle of Moytura, Nuadhu gave Lugh charge over his army. Lugh identified the special skill of all the leaders of the troops before going into battle. At the battle Lugh killed his grandfather Balor. Balor had lifted his eye with the intention of poisoning all it would behold. Lugh slew his grandfather with a slingshot that he aimed into his Evil Eye. Lugh became the new King of the Tuatha De Danann. He spared the life of Breas, who had connived against them in exchange for agricultural advice. Lúnasa the Irish word for August is called after him."
	],
	"conclusion": "Lugh the possessor of all the arts was a great King and leader.  He is seen as being an inventor of the arts, a guide on the journey , no matter what the road and also having an influence on and association with wealth and prosperity like the Tuatha de Danann generally."
}