{
	"name": "Manannan Mac Lir",
	"overview": "Manannan is regarded as the overlord of the semi-divine Tuatha de Danann. As such he is the sea god, since it is the sea which surrounds the island of Eire and protects it from harm.",
	"motto": "",
	"stories": [
		"Manannan is very like the Greek Poseidon in that he is depicted as riding the waves in a horse drawn chariot and wearing a huge cloak that flashes with many colours and catches the light just as the sea does.  It is said that all the treasured possessions of the Tuatha de Danann are in Manannan's care, and that he keeps them in a bag made of the skin of a crane!  When his young charge Lugh required assistance on one of his quests Manannan granted him a boat called the Wave Sweeper which obeyed the thought of the person in it and did not require sails or oars.  This boat also grew in size to accommodate any number of people necessary.",
		"Manannan also owned a horse that could travel with equal ease on land or sea, and a sword known as Freagarach - Answerer - which could penetrate any armour. Manannan was wed to the beautiful fairy woman Fand who was said to be flawless in her beauty.  The Irish warrior Cuchulainn fell in love with Fand and the two lived together for a time. Manannan was constantly roaming the countryside overseeing the affairs of his people.",
		"However, on seeing him pass by one day, Fand remembered the joy of their first days of life together and regretted her liaison with Cuchulainn.  She cried out that she had fallen in Manannan's esteem, but he came to her and shook his cloak between her and Cuchulainn so that they too forgot each other entirely.  Then Fand returned to Manannan's side and the two roamed the countryside together."
	],
	"conclusion": "Manannan is closely associated with animals of all sorts.  He had a herd of pigs, which were cooked and eaten, and then miraculously regenerated for the same fate the next day.  He is depicted as a distinguished white haired man, but like the sea is deemed unknowable in any true sense.  Like all the Tuatha de Danann he had a strong magical power, and seems to have been a fair over seer of the affairs of the inhabitants of Ireland at this time."
}