{
	"name": "Medb",
	"overview": "Medb was one of the daughters of the king of Tara, who killed her pregnant sister.  Medb then married Aillil and took over the territory of Connacht which would have belonged to her sister.  She was most famous for her role as the queen of Connacht during the Battle or the Brown Bull of Cooley, but she also has many mystical qualities, which mark her out as one of the many Celtic goddesses.  She was the goddess of sovereignty and territory, as can be seen from her independent and territorial character. She refused to let any king rule at Tara who had not first mated with her, and she was generally depicted as extremely promiscuous.  Her name has strong links to twhe word 'mead' and her constant seducing of different men is related to the intoxicating effects of this drink.",
	"motto": "",
	"stories": [
		"As in all her relationships, Medb had to be the dominant partner in her marriage with Aillil.  She felt her superiority was being challenged one evening during a recital the two made of their respective property.  Aillil said he had a white bull of matchless beauty among his herds.  Medb had nothing to compare with this, but she had heard that an Ulster man, Cooley, had a famous brown bull.  Medb wanted to possess this bull in order to surpass her husband, and she sent messengers to Cooley, demanding the bull.",
		"Cooley was inclined to grant her request until he heard one of the messengers, while drunk, say that even if Cooley did not give up the bull, that Medb would take it by force.  Cooley resented being dictated to by such a woman and so refused to part with the bull.  Thus began the famed Táin Bo Cuailnge, 'the Cattle Raid of Cooley', in which Medb sent all the hosts of Connacht to try to seize the bull. Cúchulainn, the famous hero of Ulster, stood against them for a time until the armies of Ulster were in a position to fight back.",
		"Medb tried to weaken the opposition through bribery and trickery, but was unsuccessful.  She persuaded her greatest warrior, Ferdia, to fight against Cuchulainn, who was his foster brother, in single combat, and this led to the death of the last champion of Connacht.  Her followers were then heard to repent that they had ever been guided by such a vengeful woman.",
		"On the eve of the final confrontation between the two armies the bull of Cooley was sent into Connacht for safe keeping. The bull bellowed on entering new pastures and was heard and set upon by Aillil's bull.  The two animals gored each other to death, symbolising the wasteful conflict between Connacht and Ulster.  Medb was ultimately killed herself by the son of her murdered sister, and it was thought that she was killed by a sling shot bearing a piece of cheese!"
	],
	"conclusion": "Medb was a strong and independent character, with a knowledge of magic and sorcery.  She never shirked her part of the work, and knew well how to encourage and lead her followers.  She was definitely the stronger partner in her marriage with Aillil.  She was always depicted as beautiful but was often seen dressed for war, leading the charge in her own chariot.  At times she was depicted as laughable, but she was a strong woman who was not to be crossed.  She was harsh and domineering, and thought nothing of causing an entire war simply to acquire more possessions and reassure herself of her superiority."
}