{
	"name": "Mess Buachalla",
	"overview": "Daughter of King Cormac of Ulster and Etain, who was daughter of a fairy-woman, she was abandoned because her father had wanted a son and was furious that the only child his wife bore him was a girl-child.",
	"motto": "",
	"stories": [
		"Rejected from the time of her birth, Mess Buachalla was cast aside by her father. He ordered his servants to cast the girl-child into a pit, but the baby smiled up at them with such love and trust that they could not bear to harm her. Against the king's orders, they took her to the cowherds of Tara, who fostered her and loved her dearly. (Mess Buachalla means \"the cowherds' fosterchild\")",
		"However, Mess Buachalla's life was still in danger. If her father ever found out that she was still alive, he might kill her. Her foster family built a house for her to keep her safe and hidden. The walls were high wicker, and there were no doors, only a window and a skylight. One day, one of King Eterscel's people looked in the window, expecting to see some food or stores that the cowherders kept. Instead he saw the most beautiful maiden he had ever laid eyes on! When the king heard of her, he was determined to make Mess Buachalla his wife. He sent his men to break down her house and carry her off without asking the cowherds. It had been prophesized to King Eterscel that a woman of unknown race would bear him a son, and he was sure that the woman in the prophecy was this beautiful and mysterious maiden.",
		"Mess Buachalla knew nothing of this, safe within her little home. Before the king ever arrived, a bird flew through her skylight, and when he landed on the floor, he cast off his birdskin. This beautiful otherworldly man made love to Mess Buachalla. He told her that King Eterscel's peple were coming for her, but that the son she bore would be his, and she was to call him Conaire and instruct him to never kill birds.",
		"Mess Buachalla was brought to the King, and he gave her every kind of luxury and sign of respect. Even her fosterers were raised up and made chieftains. When her son was born, she named him Conaire son of Mess Buachalla, and sent him to be fostered among three households so that he could be loved and cared for three times over, and learn all that he could.",
		"In due course, Conaire met with his true father and became the High King of Ireland."
	],
	"conclusion": "Mess Buachalla was the daughter of a king and the granddaughter of a fairy woman. Her connection to the Otherworld was strengthened when she met her lover, the bird-man. Thanks to her wisdom and guidance, Conaire received more love, and more perspective, by being fostered by three families."
}