{
	"name": "Midir",
	"overview": "Midir was one of the lesser lords of the Tuatha de Danann and is said to be responsible for crafting the rivers and lakes in the Irish countryside.",
	"motto": "",
	"stories": [
		"The main story concerning Midir relates to his courtship of the fairy maiden Etain.  He took her as his consort, thus enraging his wife Fuamach.  Fuamach changed Etain into a butterfly and then raised a wind which scattered her hundreds of miles away.  The butterfly was swallowed by a regional queen who was drinking wine one afternoon, and nine months later Etain was reborn as a mortal princess and grew to be as beautiful as she was in her previous life.",
		"Meanwhile Midir had been searching throughout the land for the woman he loved.  By the time he found and recognized Etain in her new form she had been married to Eochaidh, the King of Ireland.  Etain did not remember Midir as he tried to seduce her.  After a number of meetings however, she began to remember and love Midir again, but her sense of loyalty to Eochaidh would not allow her to leave hi.  So Midir presented himself in the court of Eochaidh and challenged the King to a game of chess.  The first time he allowed Eochaidh to win and then granted him fifty marvelous horses as his prize.  But the next time Midir won and claimed as his prize the right to kiss Etain.  Eochaidh was angry but could not disagree.  The only stipulation he made was that Midir was to wait one month before coming to claim his prize.",
		"When the time came for Midir's return, Eochaidh had the court surrounded by armed men, and he sat with Etain in the centre of the fort, fully expecting Midir to be unable to penetrate the guard.  The fairy king appeared through the roof however, and swept down to Etain and carried her off with him.  The two were seen circling the fort of Tara in the likeness of swans. Eochaidh roamed Ireland searching for his lost bride and dug up every fairy fort he came across.  Eventually he uncovered the stronghold of Midir, but the fairy lord then sent out fifty maidens all in the likeness of Etain and told Eochaidh if he could chose the correct woman he would have her returned to him.  Some versions of the story say that Eochaidh chose a woman who was in fact his own daughter, and thus committed incest.  Others say a magic bee settled on the correct Etain, thus enabling Eochaidh to win back his wife."
	],
	"conclusion": "Apart from this story, Midir remains a shadowy figure.  He is strongly associated with birds, often seen in the form of a crane or a swan.  He is a single minded character who knows what he wants, and adopts any means to get it.  Cunning is evident in his means of outwitting Eochaidh. He also has strong connections to the earth of Ireland, fashioning rivers, lakes and fairy forts.  Midir comes from the time when the Tuatha de Danann had been driven underground by the more modern Irish, and represents the more mystic less tangible side of the people."
}