{
	"name": "Naoise",
	"overview": "Naoise was one of the three sons of Uisneach, and his tale forms part of the Ulster cycle. He figures in the story of Deirdre, who was foretold as the cause of great sorrow to Ulster before she was born.",
	"motto": "",
	"stories": [
		"It was said that Deirdre would be very beautiful but that she would lead to trouble and strife among the men of Ulster.  In order to forestall this, the King of Ulster, Conchobar, had her hidden away and raised in seclusion in order that he might marry her himself when she came of age.  Deirdre was not so willing to be married to such an old man, and on seeing a stag killed in the snow, and a raven drinking the blood, she commented that she wished she could marry a man with hair the colour of the raven, cheeks the colour of the snow and lips the colour of the blood.  While walking in the woods one day after this she was attracted by the sound of beautiful harp music and came across Naoise playing by a river.",
		"He was of exactly the colouring mentioned above, and Deirdre fell instantly in love with him.  She pressured him to elope with her.  At first he resisted, because he knew of the prophecy surrounding her, but eventually gave in to his own love for her, and the two fled to Scotland accompanied by Naoise's brothers.  They lived there happily for a time, but Naoise grew homesick of Ireland, and when a message came from Conchobar that he had relented and wanted them to return, Naoise was only too glad to do so, despite Deirdre's foreboding.",
		"On returning to Ireland, Naoise and his brothers quickly realized they had been trapped. They made a valiant last stand and may in fact have won had not Conbhobar engaged sorcery on his side.  The three brothers were slaughtered, and on seeing their bodies lying in the snow, Deirdre threw herself on top of Naoise and died of grief.  However, in the conflict, many of the finest men of Ulster had lost their lives, thus fulfilling the prophecy."
	],
	"conclusion": "Naoise is a romantic figure, willing to risk all for his love and fight to retain it.  He is depicted as well loved by all and as a mighty warrior in his own right.  However, he does not exist outside of this story, and his function is to show the futility of defying prophecies.  He is remembered best for his extremely good looks sand his readiness to die for the woman he loved."
}