{
	"name": "Nemed",
	"overview": "Nemed arrived in Ireland with his wife Macha his four sons and their wives and twenty other Nemedians.  Nemed had lost all but one of a fleet of thrity two boats.  The nine Nemedians became settlers who cleared, like Parthalon, the forests of Ireland to create twelve more fertile plains. The Nemedians also had to fight the Formorians with their dark and evil ways.  They won three battles but finally lost the fourth and were destroyed.",
	"motto": "",
	"stories": [
		"Nemed and his family arrive din Ireland thirty years after the plague that had wiped out Parthalon and his people.  He had had a great fleet of ships that had been lost in a greedy pursuit of gold when they discovered a tower of gold in the sea.  In pursuit of the gold the sea had risen up to destroy the fleet, as well as nine hundred and fifty one of Nemed's people.  They became cultivators and settlers, and on the model of Parthalon cleared the forest of Ireland.",
		"They created twelve plains and by diverting rivers they created four new lakes.  One of these was named after Nemed's wife, Macha.  She was a seer and predicted in her dreams and vision great happenings on the plains.  One of these visions was about the creation of a grand court, which became known as Emhan Macha, after the place she was buried.  Nemed defeated the sea pirates, the Formoirians, in three battles.  He made four of the Formorians build a fortress which they did in one day.  He had a ruthless streak and killed them in case they built a better fortress for other people. Nemed died of a plague then on an island in Cork harbour.",
		"After his death, the Formorians gained the upper hand and eventually the Nemedians rebelled and attached the Formorian stronghold at Tory Island. They did capture the tower on the Island but reinforcements and the sea rising up led to a defeat.  It was a frightful slaughter and only one boat managed to get away.  Some, with Simeon fled to Greece.  Others went North to become the Tuatha de Danann."
	],
	"conclusion": "Nemed was a druid but also a great leader with the ability to engender prosperity and well being.  To do so required the skills to cultivate land, having cleared it but also the warrior that was able to defeat the Formorians.  With his wife, Macha, they constituted a powerful force whose role was taming nature and establishing a culture."
}