{
	"name": "Nuadhu of the Silver Arm",
	"overview": "Nuadhu was the King who led the Tuatha Dé Danann into Ireland. He brought the great sword of Nuadhu from which no opponent ever escaped.  This sword was one of the four special gifts the Tuatha brought with them. His army defeated the Fir Bolgs, but he lost his arm in the battle and therefore lost his Kingship, as there was a condition that the King of the Tuatha Dé Danann must be perfect in every way.",
	"motto": "",
	"stories": [
		"Nuadhu led the Tuatha Dé Danann into battle and took the land from the Fir Bolgs who resided there at that time. During the first battle of Moytura, his right arm was severed in combat with the Fir Bolg warrior Sreang. Nuadhu asked Sreang to tie up his own right arm to continue with the combat in a fair way but Sreang refused. The Tuatha Dé Danann intervened and offered the province of Connaght to Sreang to save their beloved Nuadhu.",
		"Breas the Beautiful gained the Kingship because of Nuadhu's imperfection. And while Breas reigned, Nuadhu's physician, Dian Céacht, magically fashioned him a silver arm, hence, he became known as Nuadhu of the Silver Arm. However, Dian Céacht persisted with his magic and restored his arm to perfection after an operation that lasted nine days where the physician never left Nuadhu's side. He was perfect  and eligible to be King again.",
		"At the second Battle of Moytura when the Tuatha Dé Danann went to battle with the Formorians, King Nuadhu gave Lugh authority over his army. At that battle, Nuadhu was slain by the powerful Formorian, Balor of the Evil Eye. When Nuadhu lay dying, the phantom queen, The Morrigán appeared in the shape of a black crow and screamed encouragement at the De Danann troops. Fresh courage was restored and they went on to win the battle. After this the Kingship went to Lugh."
	],
	"conclusion": "Nuadhu was a wise King who was loved by his people. His story embodies the idea of the 'perfection' in the king.  The fact that he gave up his kingship to Lugh is indicative of a recognition of a code of Sovereignty seen as 'bigger' than only one man."
}