{
	"name": "Oisin",
	"overview": "Oisin was the son of Finn Mac Cumhaill and one of the brightest lights of the Fianna.  He was a skilled warrior, but also a poet and bard, and it is said that he wrote down many of the deeds of the Fianna in the interests of historical record.  Oisin had a strong sense of justice, and he was one of the supporters of Diarmuid against his own father, as he deemed Finn to be acting unfairly.",
	"motto": "",
	"stories": [
		"The main story concerning Oisin himself tells of his journey to the fabled land of Tir na nOg - the land of youth.  While out hunting with the Fianna one day, a beautiful maiden appeared on a white horse and challenged Oisin to accompany her.  Not one to resist a challenge, and captivated by her beauty, Oisin mounted the horse behind the woman and rode off with her.  She spirited him away to the fairy world of Tir na nOg, where the two lived happily for many years.  She was a princess in this land and her name was Niamh.",
		"Despite his happiness with Niamh, Oisin felt homesick for Ireland on many occasions.  Eventually when the longing grew too great, Niamh lent him her magical horse to make the journey back to his homeland.  He said he merely wished to see his father and friends one more time and to see how they were.  Niamh instructed him not to set foot on Irish soil if he wished to return safely to her.  Oisin set out and soon reached Ireland, but found a changed landscape there.",
		"While riding through the countryside he came across a group of men trying to shift a giant boulder.  The men of the Fianna would have had no trouble with this rock, but these men seemed puny and small compared to the Fianna.  Oisin lent down from his saddle to lend a hand, but the stirrup broke and he went crashing to the earth.  On touching Irish soil he instantly shriveled into an old man of 300 years old - the length of time he had been absent.  The men brought him to St. Patrick to be baptized before his death, as Christianity had come to Ireland.  Some say that Oisin was willingly baptized and died soon afterwards, while others say he argued long and hard with Patrick, denying Christianity and finding fault with the faith of the monk."
	],
	"conclusion": "Oisin was a poetic character who combined the elements of culture and martial skills.  He was well respected and loved by the Fianna, and his sense of justice made him highly valued.  He was worthy enough to be summoned by a fairy woman, and his downfall lay in the love he had for his country and people, and his desire to return to them once more."
}