{
	"name": "Partholon",
	"overview": "Paratholon was a civilizer who cleared forests, diverted rivers and what we would call a businessman today, in that he brewed ale and opened guest houses.  He also established laws of title and property.  He was betrayed by his wife, the beautiful Delgnat.  Partholon and his family first arrived after the Flood with a large retinue.  Plague killed most of his people.",
	"motto": "",
	"stories": [
		"The Story is that Partholon fled Greece after having killed his mother and father in an attempt to wrestle the kingship from his brother.  This parent killing ensured he was faced with bad luck and indeed he did have bad fortune and lost his left eye.",
		"He arrived in Ireland with his wife, the beautiful Delgnat sx ome time after the Flood.  They were accompanied by their three sons and their wives.  Partholon was a settle who cleared the forests, leveled plains, brought cattle to Ireland, brewed ale and set up guest houses.  Partholon and his people, in other accounts, encountered the demonic Formorians and defeated them in the Battle of Magh nLotha in Soille Donegal.  The conflict was a magic battle that lasted for a week, fought on single legs, single arms and single eyes.  It was, therefore, a mythic contest between other world powers.",
		"Another story tells of a time when out hunting, his wife, Dalgnat seduced a servant and together they drank from Partholon's special brew of ale.  The tap of the barrel of ale had magical properties which revealed culprits.  In a court set up by Parthalon, again a civilizer, as lawmaker, Delgnat was charged with adultery.  She defended herself on the grounds that she was vulnerable while he was away.  She won.",
		"In the end, Partholon, who had been very successful in fighting off the Formorians was defeated by a plague.  Partholon died.  But his story was told by his nephew Tuan, who fled to the mountains, hid in caves to avoid wild animals while all the time watching the cultivated land returning to wild."
	],
	"conclusion": "Partholon was a settler with a troubled past.  He had a long list of achievements from warrior, farmer, lawmaker.  His wife's betrayal led to law being established.  Ultimately it all came to nothing because of the ravages of a plague."
}