{
	"name": "Scathach",
	"overview": "Scathach was a warrior queen whose name meant 'The Shadowy One'. She lived in Western Scotland and ran a training academy for young warriors.",
	"motto": "",
	"stories": [
		"The great Ulster warrior Cuchulainn was Scathach's most famous student.  He sought her out because the father of the woman he wished to marry, Emer, had said they could not wed until Cuchulainn had been trained as a champion by Scathach.  In this he was hoping to avoid giving his daughter to the hero, since it was notoriously difficult to find Scathach's island and survive her training course.  Through his bravery and strength Cuchulainn found his way there and used his famous 'salmon leap' to gain access to her stronghold.  He threatened her at sword point in order to persuade her to teach him everything she knew.  She granted the young warrior three wishes, to instruct him properly, to grant him her daughter without bride price and to foretell his future.",
		"She told him she foresaw a great and glorious career for him but did not see him living any longer than thirty years of age.  Scathach did grant her daughter, Uathach, to Cuchulainn but it is said that she also lay with him.  She taught him his art carefully and at the same time she taught the young warrior Ferdia, who became Cuchulainn's brother in arms.  Both were educated to an equal level, but Scathach gave Cuchulainn one gift in secret.  This was the legendary Gae Bolga, a spear which separated in to barbs on entering human flesh.  Its first strike was always fatal.  It was this weapon, which caused the death of Ferdia when the two men were forced to fight against each other in the saga of the Tain.",
		"In return for this instruction, Cuchulainn stood against the enemies of Scathach led by the warrior queen, Aife.  He saved the lives of Scathach's two sons and went into battle as her champion against Aife.  He held a sword at Aife s throat and made her promise to give hostages to Scathach, to keep peace forever more, and to bear him a son.  This Aife did and Cuchulainn returned to Scathach to rest after his great deeds.  He left her island after seven years fully trained in the arts of war and was famed as the greatest warrior Ireland has ever known as a result of her teaching."
	],
	"conclusion": "Like her name suggests, Scathach is a largely shadowy figure. We have an impression of a strong and fiercly independent woman who was respected and revered by the warrior society. She is an otherworldy character and her granting of the Gae Bolga to Cuchulainn is strongly reminiscent of the Lady of the Lake granting Excalibur to Arthur. Through her instruction he became the champion for all Ireland while she herself remained famed for her own skills and magic."
}