{
	"name": "Sleeping Ulstermen",
	"overview": "Once a year the men of Ulster were stricken down with a sickness that lasted for nine days. During this time they were vulnerable and helpless and the reason was an ancient curse laid on them by the goddess Macha.",
	"motto": "",
	"stories": [
		"Macha was one of the great Celtic goddesses with responsibility for fertility and prophecy.  She was a strong and independent woman and the story tells of how she took human form one day and went to the house of a rich farmer Crunnchu.  Without saying a word to anyone she took over the household preparing and organising the servants.  That night she lay down beside Crunnchu and they lived as man and wife for a long time.",
		"Macha was pregnant when Crunnchu set out to attend the great assembly of Ulstermen and she warned him to say nothing of her to anyone, since to do so would mean the end of their union.  Crunnchu promised to say nothing as he set out.  In the course of this assembly, the horses of the king raced while everyone looked on in admiration and swore that no swifter creatures existed in Ireland.",
		"Crunnchu was then heard to boast that his wife could out run them.  In fury the king had him seized and sent for Macha so she might prove her husband's boast - or else he would die.  Macha came and was ordered to face the king's horses.  She asked for a delay since she was heavily pregnant but the king threatened to kill Crunnchu if she stalled any longer.  None of the bystanders came to her aid and so Macha raced against the two horses.  As she ran she went into labour, yet she crossed the finishing line ahead of two horses.  At the finish she gave birth to twins, then turned on the crowd and lay a curse on them.",
		"Since they refused to help her, she decreed that they themselves should feel what it is like to be in labour for nine days and nights, during which they would be as powerless as any woman in such a state.  Only women children and men not descended from Ulster would be immune from this curse.  And it happened exactly as she said.",
		"Each year the Ulstermen were laid low by their pangs and during this time they were utterly helpless.  It was during one of these episodes that Meadbh and her Connaught men attacked Ulster in the Cattle Raid of Cooley and Cuchulainn, not being an Ulsterman, was the only man who could stand against them until nine days of birth pangs were completed."
	],
	"conclusion": "The sickness of the Ulstermen was their one vulnerability and resulted from a curse they incurred through lacking consideration and respect for a goddess.  During the nine days they were incapacitated that they might as well have been asleep and it was an excellent time for anyone to mount an attack on them."
}