{
	"name": "The Bulls",
	"overview": "White Horned was connected with brightness, illumination and wisdom.  The personification has a story attached to it of a boy emerging from mystical waters already physically mature in striking ways.  Like having grown hair bright in colour and speaking in verse.  His babyish way of sucking his thumb was a sign of his wisdom. The Brown Bull of Cooley was seen to be coming from the dark and shadowy realm of the dead.  Medieval literature connects his name to each and every other worldly place.  He is associated with an island called Bull Rock and Knockfierna - a very conspicuous hill in the middle of Limerick and the great sand dunes at Dunbeg on the west coast of Clare.",
	"motto": "",
	"stories": [
		"Their story begins with two pig keepers; Friuch from Connacht and Rucht from Munster.  The pig keepers were on very good terms and each year they visited each other depending on where a mast of oak and beechnuts fell first.  If they fell in the north they would travel northward.  If they fell in the south they traveled southward.",
		"Friuch and Rucht both had the power to change themselves into any form and the people of the provinces started competitions between them as they argued about which had the greatest power.  When Rucht visited Friuch, Friuch cast a spell on his pigs which meant that even though they would eat they would remain lean.",
		"The following year Rucht cast the same spell on Friuch's pigs.  While this proved them equal, they were both fired as pig keepers by their respective Kings Ochall Ochne and Bodb.   After this they spent two years as birds and they made a terrible babble.  Then two years as sea creatures.  Then two years in rivers where they were seen devouring each other in the Siuir.  Two years as stags making a shambles of each other's dwelling places.  Two warriors gashing each other.  Two phantoms terrifying each other.  Two dragons pouring snow on each other's land.  Two worms, one who got into the spring at the river Cronn in Cuailnge where a cow belonging to Daire mac Fiachna drank it up.  The other got into the well spring Garad in Connacht where a cow belonging to Meadbh and Ailill drank it up.  They sprang into two bulls, Finnbhennach and Donn Cuailnge."
	],
	"conclusion": "It would seem that the Bulls were destined to live their lives in opposition."
}