{
	"name": "Tuatha Dé Danaan",
	"overview": "After a great battle with the Formorians, where most of the Nemedians died, three groups managed to escape, and scattered around the world. One group worked hard to hone their skills and returned to Ireland under the aegis of the goddess Danu. Before their return, they had visited four great cities of the North. Falias, Gorias, Finias and Murias. In each city they added to their knowledge of science and craftsmanship, learning from the greatest sages. From each city they collected a magical treasure. From Falias they got the Lia Fáil, the stone of destiny, which roared when a rightful king took his seat upon it. From Gorias they brought the claíomh solais, or sword of destiny. From Murias came the cauldron of the Daghdha, which could feed a host, however large, without ever being emptied. From Finias came the Sleá Bua, a magic spear.",
	"motto": "",
	"stories": [
		"Meanwhile, the Fir bolg had come to Ireland and settled there. A great mist descended on Western Connaught, and when it lifted the Firbolg discovered that a fortified camp had been built. They approached the fortifications, where they were met by a group of beautiful, tall, fair people. They curiously examined each other's weapons. The weapons of the Tuatha were light, bright and sharp, and the weapons of the Fir bolg were blunt and heavy. They agreed that the two races should divide Ireland equally, and join to defend the territory against all newcomers. They bowed, and exchanged weapons.",
		"The Fir bolg later decided to refuse their offer, and a battle commenced on the plains of Moytura. Nuada, the king of the Tuatha Dé, had his hand cut off, but they were ultimately victorious. They magnanimously allowed the Fir bolg to keep the province of Connaught, while the Tuatha occupied the rest. Because of his blemish, Nuada could no longer rule as king. The warrior Bres was crowned in his place. Bres was only half Tuatha Dé Danaan, his mother being a Formorian. Because of this relationship with them, Bres allowed the Formorians to impose taxes and to oppress the Tuatha Dé. The Tuatha eventually deposed Bres and refused to pay the tribute, and so the Formorians prepared for battle.",
		"Lugh, also of mixed ancestry, arrived at the fort of the Tuatha. He took charge while the Tuatha were kingless, accepted because of his many talents. The Tuatha defeated the Formorians in this epic battle, where Lugh slew the leader of the Formorian, Balor, by smashing his poisonous eye through his forehead. Diancecht made a silver arm for Nuada, who resumed his post as king.",
		"Notable personalities: Daghdha (father god), Nuada (king of the Tuatha), Lugh (half Tuatha Dé and half Formorian), Brigit (goddess of the hearth, of wisdom and of poetry), Aonghas (love god), Boann (goddess of water and fertility), Diancecht (god of healing), Morrigan (goddess of war and death), Macha (goddess of war and fertility), Ogma (god of eloquence and language)."
	],
	"conclusion": ""
}