{
	"title": "Finn and the Fianna",
	"content": [
		"After his tutelage with Aengus, Finn decided to seek out his father's brother. Because Goll Mac Morna was still leader of the Fianna, Finn's uncle was living with the remnants of Clan Baiscne in the forests, as humble hunters, no longer a part of the Fianna. Finn found them without too much trouble, for all he had to do to know where they were was chew on his thumb. He introduced himself as Cumhaill's son. They were delighted to meet him, and when they saw that he had managed to find Cumhaill's precious Oxter bag, they decided that the best thing to do would be to get him instated as the leader of the Fianna. So they set off to Tara to present him to the High King.",
		"Now it happened that they arrived at Tara on Samhain eve, when the High King was preparing to put on his Samhain feast. This was his tradition every year, but for the last number of years, something dreadful would happen at this feast. Every year, the men sitting around the table would fall asleep, and when they woke, the High King's hall would be on fire.",
		"Finn Mac Cumhaill decided that he was going to do something about this. He decided that he would stay up all night to see what was going on. He made sure he would not fall asleep by standing with his head rested against the tip of his spear. Every time his head nodded, its weight would press into the spear's point and wake him.",
		"First, he heard an eerie song of great sweetness. All the men in the hall fell asleep at the sound of it, but Finn managed to keep himself awake. He saw a hillside near Tara, which was a fairy fort, open up, and magical creature emerging from the earth. It was singing the sweet song, and its breath was fiery. When the creature approached Tara, Finn doused its fiery breath with his cloak, and raced out to fight with it. The creature retreated back to the hillside, but just as it reached the fort, Finn Mac Cumhaill struck off its head! The hillside started to close, so Finn stuck his hand in to try and keep it open, but his thumb got stuck and he had a hard time to pull it out!",
		"The people of Tara woke up, and there was great rejoicing when they found that the hall was not on fire around them, and the Finn Mac Cumhaill had killed the terrible fiery beast! The High King praised him, and Goll Mac Morna gave up his leadership of the Fianna to Finn. Each man of the Fianna put his hands in the hand of Finn as a token of loyalty, and in this way, he became their leader.",
		"He met the heroes of the Fianna: Caoilte Mac Ronan, the fastest man in Ireland. Diarmuid, who was born with a love spot on his forehad, which meant that any woman who saw him would fall in love with his beauty. Conan Maol, who was Goll Mac Morna's brother, and lost all the skin on his back because of an enchantment, and had the skin of a sheep stuck there instead.",
		"As leader of the Fianna, Finn made some changes. The tests that a man had to pass to become one of the Fianna were already difficult, but Finn upped the ante. To join, a man had to be able to jump over a branch held higher than his head, and run under a branch held lower than his knees, without slowing his pace. He had his hair tied into braids, and all the Fianna would chase him through the forest, trying to catch him. If he was caught, of course, he failed, but he also failed if any hairs of his head came undone from the braids, or if he snapped a single twig on the trees as he ran, or if he startled a single bird into flight. Then he would have to stand in a hole up to his waist, with only a stick to fend off the entire Fianna, all armed with their swords, and if they could cut him or undo a single braid in his hair, he would not enter. He had to learn twelve books of poetry, and had to give up his ties to his family, swearing that he would never take revenge for their deaths, and they would not be allowed to avenge his death. He had to swear that he would not take any dowry with a wife, but would marry a woman for her own merits alone.",
		"Under Finn's leadership, the Fianna defended Ireland from threats inside and out. They often took it upon themselves to help the weakest and least powerful people in society."
	]
}