{
	"title": "Oisín in Tír na nÓg",
	"content": [
		"There was nothing the great Finn Mac Cumhaill liked more than a feast with a story and song, except for a hunt with his hounds and his men. He was out one day hunting, enjoying the freedom of running through the land, with his hounds Bran and Sceolan by his side, and the rest of the Fianna and their dogs running behind. The dogs caught the trail of a doe, and they began to chase. Normally, the hounds of the Fianna would play with a doe a little, and take pleasure in the hunt, before bringing her down, but this time, the doe seemed to be the one in charge. She led them on a game, weaving through the forest, dancing hither and tither, and seeming to tease the hounds.",
		"Finn was puzzled by this - he could see this was no ordinary doe - and he followed all the more eagerly, keen to catch such a prize. The doe ran so swiftly that soon the rest of Finn's men began to fall behind, till at length there was only Finn and his two hounds keeping up with her. Then Bran and Sceolan ran out in front of him, and he saw that instead of chasing the deer, they were running by her side, gambolling playfully. He thought again that this was no ordinary deer. The deer stopped and waited for Finn to catch up to her, and when she turned to look at him with a very human look in her eyes, he thought for a third time that there was something special about her.",
		"Then the deer turned into a beautiful young woman. She told him her name was Blaith Dearg, the daughter of Finn's great enemy, Dearg. She had been enchanted to take on the form of a doe. She invited Finn to step onto the hill of Allen with her and join her for the night. So he did, and he gave her his love, but when Finn woke up the next day, Bran and Sceolan were whining in sadness, and Blaith Dearg was nowhere to be seen.",
		"Finn spent a long time looking for her, but there was never any trace of her to be found, and he never found any tracks around the hill of Allen. His heart was empty, and he never forgot the great love he had for her. A year and a day later, he was on the hunt again, and once again Bran and Sceolan leapt out in front and ran ahead. Finn pursued, leaving the rest of the Fianna behind, and caught up to them at last. They were smiling the way dogs smile, and playing in front of a rowan tree, where he saw a baby sitting in the grass. He picked the baby up, and saw a doe's tail flash as she ran into the forest. He realized that this was Blaith Dearg's baby - his baby - so he took him in and raised him as his own son.",
		"Finn named the boy Oisín, which meant little deer. He fostered Oisín out, and Oisín grew up to be a most beautiful man, with the purest heart and the bravest deeds, and a great love of poetry. In time he passed the tests to join the Fianna, which were:",
		"To tie the hair into seven braids, and run through the forest with all the Fianna in pursuit, and to come out the other side without breaking a single twig, or disturbing a single bird, or loosing a single hair from the braids. To be buried up to the waist and fend off all the Fianna. To learn off eight books of poetry and be able to sing them with such beauty that all would be moved to tears. To run under a branch set at the height of your knees and jump over a branch set at the height of your heart, without slowing pace. And no man since Finn Mac Cumhaill performed these tests so well as did Oisín.",
		"Oisín became the leader of one of the clans of the Fianna, and everyone thought him a match for his father, who promised to become even better. They loved him, and his fame was sung throughout the land.",
		"Now, one morning at sunrise, Oisín was sitting on the beach, staring out to sea and watching the sun rise, and he saw the sunlight as it travelled across the water towards him, and marvelled at the illusion it made, seeming like a road on the water. And suddenly the sunlight turned into a vision of a woman riding on a white horse down that golden path on the sea. She came closer and closer, and he saw that she was the most beautiful woman he had ever seen, with hair like burnished gold.",
		"The woman approached him on her white horse, and sang to him in the sweetest voice. Oisín was enchanted. The woman told him her name was Niamh Chinn Ór from Tír na nÓg. She had heard tales of his prowess and his beauty, of his pure heart and poetry, and she desired him. She told him she came from a land where there was no sorrow or death, and where time had no dominion and a hero could remain strong forever. She asked him to come with her there and live with her as her husband.",
		"With a heart full of love for Niamh and love for adventure, Oisín leapt up onto the back of the white horse and off they went across the waves to Tír na nÓg. There he lived as her husband, in perfect happiness. They had three children together, and every time Oisín began to miss his home or his family, Niamh would come up with some hunt or feast or entertainment to distract him from his homesickness till he was content again.",
		"But after what seemed like three years, the pangs in his heart could not be ignored. He missed his comrades in the Fianna, and he missed his father. He asked Niamh if he could go back to Ireland for a visit. Sadly, Niamh told him that time passed slowly in Tír na nÓg, and the land that he wanted to return to no longer existed. Oisín was devastated to hear this, but insisted that he had to see it with his own two eyes before he would accept it. So Niamh put him up on her white horse, and told him that it was very important that he not set foot on the land of Ireland, or he would never be able to return to her and their children.",
		"So off he went, and the horse carried him across the sea. He came to a land that had been changed beyond recognition. All the forests where he and the Fianna had loved to hunt had been chopped down, and turned into pasture. As he travelled around Ireland, he saw people no bigger than children, small and grey and weak. All the forts were tumbled stone overgrown by weeds and grass. He saw nothing he recognized anywhere. He travelled across Ireland and back again, his heart breaking, realizing that the time of the heroes had passed. He asked people about Finn and the Fianna, and they laughed at him for believing such silly stories had ever been true.",
		"His heart broke again, and he turned the horse around to take him back to Niamh and his children where he could forget his heartbreak. As he was leaving, he saw four men in a field trying to move a boulder with a lever, but it was too big for them, and though they were sweating and straining they were making no headway. Kind-hearted as ever, Oisín told them to stand back, and he leaned over in his saddle and lifted the stone with one hand. As he threw the stone, the girth of the saddle snapped, and he fell from the horse's back and touched the ground.",
		"The minute he landed, all the hundreds of years that had passed caught up with him and he grew into an old man. The horse sprang away, and galloped across the sea. Oisín's teeth fell out, his hair whitened, his muscles shrivelled and his skin wrinkled. The people around marvelled at the sight of this strong, beautiful young man turning into a withered ancient in front of their eyes.",
		"Oisín told them his story, telling them of Finn and the Fianna, and they couldn't decide if he was mad or a liar. They decided that they had better bring him to the holy man, Saint Patrick. So Oisín was brought to the saint, and told him all his stories of the olden days, which St. Patrick wrote down carefully. In return, St. Patrick told Oisín of Christianity, and the promise of eternal life. But Oisín couldn’t see the use of the rules of the Christian god, when he and his friends had lived by honour codes. St. Patrick couldn't find an argument to convince him. He offered to baptize Oisín into Christianity, and Oisín asked if Finn mac Cumhaill had been baptized? St. Patrick said he was not, and was no doubt in hell for all eternity, because he was a pagan. He told Oisin that this would happen to him, too, if he did not convert. But Oisín said there was no army of demons that could keep Finn Mac Cumhaill anywhere he didn’t want to stay, and he would rather stay a pagan and join the his father and the Fianna, wherever they were, than to go to a heaven that would not let his father in. So Oisín died unbaptized, and was buried by St. Patrick."
	]
}