{
	"title": "The Birth and Boyhood of FINN MAC CUMHAILL",
	"content": [
		"In Ireland long ago there was a powerful fighting force called the Fianna. This was a group of young men, who lived off the land, hunting and tracking in the summer months, and feasting and merry-making throughout the winter. They had all given up their family ties and their places in society to live this way, but they followed a strong set of values. Their mottos were: Strength of limb, purity of heart, and actions to match our words.",
		"None of the Fianna owned land, or had any strong attachment to belongings. They were famous for their generosity; it was said that if the leaves on the trees were made of gold, and the waves on the sea were silver, the Fianna would give them all away. They were unfailingly generous, and expected the same measure of hospitality from others. Every house in Ireland had a door in those days that could be knocked on by the Fianna, and they would be welcomed in and given whatever aid they asked for. They went wherever they wanted in Ireland, North to South, East to West, and knew all the secrets of the land: the best places to sleep, the best places to find food, and the places that led to the Otherworld, and had to be respected.",
		"Once, a group of noblemen's sons sought out the Fianna and asked to join them. A man called Cáilte Mac Rónáin, who was a member of the Fianna, told them a story. A king of Ireland died, leaving two sons. The sons decided to divide Ireland equally between them. One son chose all of the valuables, the goods, the herds, rings, ornaments, forts and towns of Ireland, and the other chose all of the cliffs, rivers, nuts, fruits, the speckled salmon and the wild game. The noblemen exclaimed that this was a very unfair deal! And Cáillte replied that it showed the two kinds of men there are: one that would value the first half of Ireland, and one that would value the second. Each of that king's sons felt he had by far the better deal, but it is only the second kind of man who would be happy in the Fianna.",
		"During the summer months, the Fianna roamed throughout Ireland, hunting and living wild. But during the winter, they would stay in the houses of noblemen. And in exchange for this generosity, they acted as mercenary warriors on their behalf if they were needed. They paid for their lodging with entertainment: every night was a feast when the Fianna were around. There were great storytellers, poets and musicians among them, and their tales of their summertime adventures made the winters seem short for whoever they stayed with.",
		"Now, there were two main groups within the Fianna. They were called Clan Morna and Clan Baiscne. Cumhaill, the leader of the Fianna, was from Clan Baiscne, and he was acknowledged by all as the leader. He was a great warrior, with great judgment and perception, and he owned a magical artefact called the Oxter bag. It was made out of Stork Skin, and it was one of the treasures of the Fianna. Whatever Cumhaill needed something, he had only to reach into the Oxter bag and it would be there in his grasp, no matter what it was. But there was a member of the Morna Clan, called Goll Mac Morna, who was the most powerful warrior in the Fianna, and every now and then, he would butt heads with Cumhaill. He often defied Cumhaill's leadership in small ways, but nothing ever brought the conflict to a head, and Goll Mac Morna would always back down from directly challenging Cumhaill. One winter, tensions were so high between Cumhaill and Goll Mac Morna, that the two clans split up for the winter. Clan Baiscne stayed with a Druid named Tadhg, and Clan Morna stayed with Conn Cead Cathach, the King.",
		"Tadhg had a daughter called Muirne, and Cumhaill fell in love with her over the course of the winter, and asked the druid for her hand in marriage. He refused, but Cumhaill was so in love with her that he defied the druid. He abducted Muirne, hoping to bring her back to her father after she had agreed to marry him, presenting it as a fait acompli, but when Tadhg heard what had happened, he was furious. He went to the King, Conn Cead Cathach, and asked him to send his army to kill Cumhaill, and slaughter his half of the Fianna. Now, of course, the King's army at this time was the other half of the Fianna, the Morna clan, so the two factions of the Fianna found that they had to go into battle against each other.",
		"During the fighting, Goll Mac Morna killed Cumhaill, and took leadership of the Fianna.  The Oxter bag was stolen, and the great treasure of the Fianna lost. But Muirne had conceived a child with Cumhaill before he died. The druid Tadhg was furious, and threatened to kill Muirne, but her sister Bodhmall stepped in and brought her to Slieve Bloom and placed her under her protection. Muirne gave birth to the child and named him Deimne, and for the first six years of his life, he was raised on Slieve Bloom by his mother and his aunt. Muirne was a deer woman, that is, she could run with the deer, and swifter than the deer, and she taught her son to do the same. This was how he got his name, Deimne, which means 'little stag', and he could run as swiftly as a deer and swim as well as a salmon. His aunt, Bodhmall, was a trainer of warriors, many of whom went on to attempt the difficult tests to join the Fianna, and so she taught Deimne all the martial arts of Ireland as well. When he was a little boy, she used to play a game with him where she would chase him around a tree with a bit of ragweed in her hand, hitting him on the backside, until he was able to catch up with her and hit her with the ragweed!",
		"By the time Deimne was six, Goll Mac Morna heard of him, and decided to kill him, and his mother. Bodhmall dressed Deimne in rags and sent him off with a group of travelling poets. They took him the length and breadth of the country, going to all sorts of different households, and they nicknamed him Finn, because of his golden hair. He spent a year with them, learning their stories and poetry, and then, at the age of seven, he met a woman whose son had been killed by a great warrior. Knowing the bond between mother and son, Finn promised to avenge her son's death. He found the warrior, challenged him to single combat, and killed him. He found a strange-looking bag on the warrior's body, made of stork skin. It turned out that this was the very same man who had stolen the Oxter bag from Cumhaill's body! Fiinn did not know anything about this, but he took the bag with him.",
		"Next, Finn went to study with an old Druid called Aengus, who had dedicated the last seven years of his life to fishing, and nothing but fishing. He was trying to catch the Salmon of Knowledge. Every year, the salmon of knowledge swam into the Otherworld, ate a berry from the tree of life there, and swam back to this world again. The berries from the tree of life gave him all the knowledge of the world, and it meant that whoever ate this salmon would then have access to all knowledge, of this world and the otherworld. After seven years crouched over his fishing pole, Aengus was crooked and gnarled by the time Finn came to him, and he was skin and bone, because he neglected to do anything that would take him away from his fishing. Finn offered to stay with him, and hunt and cook for him, in exchange for Aengus taking him on as his pupil.",
		"Aengus got his strength back under Finn's care, and he taught the boy the art of composing poetry, as they sat by the riverbank. At long last, Aengus was successful in his quest. He caught the wily salmon of knowledge! He gave it to Finn to cook, but warned him that he was not to take even the smallest taste of the fish: it was for Aengus alone. Now, as Finn was cooking the fish over the fire, a blister rose up on its skin, which he burst with his thumb. He burnt his thumb on the blister, and put it in his mouth to cool it down. When the fish was cooked, Aengus took one bite of it and knew that someone had tasted it before him: the knowledge was gone! He asked Finn if he had taken even a small bite, and Finn protested that he had not. At last, he told Aengus that he had burnt his thumb on the fish, and put it in his mouth to cool it. Aengus said Finn might as well have the rest of the fish, as he already had all the knowledge in the world. Finn said that he didn't feel any different, so Aengus told him that he had to put his thumb in his mouth to access the knowledge he needed. Any time after that, when Finn needed to know something, or see the future, all he had to do was put his thumb between his teeth, and he would know the answer."
	]
}